[
  {
    "Other": "How would you format their appearance in the entry?",
    "Zaltys": "Can include that in `Attributes:`, or add a separate `Appearance:` field.\n...honestly, I no longer remember what went in Euterpe, so not sure which works best. It was ages ago.",
    "timestamp": "2022-11-07T20:22:11.553000+00:00",
    "date": "m11-d07"
  },
  {
    "Other": "is there a way to get the AI to properly read the entry logs in the lorebook? I have a party of three with a half-elf in it but the AI keeps getting him confused with another character's name.",
    "Zaltys": "Not with complete accuracy. But there are various tricks to make it work better, such as adding a short 'active characters' list to Memory. ```\n----\nCharacters:\nGorran: small description, something simple like `Male half-elf, warrior, party leader`\nName#2: -\"-\nName#3: -\"-\n***```",
    "timestamp": "2022-11-07T19:53:39.665000+00:00",
    "date": "m11-d07"
  },
  {
    "Other": "honestly, probably *every* specific name it spits out comes from somewhere, at some point",
    "Zaltys": "Challenge accepted.",
    "timestamp": "2022-11-07T16:23:23.242000+00:00",
    "date": "m11-d07"
  },
  {
    "Other": "If you clear all the text from a story but keep the same settings, does it mess anything up or is it a clean start?",
    "Zaltys": "Clean. In the sense that the AI will disregard the old outputs. Though they'll still remain in the tree, and can be undoed to.",
    "timestamp": "2022-11-07T11:31:24.128000+00:00",
    "date": "m11-d07"
  },
  {
    "Other": "So if a city gets destroyed in my story, then *** happens and something completely different is being talked about, will the city being destroyed be brought up again?",
    "Zaltys": "It might, but without a chapter header it's always hard to know where the AI is going. It might've even turned into some kind of '500 years in the future, after the apocalypse' scenario.",
    "timestamp": "2022-11-06T12:40:19.230000+00:00",
    "date": "m11-d06"
  },
  {
    "Other": "still waiting for the DF steam release <:pepehands:838312017336336405>",
    "Zaltys": "Actually, that just got announced. Dec 6th.",
    "timestamp": "2022-11-04T18:39:41.095000+00:00",
    "date": "m11-d04"
  },
  {
    "Other": "Yes. And I tried clearing cache and I tried opening it on an incognito tab",
    "Zaltys": "Tried another browser?",
    "timestamp": "2022-11-03T16:03:31.340000+00:00",
    "date": "m11-d03"
  },
  {
    "Other": "adult ads bring more money <:goosip:1004468272974008490>",
    "Zaltys": "Do they, though? I've seen studies which claim that those just cause users to spend their money elsewhere..",
    "timestamp": "2022-11-02T13:31:02.896000+00:00",
    "date": "m11-d02"
  },
  {
    "Other": "is croissant an austrian or french invention",
    "Zaltys": "French. But croissants were supposedly based on this, which is Austrian.",
    "timestamp": "2022-11-02T12:20:47.718000+00:00",
    "date": "m11-d02"
  },
  {
    "Other": "my first guess would be Wien",
    "Zaltys": "German word for Vienna (Austria), which is where wieners originated.",
    "timestamp": "2022-11-02T12:12:58.997000+00:00",
    "date": "m11-d02"
  },
  {
    "Other": "Just for a silly role<:berk:837330926866268160>",
    "Zaltys": "I'm assuming — hoping — that the Patreon consists mostly of folks who wanted to donate extra to NAI. Instead of just those who wanted a colored name.",
    "timestamp": "2022-11-01T22:31:39.515000+00:00",
    "date": "m11-d01"
  },
  {
    "Other": "But it does creepy stuff so well too.",
    "Zaltys": "",
    "timestamp": "2022-10-30T21:39:27.880000+00:00",
    "date": "m10-d30"
  },
  {
    "Other": "auto quality is just masterpiece and best quality added in front?",
    "Zaltys": "Yes. And it's good to still have those somewhere in the prompt. I just don't like to start the prompt with those, puts too much focus on that instead of the subject.",
    "timestamp": "2022-10-30T13:37:45.803000+00:00",
    "date": "m10-d30"
  },
  {
    "Other": "Is it recommended to remove the standard UC filter in general? Never played around with it <:thonk:845080036478550036>",
    "Zaltys": "I can get better results by building my own UC list. But it's definitely for advanced users.",
    "timestamp": "2022-10-30T13:36:26.551000+00:00",
    "date": "m10-d30"
  },
  {
    "Other": "yeah the randomness is very low there",
    "Zaltys": "Also Top-K 20. ...yea, it's restrictive.",
    "timestamp": "2022-10-29T05:11:20.940000+00:00",
    "date": "m10-d29"
  },
  {
    "Other": "This might sound dumb but is there a module information page? Like describes what types of content some of the default modules contain? Some seem pretty obvious and others not so much,",
    "Zaltys": "Which ones are unclear?",
    "timestamp": "2022-10-29T05:08:00.411000+00:00",
    "date": "m10-d29"
  },
  {
    "Other": "Or look around at the modules people were into LOL",
    "Zaltys": "Yea, that's been useful at least. Though not everyone lists the contents.",
    "timestamp": "2022-10-28T21:15:16.720000+00:00",
    "date": "m10-d28"
  },
  {
    "Other": "I want to generate backgrounds, but some generic anime girl is placed in each one. How do i stop this?",
    "Zaltys": "`scenery`",
    "timestamp": "2022-10-28T21:02:43.324000+00:00",
    "date": "m10-d28"
  },
  {
    "Other": "as long as I can access it, I was just giving you some details if you need to fix it",
    "Zaltys": "You could switch to Brave. It's almost identical (except for additional privacy and ad blocker features) and you can import everything from Chrome.",
    "timestamp": "2022-10-28T19:33:25.628000+00:00",
    "date": "m10-d28"
  },
  {
    "Other": "yeah trying to get nai to make a face that isn't completely immaculate or ugly as a troll",
    "Zaltys": "I don't have much trouble with that. Unless you count something like this as 'ugly as a troll'. Selecting the right artist helps a lot.",
    "timestamp": "2022-10-28T05:07:40.023000+00:00",
    "date": "m10-d28"
  },
  {
    "Other": "Can we instruct the image gen to look for a negative prompt like in that one creepypasta",
    "Zaltys": "It can already do negatives via prompt mixing (the following is `human, photo:1|happy:-0.3`), but I'm not sure if that's what you meant.",
    "timestamp": "2022-10-27T05:40:21.965000+00:00",
    "date": "m10-d27"
  },
  {
    "Other": "Anyone else getting an internal error right now?",
    "Zaltys": "Restart your browser. If that doesn't fix it, you may need to clean the cache - but careful with that, it'll erase your stories if you have them saved locally.",
    "timestamp": "2022-10-27T04:36:28.033000+00:00",
    "date": "m10-d27"
  },
  {
    "Other": "uh, should I turn off bad anatomy if I want a nine tailed fox? I'm assuming it wouldn't matter, considering tails aren't really human anatomy, but still",
    "Zaltys": "Yep. It's a hindrance if you're trying to generate non-humans, as it'll try to vector towards a 'normal human'.",
    "timestamp": "2022-10-26T17:58:36.520000+00:00",
    "date": "m10-d26"
  },
  {
    "Other": "I used to live in central stockholm and basically the water in the tap there comes out with a heap of limy crappy water and then has this almost oily texture to it.",
    "Zaltys": "I used to have that in my old apartment. It was from decades old hot water heater that needed replacement.",
    "timestamp": "2022-10-26T12:27:19.375000+00:00",
    "date": "m10-d26"
  },
  {
    "Other": "Tied for 11th <:sadge:980995949209993248>",
    "Zaltys": "Anything above 90 is probably fine. ...hm. Canada is 88.",
    "timestamp": "2022-10-26T12:23:18.624000+00:00",
    "date": "m10-d26"
  },
  {
    "Other": "ive been just doing [ Tags:  ]   do i have to use the ATTG format with the semi colons ? if its any better at all ill do it",
    "Zaltys": "Nope, single category is fine if you have nothing to put in the others. I tend to only use Tags and Genre myself. Author and Title have limited uses.",
    "timestamp": "2022-10-26T03:26:19.305000+00:00",
    "date": "m10-d26"
  },
  {
    "Other": "\"Local teen girl simps for fictional men\"",
    "Zaltys": "",
    "timestamp": "2022-10-25T16:34:20.966000+00:00",
    "date": "m10-d25"
  },
  {
    "Other": "No plans for image gen modules at this time.",
    "Zaltys": "^",
    "timestamp": "2022-10-25T15:34:21.558000+00:00",
    "date": "m10-d25"
  },
  {
    "Other": "That I did not know",
    "Zaltys": "Trying to figure out where Kurumuz said that. ...oh, in furry-central. <:kek:692062611659030548>\nhttps://discord.com/channels/836774308772446268/975739920306036766/1011204038391517364",
    "timestamp": "2022-10-25T15:21:24.978000+00:00",
    "date": "m10-d25"
  },
  {
    "Other": "I had been using a \"Characters In Scene:\" bit in memory, but I may have to switch to this.",
    "Zaltys": "Can combine it. ```Characters:\nChar #1: summary.\nChar #2: summary, etc.```",
    "timestamp": "2022-10-25T13:48:59.429000+00:00",
    "date": "m10-d25"
  },
  {
    "Other": "Gen X were already in adulthood by the time it rolled around. Primarily anyway.",
    "Zaltys": "Not all of us. <:shrug:332268181517238272>",
    "timestamp": "2022-10-24T17:54:32.791000+00:00",
    "date": "m10-d24"
  },
  {
    "Other": "I feel like the younger generations are usually the ones to lead early adoption of new tech.",
    "Zaltys": "Someone born in 1980 (Gen X) was only 2 when ZX Spectrum was popular.",
    "timestamp": "2022-10-24T17:53:04.771000+00:00",
    "date": "m10-d24"
  },
  {
    "Other": "Considering the Millennial generation was the first to grow up with computers, I'd disagree.",
    "Zaltys": "Gen X.",
    "timestamp": "2022-10-24T17:52:19.036000+00:00",
    "date": "m10-d24"
  },
  {
    "Other": "I only have one tab open <:cry:837394871672111124>",
    "Zaltys": "Meh. Guess that's not it, then. ...the errors stopped for me when I closed the other tabs.",
    "timestamp": "2022-10-24T15:11:45.471000+00:00",
    "date": "m10-d24"
  },
  {
    "Other": "Anyone else having connectivity issues with Krake? <:SadHolo:837316963575136327>",
    "Zaltys": "Do you by any chance have multiple tabs open?",
    "timestamp": "2022-10-24T15:10:54.765000+00:00",
    "date": "m10-d24"
  },
  {
    "Other": "And somebody will still complain about it <:schizo:837170919448248331>",
    "Zaltys": "Probably mods, for having to moderate it. (At least Clyde's pretty good at pruning nsfw. Too good, maybe.)",
    "timestamp": "2022-10-24T13:47:34.399000+00:00",
    "date": "m10-d24"
  },
  {
    "Other": "But what if I use it before starting anew story",
    "Zaltys": "Yep, that's good. Same effect as putting it in Memory.",
    "timestamp": "2022-10-24T02:47:59.966000+00:00",
    "date": "m10-d24"
  },
  {
    "Other": "I heard putting tags is actually GOOD",
    "Zaltys": "It's bad in AN. ATTG starts a new story, so that'll cause memory issues for things further down in the context.",
    "timestamp": "2022-10-24T02:45:09.578000+00:00",
    "date": "m10-d24"
  },
  {
    "Other": "My stories are about self inserts and they're very personal",
    "Zaltys": "As long as you're not going to publish them...",
    "timestamp": "2022-10-24T02:19:51.153000+00:00",
    "date": "m10-d24"
  },
  {
    "Other": "I was going to have a character make a `:|` facial expression, only to realize that won't work. How do?",
    "Zaltys": "I don't think we have one. But you can use the `😐` emoji. ...or `😑` might work better.",
    "timestamp": "2022-10-23T20:26:27.458000+00:00",
    "date": "m10-d23"
  },
  {
    "Other": "I mean, I imagine if we're messing with it we're using our free time to do so. Can just try at the next time slot and check in for updates.",
    "Zaltys": "Yep. And then when the same repeats on the next day, it's bound to get annoying. 'Why did I pay for this if it never works when I have time for it?'",
    "timestamp": "2022-10-23T20:11:45.507000+00:00",
    "date": "m10-d23"
  },
  {
    "Other": "I just go by stuff happens, they're on it, if I can't mess with it I'll do other stuff until it's back like chat here or, god forbid, go outside. If it persists I'll want an update but stuff gets complicated and some things aint a quick fix",
    "Zaltys": "People have schedules. They can't necessarily just 'do other stuff' and try again later.",
    "timestamp": "2022-10-23T20:10:01.962000+00:00",
    "date": "m10-d23"
  },
  {
    "Other": "true, but only for moments",
    "Zaltys": "Which is unfortunate if those moments are the only time you can spare the time to use NAI. I can relate. Was busy working most of that time, then when I tried to take a break, Krake was unusably slow. <:shrug:332268181517238272>",
    "timestamp": "2022-10-23T19:58:58.406000+00:00",
    "date": "m10-d23"
  },
  {
    "Other": "can u generate ihop with nai diffusion?",
    "Zaltys": "Not quite the same...  I'm not sure which tags to use for food.",
    "timestamp": "2022-10-21T16:12:08.091000+00:00",
    "date": "m10-d21"
  },
  {
    "Other": "Sorry for the Discord question, how do you put the emoji in the dark background? Backticks just give me `:rabbit2::crown:`.",
    "Zaltys": "Add the backticks first, then the emoji between those. ...or what pume said, yea.",
    "timestamp": "2022-10-21T14:58:53.305000+00:00",
    "date": "m10-d21"
  },
  {
    "Other": "this effect is very strong. UC/quality tags/curated model are super nice for just generating good images and if you dont want to spend a lot of time and effort crafting the prompt and custom UC, but if you want something specific, the first thing you should do is go vanilla",
    "Zaltys": "Absolutely. I recommend playing around with UC of None and building your own list. Many of the tags in the default UC are not strictly necessary, and pruning those out allows for more varied styles.",
    "timestamp": "2022-10-21T14:28:38.095000+00:00",
    "date": "m10-d21"
  },
  {
    "Other": "I'm new to this ai image generation but I have a question does the ai able to pick up very specific descriptions (example: Hairstyles, Background)",
    "Zaltys": "Backgrounds, yes. `scenery` is the main tag for detailed backgrounds in Anime, just combo with background elements.\nHairstyles... hard to find working names for them, beyond just `long hair, curly hair` etc.",
    "timestamp": "2022-10-21T14:25:20.846000+00:00",
    "date": "m10-d21"
  },
  {
    "Other": "well it's pretty good at understanding natural language. no reason to be a slave to danbooru tags",
    "Zaltys": "'course, even that will often go with...",
    "timestamp": "2022-10-21T14:19:02.405000+00:00",
    "date": "m10-d21"
  },
  {
    "Other": "Prose works in the box?",
    "Zaltys": "It's still built on SD, which works okay with prose.",
    "timestamp": "2022-10-21T14:18:32.882000+00:00",
    "date": "m10-d21"
  },
  {
    "Other": "`man with black hair, woman with red hair`",
    "Zaltys": "That's more like it. Doesn't follow the tags at all, but nothing wrong in using prose.",
    "timestamp": "2022-10-21T14:17:55.307000+00:00",
    "date": "m10-d21"
  },
  {
    "Other": "i found that if you want to specify which character has what hair color you can put it in brackets",
    "Zaltys": "Sometimes works, but Danbooru's character count tagging is lacking. Will still frequently end up with one character.",
    "timestamp": "2022-10-21T14:15:22.034000+00:00",
    "date": "m10-d21"
  },
  {
    "Other": "For instance, booru tags like `red hair` don't specify who has red hair. Only that someone in the image does. But if you add `black hair` too, the chances are that one character ends up with red and one with black hair.",
    "Zaltys": "...or it might just generate this. (`red hair, black hair, 1girl, 1boy`)",
    "timestamp": "2022-10-21T14:13:55.569000+00:00",
    "date": "m10-d21"
  },
  {
    "Other": "you can kinda wrangle it by using tags to define how the two characters exist in the image",
    "Zaltys": "That's the best that can be done, but still very random.",
    "timestamp": "2022-10-21T14:11:30.276000+00:00",
    "date": "m10-d21"
  },
  {
    "Other": "if you describe one character in one, and another in the other",
    "Zaltys": "It'll try to merge them.",
    "timestamp": "2022-10-21T14:09:38.251000+00:00",
    "date": "m10-d21"
  },
  {
    "Other": "Is there a way to separate the parameters for 1girl and 1boy?",
    "Zaltys": "No, because booru tag systems don't work that way.",
    "timestamp": "2022-10-21T14:08:50.040000+00:00",
    "date": "m10-d21"
  },
  {
    "Other": "does anyone know what to put in the memory or authors notes to make my world not have buildings and items and stuff.. my caveman people keep reading books and they gonna evole too quick i",
    "Zaltys": "`[ Tags: stone age ]` in Memory should be more than enough... Unless you combine it with sci-fi elements, in which case all bets are off as it'll assume 'time travel'.",
    "timestamp": "2022-10-21T05:21:56.548000+00:00",
    "date": "m10-d21"
  },
  {
    "Other": "What was the last really scary game with pixel art?",
    "Zaltys": "https://www.youtube.com/watch?v=wzTLPpAQpF8\nToo bad it never got finished.",
    "timestamp": "2022-10-21T00:24:18.401000+00:00",
    "date": "m10-d21"
  },
  {
    "Other": "just try disabling it",
    "Zaltys": "I keep it disabled too. That setting places them first in the prompt, which makes them too strong for my tastes.",
    "timestamp": "2022-10-20T14:31:58.291000+00:00",
    "date": "m10-d20"
  },
  {
    "Other": "Yeah, like anything describing characters a certain way",
    "Zaltys": "Attributes.",
    "timestamp": "2022-10-20T14:00:36.580000+00:00",
    "date": "m10-d20"
  },
  {
    "Other": "Do you do any character tagging metadata in the finetune, or is it all ATTG data that you put in?",
    "Zaltys": "By character tagging metadata, you mean...?",
    "timestamp": "2022-10-20T14:00:03.848000+00:00",
    "date": "m10-d20"
  },
  {
    "Other": "still just servants, mostly for the evil guys",
    "Zaltys": "Still servants, but.. https://www.goodreads.com/en/book/show/55577671",
    "timestamp": "2022-10-19T18:12:00.012000+00:00",
    "date": "m10-d19"
  },
  {
    "Other": "Spoiler:||The dragon will become your best friend||",
    "Zaltys": "Almost guaranteed. ...it's interesting how dragons have shifted from monsters to allies in modern fantasy.",
    "timestamp": "2022-10-19T18:10:43.273000+00:00",
    "date": "m10-d19"
  },
  {
    "Other": "Yeah, the discord will have to change, it will end up in probably getting more channels or even make split offs, but that's a long ways away because there's maybe only 100 regulars here anyway\nIf it even has to happen it'll be months/years down the line.",
    "Zaltys": "...I still miss the games off-topic channel. Maybe we'll get that back one day.",
    "timestamp": "2022-10-19T17:40:02.177000+00:00",
    "date": "m10-d19"
  },
  {
    "Other": "The Stand is highly rated, but I doubt many folks read it",
    "Zaltys": "720k user ratings on Goodread which puts it as third most-read King, but yea, hard to say how many actually finished it.",
    "timestamp": "2022-10-19T07:18:49.083000+00:00",
    "date": "m10-d19"
  },
  {
    "Other": "It's easily one of Stephen King's most underrated works",
    "Zaltys": "Fifth most rated King on Goodreads, with average of 4.20. Underrated. <:thonk:733040009136832642>\nOnly ones that beat it in ratings are The Stand, It, Carrie, and The Shining.",
    "timestamp": "2022-10-19T07:15:03.540000+00:00",
    "date": "m10-d19"
  },
  {
    "Other": "I swear the AI hates the colour Gray/Grey. I keep getting pink",
    "Zaltys": "...can't replicate. It does 'grey' anything well, as far as I can see. (Dunno what's up with those sunglasses, though.)",
    "timestamp": "2022-10-18T22:51:02.825000+00:00",
    "date": "m10-d18"
  },
  {
    "Other": "how do i make a poem in novelai",
    "Zaltys": "`[ Style: poem ]` is also usually enough to generate one, at least in Krake. If you don't want to look up how to add an em space.",
    "timestamp": "2022-10-18T14:57:26.450000+00:00",
    "date": "m10-d18"
  },
  {
    "Other": "I'm talking fantasy weapons like cool swords and stuff",
    "Zaltys": "About this level. Getting someone to _hold_ a weapon correctly is pure luck, though.",
    "timestamp": "2022-10-17T14:00:10.842000+00:00",
    "date": "m10-d17"
  },
  {
    "Other": "It's good, better than a lot of digital artists online, and I draw too lol",
    "Zaltys": "Sure, the quality is great overall. But getting it to output _exactly_ what you want?",
    "timestamp": "2022-10-17T01:50:39.063000+00:00",
    "date": "m10-d17"
  },
  {
    "Other": "Meh, me and aini was letting it go off topic last night too to avoid people just mad about down time",
    "Zaltys": "Yea, well, don't expect me to be reading this. Too busy working to keep up with this level of spam.",
    "timestamp": "2022-10-17T00:11:58.745000+00:00",
    "date": "m10-d17"
  },
  {
    "Other": "You don’t have the entire discord muted, are you high ?",
    "Zaltys": "Keep the off-topic to <#847676684454592513>. Allowing it here will only make this harder to moderate in the future.",
    "timestamp": "2022-10-17T00:09:28.870000+00:00",
    "date": "m10-d17"
  },
  {
    "Other": "Not really, would you rather have them talking about off topic stuff or bitching about the down time ?",
    "Zaltys": "Considering that I'm already thinking of muting this channel... on-topic.",
    "timestamp": "2022-10-17T00:08:28.881000+00:00",
    "date": "m10-d17"
  },
  {
    "Other": "But it’s not on fire",
    "Zaltys": "It is definitely on fire.",
    "timestamp": "2022-10-17T00:07:36.704000+00:00",
    "date": "m10-d17"
  },
  {
    "Other": "Then furry is just a different variant of anime smh",
    "Zaltys": "More western styles.",
    "timestamp": "2022-10-16T12:01:55.848000+00:00",
    "date": "m10-d16"
  },
  {
    "Other": "Can we all agree that Calypso sucks?",
    "Zaltys": "I could see it working for children's literature. But with Top K of 10 it won't ever output anything complex. <:shrug:332268181517238272>",
    "timestamp": "2022-10-16T11:55:13.466000+00:00",
    "date": "m10-d16"
  },
  {
    "Other": "has anyone ever generated an among us image",
    "Zaltys": "Completely failed when I tried it. Not enough of those on danbooru.",
    "timestamp": "2022-10-16T11:48:44.282000+00:00",
    "date": "m10-d16"
  },
  {
    "Other": "Okay, so, any luck making a realistic tortoise man? Anime Full makes just... Turtles, bald humans, or mutant amalgamations of shell and flesh.\nAs far as Furry, not familiar with it, but past attempts for \"REALISTIC\" came out like....",
    "Zaltys": "You'll want `photo`, `real`, and `photorealism`. None of those are big tags, but help when combined. Can also use `photo background`, but that interferes with `amazing background` etc.",
    "timestamp": "2022-10-16T04:54:18.090000+00:00",
    "date": "m10-d16"
  },
  {
    "Other": "One of his alts is probably still here, make that one mod",
    "Zaltys": "Probably not, since he just complained about not having access to this Discord elsewhere.",
    "timestamp": "2022-10-15T19:23:38.010000+00:00",
    "date": "m10-d15"
  },
  {
    "Other": "I can add that it does Sylveon and Weavile decently",
    "Zaltys": "As for quadrupeds, it's very good at Arcanine etc. Not really surprising when that's just a dog with different colors.",
    "timestamp": "2022-10-15T17:07:18.303000+00:00",
    "date": "m10-d15"
  },
  {
    "Other": "pro writer moment\nit's MorPEKO it was mentioned only a single sentence ago oh my god",
    "Zaltys": "Yep. Pro Writer has massive rep penalty, so it causes silliness like that.",
    "timestamp": "2022-10-15T07:23:17.035000+00:00",
    "date": "m10-d15"
  },
  {
    "Other": "How? They can just magically make it faster?",
    "Zaltys": "See the announcements. `Since most of our hardware is currently quarantined for investigational purposes, we cannot perform the more compute-intensive aspects of text generation at our usual speed and scale.`\nThat hasn't changed. These investigations take time.",
    "timestamp": "2022-10-15T04:12:57.064000+00:00",
    "date": "m10-d15"
  },
  {
    "Other": "the thing is you are piling up your own work",
    "Zaltys": "Not really. Can't keep up with new releases unless I actually work on them, you know.",
    "timestamp": "2022-10-14T04:22:30.056000+00:00",
    "date": "m10-d14"
  },
  {
    "Other": "Is the performance getting better again right now for you?",
    "Zaltys": "Just started to lag again.",
    "timestamp": "2022-10-13T18:39:46.323000+00:00",
    "date": "m10-d13"
  },
  {
    "Other": "imagine a bog standard cop seeing the prompts and tags loaded in for the full anime / furry modules <:risitas:837136229010243654>",
    "Zaltys": "Fortunately, those aren't stored anywhere. So there's nothing to see.",
    "timestamp": "2022-10-13T12:07:29.792000+00:00",
    "date": "m10-d13"
  },
  {
    "Other": "Oh okay!  So that only works when doing a | ?",
    "Zaltys": "Right.",
    "timestamp": "2022-10-12T03:02:14.689000+00:00",
    "date": "m10-d12"
  },
  {
    "Other": "How much does putting a tag in braces enhance the effect?  What the difference between using braces and say... \"blonde hair:2\"?",
    "Zaltys": "`blonde hair:2` does nothing on its own. That's for prompt mixing.",
    "timestamp": "2022-10-12T03:01:03.204000+00:00",
    "date": "m10-d12"
  },
  {
    "Other": "text generations are taking over a minute for me, anyone else?",
    "Zaltys": "Not quite a minute, but can confirm that it's not just you.",
    "timestamp": "2022-10-11T06:06:03.702000+00:00",
    "date": "m10-d11"
  },
  {
    "Other": "\"photorealistic\" (but at least they got the hair and eye color right)",
    "Zaltys": "That's still very Japanese in shading, etc.",
    "timestamp": "2022-10-11T01:40:48.155000+00:00",
    "date": "m10-d11"
  },
  {
    "Other": "Anyway, to get on topic before the mods hit us, ME WOULD LIKE CUSTOM KRAKE MODULES. <:berk:837330926866268160>",
    "Zaltys": "Aw. I like book talk. Gives me ideas for content that might've otherwise been missed. ||Enchiridion added.||",
    "timestamp": "2022-10-10T16:30:57.256000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "``The novel intertwines the discovery of the chemical structure of DNA with the musicality of Johann Sebastian Bach's harpsichord composition the Goldberg Variations. `` this I didn't expect 😄",
    "Zaltys": "Now I wonder what'd happen if that got mixed with `Gödel, Escher, Bach: An Eternal Golden Braid` into one module..",
    "timestamp": "2022-10-10T16:21:51.505000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "I see; thanks.\nI can still bias against \"white background\" I suppose since all the other backgrounds are evenly biased against but white more so",
    "Zaltys": "For both Anime and Furry, `simple background` tag covers all single-color backgrounds.",
    "timestamp": "2022-10-10T16:17:45.928000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "rip general chat?",
    "Zaltys": "Reborn as general off topic.",
    "timestamp": "2022-10-10T16:16:06.240000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "may I ask how I can separate phrases in the undesired content field? or does it bias against all these words all at once?",
    "Zaltys": "Yes, it has negative weight for everything listed.",
    "timestamp": "2022-10-10T16:15:28.896000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "Saaame. I just want Krake modules. So. Bad.",
    "Zaltys": "Don't we all...",
    "timestamp": "2022-10-10T16:13:52.982000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "i'd expect it to be multiplicative if it says multiplied :P",
    "Zaltys": "Yep.",
    "timestamp": "2022-10-10T13:32:39.483000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "so to confirm, there's currently **no** other way than {} to strengthen the specific parts of a single prompt?",
    "Zaltys": "You can use the same tag more than once.",
    "timestamp": "2022-10-10T13:25:43.838000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "if anything i would expect them to be the same since the weighting isn't given to the model as is (in prompt), it's parsed first",
    "Zaltys": ":1.05 does nothing, since it's always balanced to :1 and you have no other prompt.",
    "timestamp": "2022-10-10T13:24:35.788000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "Clipboard works fine but it's not named correctly",
    "Zaltys": "Yea, that's normal. No metadata on clipboard.",
    "timestamp": "2022-10-10T12:23:05.007000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "<@129290683470053376> One more thing to add, while image generation seems to work, I cannot seem to download them",
    "Zaltys": "Which method(s)? Download ZIP, or via the diskette? Clipboard should always work, at least.",
    "timestamp": "2022-10-10T12:22:22.632000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "Oh so they *can* ban but at least content of your generations doesn't matter",
    "Zaltys": "Considering that we can't even see it... no, doesn't matter.",
    "timestamp": "2022-10-10T12:14:41.851000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "Sign in is also broken iirc",
    "Zaltys": "First I've heard of that. I just logged in without any problems.",
    "timestamp": "2022-10-10T12:13:09.239000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "I mean, when I try background prompts, even those with only 100 examples, still do insanely well",
    "Zaltys": "Backgrounds are already strong in the base.",
    "timestamp": "2022-10-10T07:03:32.645000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "Wait... Is there an eagle Pokémon? <:Thinkquil:912816501839523871>",
    "Zaltys": "Braviary.",
    "timestamp": "2022-10-10T06:52:07.562000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "Y is general chat above nai now?",
    "Zaltys": "Exactly what I was wondering. <:thonk:733040009136832642>",
    "timestamp": "2022-10-10T06:51:59.249000+00:00",
    "date": "m10-d10"
  },
  {
    "Other": "Would it be a problem if the main character's lore entry is at exactly 200 tokens? I've basically reduced it as much as it can be reduced now.",
    "Zaltys": "There's no need to limit it like that. I've used much larger entries. Though it depends on how many characters you want loaded at once.",
    "timestamp": "2022-10-09T13:01:28.539000+00:00",
    "date": "m10-d09"
  },
  {
    "Other": "I still can't get dog on shirt",
    "Zaltys": "",
    "timestamp": "2022-10-09T10:48:04.297000+00:00",
    "date": "m10-d09"
  },
  {
    "Other": "👧💀🐱💻 is the prompt",
    "Zaltys": "Yep, those are fun. Sometimes I use random emoji generator and just throw in a bunch to see what it comes up with.",
    "timestamp": "2022-10-08T08:42:00.473000+00:00",
    "date": "m10-d08"
  },
  {
    "Other": "I add `masterpiece` and `high quality` manually rather than using the toggle so I can adjust the strength.",
    "Zaltys": "Yea, same. It's nice to have for new users, but I prefer being able to adjust the exact position and strength.",
    "timestamp": "2022-10-08T01:50:35.960000+00:00",
    "date": "m10-d08"
  },
  {
    "Other": "anybody having trouble using the select feature on the editor",
    "Zaltys": "Not sure exactly you mean, but it has been reported that some custom themes interfere with image gen.",
    "timestamp": "2022-10-06T14:05:22.573000+00:00",
    "date": "m10-d06"
  },
  {
    "Other": "the ratio of \"girl\" to \"boy\" is pretty funny",
    "Zaltys": "The default is a bit unbalanced, but at least it can draw men just as well when prompted.",
    "timestamp": "2022-10-06T09:05:37.761000+00:00",
    "date": "m10-d06"
  },
  {
    "Other": "Okay, now it works. I don't know why, but before, whenever I tried to prompt for someone who's black or african, I got someone who was very white or at the most tan",
    "Zaltys": "Anime tends to be predominantly white. I've found that combining the nationality with `native`, as in `native Mexican` etc helps a lot.",
    "timestamp": "2022-10-05T22:44:27.170000+00:00",
    "date": "m10-d05"
  },
  {
    "Other": "than Idk what is tbh",
    "Zaltys": "In UK there was a profession called knocker-upper. They went around waking people up each morning, so they could get to work on time.\nThey got replaced by the invention of reliable alarm clocks. Was it unethical to invent an alarm clock?",
    "timestamp": "2022-10-05T10:16:25.801000+00:00",
    "date": "m10-d05"
  },
  {
    "Other": "Whoa was this using the new imagegen?",
    "Zaltys": "That was with Furry.",
    "timestamp": "2022-10-05T08:08:29.459000+00:00",
    "date": "m10-d05"
  },
  {
    "Other": "Oh, can you confirm that tags are interpreted first strongest, last weakest?",
    "Zaltys": "First ones should be strong, after that the order should be irrelevant.",
    "timestamp": "2022-10-05T07:54:30.873000+00:00",
    "date": "m10-d05"
  },
  {
    "Other": "Is it non-linear like regular SD?",
    "Zaltys": "As far as I know.",
    "timestamp": "2022-10-05T07:41:50.197000+00:00",
    "date": "m10-d05"
  },
  {
    "Other": "There is\n<https://safebooru.donmai.us/wiki_pages/traditional_media.html>",
    "Zaltys": "Ah, it's `* (medium)` on Anime. Good to know. Tag completion has some issues with brackets. Can just type `(medium)` and get the whole list.",
    "timestamp": "2022-10-05T06:50:32.067000+00:00",
    "date": "m10-d05"
  },
  {
    "Other": "Is there a list for (artwork) tags?",
    "Zaltys": "No, and trying to pull them from tag completion seems difficult. I haven't even used those much myself, I usually only UC `sketch`. Furry _seems_ to have better variety (`traditional media`, `digital media (artwork)`, `digital painting (artwork)`, etc.) but not sure.",
    "timestamp": "2022-10-05T06:48:19.753000+00:00",
    "date": "m10-d05"
  },
  {
    "Other": "So it was a rumor for now. Thank you.",
    "Zaltys": "There's `digital media (artwork)`. Someone probably got them mixed up.",
    "timestamp": "2022-10-05T06:44:18.763000+00:00",
    "date": "m10-d05"
  },
  {
    "Other": "That's all? Thanks. Some mentioned tags like `pencil (medium)` exists, but I don't know whether it's real or not.",
    "Zaltys": "There's quite a few style tags, but those weren't added. I don't think Anime has that one? Furry has `pencil (artwork)`.",
    "timestamp": "2022-10-05T06:43:26.849000+00:00",
    "date": "m10-d05"
  },
  {
    "Other": "What are interesting style prompt/tags?",
    "Zaltys": "Besides what was already listed, I like `official art` and `absurdres`.",
    "timestamp": "2022-10-05T02:49:35.802000+00:00",
    "date": "m10-d05"
  },
  {
    "Other": "Gotcha. Hoping it's an issue of Anime just being better quality so they went with that, still kinda hoping for general-purpose soon even though I'm blown away by some of the anime results.",
    "Zaltys": "From the announcement: `Therefore we have come to the decision to only offer our own unique models and forego the basic Standard Diffusion model`\nNAI unique models are Anime and Furry.",
    "timestamp": "2022-10-05T01:27:11.581000+00:00",
    "date": "m10-d05"
  },
  {
    "Other": "strongly opposed to that. Twitter is one thing. But in here we should promote people learning from each other how to use this tech",
    "Zaltys": "Rough. I'm not going to post prompts for mine. Cope.",
    "timestamp": "2022-10-04T11:34:43.897000+00:00",
    "date": "m10-d04"
  },
  {
    "Other": "we're talking about our perception of the real colors from that image",
    "Zaltys": "If the perception (gold/white) matches the color values, isn't that more correct in this case?\n...but yea, very off-topic.",
    "timestamp": "2022-10-04T09:59:18.004000+00:00",
    "date": "m10-d04"
  },
  {
    "Other": "Clockwise",
    "Zaltys": "||Both are equal. Your brain just interprets it one way. It can also switch if you look at it from different angle. Easiest to do by looking at the left foot.||",
    "timestamp": "2022-10-04T09:49:18.361000+00:00",
    "date": "m10-d04"
  },
  {
    "Other": "\"spinning balerina\" would probably work better",
    "Zaltys": "Oh great. Just had to remind me of this. (...which way does this spin?)\nhttps://upload.wikimedia.org/wikipedia/commons/2/21/Spinning_Dancer.gif",
    "timestamp": "2022-10-04T09:47:49.739000+00:00",
    "date": "m10-d04"
  },
  {
    "Other": "Adding to the spam, it turns out *NAI Diffusion Furry (Beta)* can approximate certain traditional styles, sort of.\nThis is \"`beautiful human woman with black hair depicted in the American impressionist style by Frank W Benson`\" with \"`furry, digital, anthro, smooth, digital`\" in *Undesired Content*. It is nowhere as good as <#1025226799040442448>, but it is better than nothing.",
    "Zaltys": "It's better at humanoids (orcs, elves, zombies, demons, etc) than humans, btw.",
    "timestamp": "2022-10-03T23:26:14.703000+00:00",
    "date": "m10-d03"
  },
  {
    "Other": "Hey guys, try \"corrected\" in your prompts",
    "Zaltys": "Hard to say without major testing. I did just try it on a seed that had mangled anatomy, and it improved. But on the other hand, anything would've likely improved it...",
    "timestamp": "2022-10-03T23:21:35.212000+00:00",
    "date": "m10-d03"
  },
  {
    "Other": "What do the curly brackets do?",
    "Zaltys": "Was in the announcements, but summarized: {} makes it stronger, [] makes it a bit weaker (but not negative, just weaker)",
    "timestamp": "2022-10-03T05:36:33.752000+00:00",
    "date": "m10-d03"
  },
  {
    "Other": "still not working",
    "Zaltys": "Oh, and it was in Anime Full.",
    "timestamp": "2022-10-03T05:26:13.314000+00:00",
    "date": "m10-d03"
  },
  {
    "Other": "still not working",
    "Zaltys": "Updated the prompt, check again.",
    "timestamp": "2022-10-03T05:26:01.639000+00:00",
    "date": "m10-d03"
  },
  {
    "Other": "how",
    "Zaltys": "`solo, broken robot, in pieces, lying down, metal body, haywire, raytracing, cool pose, jrpg, concept art, looking to side, by James Jean, Kazuhiko Fukuchi, absurd res, {masterpiece}, best quality`\nUC: `text, signature, jpeg artifacts, cropped, bad anatomy, worst quality, bad quality, twitter username, dated`\nNeeds some tuning, though.",
    "timestamp": "2022-10-03T05:22:58.547000+00:00",
    "date": "m10-d03"
  },
  {
    "Other": "I want to get it to draw a broken robot",
    "Zaltys": "",
    "timestamp": "2022-10-03T05:16:11.050000+00:00",
    "date": "m10-d03"
  },
  {
    "Other": "Can anyone do pineapple for me?",
    "Zaltys": "",
    "timestamp": "2022-10-03T05:13:22.899000+00:00",
    "date": "m10-d03"
  },
  {
    "Other": "Do some research before blaming it on them",
    "Zaltys": "Us testers got a better view of the whole situation, and I wouldn't trust anything they told the users about that incident. That's all I'm saying about that.",
    "timestamp": "2022-10-01T18:31:34.423000+00:00",
    "date": "m10-d01"
  },
  {
    "Other": "I have no idea what are good horror artists other than junji ito",
    "Zaltys": "Try `by Nekro`. Not a real artist, but works great.",
    "timestamp": "2022-10-01T18:07:54.559000+00:00",
    "date": "m10-d01"
  },
  {
    "Other": "Even if you don't get naked people, `mature` is going to get your results flagged even if the result is somehow SFW",
    "Zaltys": "Eh? `mature` tag is generally used for older folks on boorus. Not for nsfw.",
    "timestamp": "2022-09-30T23:32:11.031000+00:00",
    "date": "m09-d30"
  },
  {
    "Other": "It looks like Zaltys was demonstrating the AI's ability to extrapolate prose from a short description in traits format. The screenshot seems to show an AI generation in the main text area.",
    "Zaltys": "Yep. Don't put `***` inside data entries. There's no scene breaks in those. In the screencap the lb entry is everything before the `***`.",
    "timestamp": "2022-09-30T19:36:12.133000+00:00",
    "date": "m09-d30"
  },
  {
    "Other": "Wait, should I have been doing this for my lore entries all this time?",
    "Zaltys": "Meh. Not like it's required, but it helps.",
    "timestamp": "2022-09-30T18:43:05.773000+00:00",
    "date": "m09-d30"
  },
  {
    "Other": "Does the module matter? Or should I just pick whatever suits the theme?",
    "Zaltys": "As long as it's not Cross-Genre or one of other Sage's modules, it'll work. (Those lack formatting. Though I think he's using ATTG at least.)",
    "timestamp": "2022-09-30T18:42:15.869000+00:00",
    "date": "m09-d30"
  },
  {
    "Other": "Are the ```---``` & ```***``` important?",
    "Zaltys": "Yep. `----` (note: four) for data, `***` for prose.",
    "timestamp": "2022-09-30T18:41:53.077000+00:00",
    "date": "m09-d30"
  },
  {
    "Other": "anyone know the artists that could be associated with these? the tags didnt save fully in the image name x3",
    "Zaltys": "`anime art, young boy, little boy, black hair boy, wearing black Japanese Naval Uniform, official media, delicate facial features, tone mapping, Perfectionism, Accent Lighting, by Greg Rutkowski, Hayao Miyazaki, John Singer Sargent, intricate, finely detailed`",
    "timestamp": "2022-09-30T09:45:46.038000+00:00",
    "date": "m09-d30"
  },
  {
    "Other": "those are from the anime model right",
    "Zaltys": "Yes.",
    "timestamp": "2022-09-25T21:22:41.441000+00:00",
    "date": "m09-d25"
  },
  {
    "Other": "`[ Author: W. E. B. Griffin, Tom Clancy, Yuval Noah Harari, Som Bathla; Tags: realistic swordplay, office politics, military management; Genre: kingdom building, empire, legions, military action ]`\nThere, fixed it to better conform to the finetune.",
    "Zaltys": "Pretty much, but most of those genres would fit better in Tags.",
    "timestamp": "2022-09-25T16:27:20.241000+00:00",
    "date": "m09-d25"
  },
  {
    "Other": "That's a lot of buttons",
    "Zaltys": "About 11600 words worth of edits per day.",
    "timestamp": "2022-09-24T19:51:47.028000+00:00",
    "date": "m09-d24"
  },
  {
    "Other": "How much stuff do you add to the data set in like 2 weeks?",
    "Zaltys": "Hard to say. Not like I keep exact track of it. But here's my work-stats for past week. (Only running the logger while working.)",
    "timestamp": "2022-09-24T19:48:01.404000+00:00",
    "date": "m09-d24"
  },
  {
    "Other": "how do you tell all the Bobs apart",
    "Zaltys": "You don't.\nhttps://www.goodreads.com/book/show/32109569-we-are-legion-we-are-bob",
    "timestamp": "2022-09-24T03:18:49.185000+00:00",
    "date": "m09-d24"
  },
  {
    "Other": "but I feel china has more of their people with internet than india",
    "Zaltys": "Maybe not for long. Looks like the percent of internet users in India went up from 41% to 47% in just one year.",
    "timestamp": "2022-09-23T19:32:03.224000+00:00",
    "date": "m09-d23"
  },
  {
    "Other": "I seen cereal boxes with more variety than the personalities and plots of the average isekai these days",
    "Zaltys": "That's not really new. Majority of old mecha anime was pretty bad, etc. As they say, 90% of everything is crap.",
    "timestamp": "2022-09-23T19:29:58.575000+00:00",
    "date": "m09-d23"
  },
  {
    "Other": "one issue I've found is the ai doesn't know non modern clothing",
    "Zaltys": "Yea, not sure I'd agree about that. It can generate period-appropriate clothing for anything I've thrown at it so far.",
    "timestamp": "2022-09-23T19:08:10.487000+00:00",
    "date": "m09-d23"
  },
  {
    "Other": "nofap 7 months going strong",
    "Zaltys": "You'll regret that when you get to my age. <:kek:692062611659030548>",
    "timestamp": "2022-09-23T05:10:52.553000+00:00",
    "date": "m09-d23"
  },
  {
    "Other": "Is porn desensitization just like getting used to drug doses? Hmmmm",
    "Zaltys": "I got bored of anime titties when I was like 20 or so.",
    "timestamp": "2022-09-23T05:09:16.324000+00:00",
    "date": "m09-d23"
  },
  {
    "Other": "Text and Image definitely can't be put in the same bucket here yeah",
    "Zaltys": "Yep. This is worth repeating.\nImages only. There'll be no filtering of text dataset, at least as long as I'm in charge of it.",
    "timestamp": "2022-09-22T00:21:58.699000+00:00",
    "date": "m09-d22"
  },
  {
    "Other": "how to stop the ai from creating a new story using the *** thing?",
    "Zaltys": "Put in a chapter title after the `***` to steer it. Something like `[ Five Minutes Later ]`.\nBanning it is not recommended, as any longer story requires scene breaks and banning them will degrade the output quality.",
    "timestamp": "2022-09-21T04:59:34.133000+00:00",
    "date": "m09-d21"
  },
  {
    "Other": "how many tokens per lorebook entry? did you split entries per character class (paladin) and link to another card?",
    "Zaltys": "No, like I said, all that in Memory. I don't use small lorebook entries, they mess up the logic too easily.",
    "timestamp": "2022-09-20T14:56:06.478000+00:00",
    "date": "m09-d20"
  },
  {
    "Other": "but you use as one line per memory?",
    "Zaltys": "Some Attributes, some prose, etc.",
    "timestamp": "2022-09-20T14:55:41.150000+00:00",
    "date": "m09-d20"
  },
  {
    "Other": "so far i never use BIAS, have no clue in how to use it, even after all these months as subscriber lol",
    "Zaltys": "No big loss. The only thing I've ever _really_ needed it for is when playing as non-humans.",
    "timestamp": "2022-09-20T14:52:09.260000+00:00",
    "date": "m09-d20"
  },
  {
    "Other": "NAI does its best, but yes sometimes it can't _logic_ through what is intended.",
    "Zaltys": "Especially when biases and bans (including the default `***` bias) are overused. When it can't output what it thinks is best, it devolves into nonsense.",
    "timestamp": "2022-09-20T14:50:43.155000+00:00",
    "date": "m09-d20"
  },
  {
    "Other": "Bizarro?",
    "Zaltys": "Genre, not the DC character. Tends to use body- and surreal horror a lot, but not limited to those. Think David Lynch, if you're familiar with him.",
    "timestamp": "2022-09-18T22:16:22.547000+00:00",
    "date": "m09-d18"
  },
  {
    "Other": "so just putting it in parentheses will make it expand them into words and dialogue?",
    "Zaltys": "Yep. Very simple things, like `(X falls off the stage, hurting himself.)`",
    "timestamp": "2022-09-18T21:21:32.636000+00:00",
    "date": "m09-d18"
  },
  {
    "Other": "Does it ever leak?",
    "Zaltys": "Have to admit that it does. The `----` that is, not the contents.\nIf the default bias is on, whenever the AI tries to output `***` and fails, it might go for `----` instead as it's the second most common separator. So if you use `----` entries, might be worth banning it. No side-effects from doing that.",
    "timestamp": "2022-09-18T04:46:15.612000+00:00",
    "date": "m09-d18"
  },
  {
    "Other": "```----\nName: Lydia Reynolds\nGender: Woman\nRace: Naiad\nClass: CloserCadet/\nSize: 6'4'' (tall)\nAppearance: Teal Hair, Magenta eye color, Athletic Build, Fish Fins for ears, Rippling muscles\nAttributes: Brain Injury, Neural Interface\nRelationships: Married to wife Casey``` Is this right?",
    "Zaltys": "```Height: 6 ft 4 in (tall)```  Other than that, should be ok. (Didn't use `'`s in sizes, as those are used as quotation marks too etc.)",
    "timestamp": "2022-09-18T04:37:10.273000+00:00",
    "date": "m09-d18"
  },
  {
    "Other": "Does this work better with Krake or Euterpe?",
    "Zaltys": "Krake is newest, so these are strongest in it. Euterpe's missing couple of months of work.",
    "timestamp": "2022-09-18T04:35:23.568000+00:00",
    "date": "m09-d18"
  },
  {
    "Other": "I've considered doing this but I don't have an appropriate character to transform it into",
    "Zaltys": "I'm waiting for customizable bot myself. Whenever that'll be. <:RWsnekcry:805426733398360064>",
    "timestamp": "2022-09-15T19:58:13.786000+00:00",
    "date": "m09-d15"
  },
  {
    "Other": "Its over, BIRB COMPLETE",
    "Zaltys": "I'd guess... Charlie Bowater?",
    "timestamp": "2022-09-15T14:42:43.248000+00:00",
    "date": "m09-d15"
  },
  {
    "Other": "`RENNTFEAS` pls don't remind me ai",
    "Zaltys": "",
    "timestamp": "2022-09-15T14:30:41.054000+00:00",
    "date": "m09-d15"
  },
  {
    "Other": "<@409511804293611530> i see you have no counter argument, i shall now claim whatever prize you have laying around",
    "Zaltys": "I didn't think it needed one. Complete fail at depth of field. People in front are just as blurry as in the back.",
    "timestamp": "2022-09-14T21:27:13.042000+00:00",
    "date": "m09-d14"
  },
  {
    "Other": "<@409511804293611530> i’m talking about as if you actually took a picture of someone with no filter lmao",
    "Zaltys": "The thing is, that looks fake to me. Everything's in focus. Actual photo would be like this:",
    "timestamp": "2022-09-14T21:19:30.975000+00:00",
    "date": "m09-d14"
  },
  {
    "Other": "I'm mainly concerned with backgrounds",
    "Zaltys": "Put in something like `in park`. That's usually enough.",
    "timestamp": "2022-09-14T21:10:24.211000+00:00",
    "date": "m09-d14"
  },
  {
    "Other": "Bro how’d you actually get that to generate lol, i’ve done 5-6 attempts",
    "Zaltys": "`-large bowl with dirt sand small rock 'soup' in it, by noob chef`",
    "timestamp": "2022-09-13T17:54:51.671000+00:00",
    "date": "m09-d13"
  },
  {
    "Other": "my favorite artist...Dadtggathet [Eldritch Horror] a blox.",
    "Zaltys": "",
    "timestamp": "2022-09-13T00:22:17.025000+00:00",
    "date": "m09-d13"
  },
  {
    "Other": "How about thanos burger? <:thonkg:849933565344088065>",
    "Zaltys": "How about a Lovecraftian bur... er... Okay, no.",
    "timestamp": "2022-09-13T00:05:05.718000+00:00",
    "date": "m09-d13"
  },
  {
    "Other": "",
    "Zaltys": "",
    "timestamp": "2022-09-12T23:51:03.666000+00:00",
    "date": "m09-d12"
  },
  {
    "Other": "maybe ask zaltys the next time he's online",
    "Zaltys": "Doesn't ring a bell. But it is a workable idea, as long as the content is kept balanced. I'm curious about which books that included..",
    "timestamp": "2022-09-12T01:03:35.606000+00:00",
    "date": "m09-d12"
  },
  {
    "Other": "Is this 1.5?",
    "Zaltys": "No comment.",
    "timestamp": "2022-09-11T22:15:38.162000+00:00",
    "date": "m09-d11"
  },
  {
    "Other": "coherent reflections, dang",
    "Zaltys": "",
    "timestamp": "2022-09-11T22:10:59.258000+00:00",
    "date": "m09-d11"
  },
  {
    "Other": "why synopsis?",
    "Zaltys": "Because that's common on web pedias, such as numerous Fandom wikis.",
    "timestamp": "2022-09-09T10:12:46.261000+00:00",
    "date": "m09-d09"
  },
  {
    "Other": "This is a good direction to look in my opinion! https://www.goodreads.com/shelf/show/space-colonization",
    "Zaltys": "Not the best Goodreads list I've seen. Very low on actual colonization, and doesn't even include thematic ones like https://www.goodreads.com/book/show/51793329-mars-nation-1",
    "timestamp": "2022-09-08T20:15:21.649000+00:00",
    "date": "m09-d08"
  },
  {
    "Other": "Why the dashes?",
    "Zaltys": "Stronger connection between words.",
    "timestamp": "2022-09-06T15:57:17.332000+00:00",
    "date": "m09-d06"
  },
  {
    "Other": "almost?  Q1 and Q3 are fire!",
    "Zaltys": "Yea, but fourth was messed up... Here's the prompt: `dog-shaped-animated-bread, soft lighting, by master chef, by kennel`",
    "timestamp": "2022-09-06T15:56:00.189000+00:00",
    "date": "m09-d06"
  },
  {
    "Other": "https://cdn.discordapp.com/attachments/1013926053653254164/1016736122635829379/--seed_57610015_--uuid_0.273300599222446_hybrid_animal_bread_dog.jpg",
    "Zaltys": "",
    "timestamp": "2022-09-06T15:51:52.078000+00:00",
    "date": "m09-d06"
  },
  {
    "Other": "What I can do with this prompt to improve the output on a fennec fox fursona in 50s clothing?",
    "Zaltys": "Something like this, or am I completely off track?",
    "timestamp": "2022-09-06T14:35:54.121000+00:00",
    "date": "m09-d06"
  },
  {
    "Other": "--large --a --t --module test_furry_3 --sampler k_euler 50's clothing ad, skirt and blouse, motherly, cute face, hourglass figure:55 | Fennec fox fursona, skirt and blouse:35 | Beastars:5 | woman: -5",
    "Zaltys": "I find that hard to parse. Why the split categories? With what you currently have, it's going to generate humans.",
    "timestamp": "2022-09-06T14:34:01.824000+00:00",
    "date": "m09-d06"
  },
  {
    "Other": "oh was I supposed to use Summary without brackets?",
    "Zaltys": "Yep, it's without brackets. Just need `***` after it to force it into prose instead of outputting, say, a movie review.",
    "timestamp": "2022-09-05T13:54:55.173000+00:00",
    "date": "m09-d05"
  },
  {
    "Other": "ive had success with `[ Synopsis:` today with Krake",
    "Zaltys": "Instead of `Summary:`? And it worked better? <:thonk:733040009136832642>",
    "timestamp": "2022-09-05T13:53:27.432000+00:00",
    "date": "m09-d05"
  },
  {
    "Other": "Instead of doing `Write a love story:` I'd try something like:\n> `[ Author: <some romance author you've looked up> ; Title: <An imaginary title for your story> ; Tags: <tags you'd like to see> ; Genre: romance ]`\n> `<A synopsis sentence describing what you'd like to see.>`\n> `***`\nThen let the AI generate something for you on Line 4 if you don't want to write the start yourself, playing with modules and presets if necessary or if you think of an idea you can add it yourself.",
    "Zaltys": "This, except skip Author and Title. Those are rarely useful.",
    "timestamp": "2022-09-05T13:51:44.743000+00:00",
    "date": "m09-d05"
  },
  {
    "Other": "It is fantastic at landscapes.",
    "Zaltys": "Yep. This was one of my early attempts, can post it now that bot's out.",
    "timestamp": "2022-09-05T00:11:18.895000+00:00",
    "date": "m09-d05"
  },
  {
    "Other": "Yoink!\n(I needed more landscape artist tags)",
    "Zaltys": "That was just one section of it. `Mark Keathley, Jessica Rossier, Phuoc Quan` for colorful landscapes, etc.",
    "timestamp": "2022-09-05T00:02:53.706000+00:00",
    "date": "m09-d05"
  },
  {
    "Other": "Wait, what are the section token limits? Haven't heard of that one.",
    "Zaltys": "See here: https://discord.com/channels/836774308772446268/975739920306036766/1016099660466749460",
    "timestamp": "2022-09-04T23:35:21.520000+00:00",
    "date": "m09-d04"
  },
  {
    "Other": "Which can be a hassle if Z is long to write.",
    "Zaltys": "It's a hassle, but at least the token limits are separate per section, so it doesn't matter if they get long.",
    "timestamp": "2022-09-04T23:34:06.123000+00:00",
    "date": "m09-d04"
  },
  {
    "Other": "What I mean is that the instruction `X: 1 | Y: 2 | Z: 3` gets interpreted as \"give me a portion of X, two portions of Y, and three portions of Z, rather than \"one portion if X and two portions of Y, in the overall style Z\"",
    "Zaltys": "Yep. And `X:1|Y:2|Z` _seems_ to get interpreted as 1:2:1. But don't quote me on that, I only just learned about it myself.",
    "timestamp": "2022-09-04T23:31:34.738000+00:00",
    "date": "m09-d04"
  },
  {
    "Other": "Tried it, but the effect is that the style comes into competition with the rest of the content, which results in the other instructions having overall less weight.",
    "Zaltys": "Yea, I'm not sure what the weights are if you neglect to add them for one section. It definitely uses it, might default to 1 based on quick testing. Could just ask Aero, but... now's not a good time.",
    "timestamp": "2022-09-04T23:28:27.187000+00:00",
    "date": "m09-d04"
  },
  {
    "Other": "Don't think there's an official acknowledgement until the announcement lands but that's almost the expectation, training steps kind of become the NAI compute currency.",
    "Zaltys": "Not exactly an announcement, but... https://discord.com/channels/836774308772446268/837402685824565278/1010904147589079100",
    "timestamp": "2022-09-03T22:51:32.995000+00:00",
    "date": "m09-d03"
  },
  {
    "Other": "",
    "Zaltys": "Kind of hard to control, though. The original could've just as well been meant to be a green alien with ipad.",
    "timestamp": "2022-09-03T15:27:16.739000+00:00",
    "date": "m09-d03"
  },
  {
    "Other": "I can't help but notice there's no image bot how to channel, even though the announcement says the how-to and intro to the bot is in said channel",
    "Zaltys": "Check the pins.",
    "timestamp": "2022-09-02T05:29:16.918000+00:00",
    "date": "m09-d02"
  },
  {
    "Other": "Someone pointed that out to me earlier, that, that is what caused nai's inception.",
    "Zaltys": "Yep. If AID hadn't been so two-faced about the whole thing, I might've stayed there. And then who knows where NAI's dataset would be today. Funny how things work out.",
    "timestamp": "2022-09-02T00:52:23.881000+00:00",
    "date": "m09-d02"
  },
  {
    "Other": "Does anyone know if there’s a way to delete imported modules and presets? I have different/updated versions of the same preset and some modules I didn’t like.",
    "Zaltys": "Oh, and for presets, you'll need to go into edit and delete them one by one. The pen symbol next to the preset in third tab.",
    "timestamp": "2022-09-01T22:41:30.604000+00:00",
    "date": "m09-d01"
  },
  {
    "Other": "Does anyone know if there’s a way to delete imported modules and presets? I have different/updated versions of the same preset and some modules I didn’t like.",
    "Zaltys": "You can delete modules from the `All Modules` list (link next to the module list.)",
    "timestamp": "2022-09-01T22:39:37.714000+00:00",
    "date": "m09-d01"
  },
  {
    "Other": "petite, beautiful, etc.",
    "Zaltys": "Even `pink`. Noticed that with kobold scale colors, etc.",
    "timestamp": "2022-09-01T13:48:17.153000+00:00",
    "date": "m09-d01"
  },
  {
    "Other": "Is it still more like a list, or it's just trained to avoid learning prose from within that defined block, but still reliably retain the information? Sorry for all the questions, I've been out of the theory loop since around when AID took a nosedive and GPT-3 basically became a ghost.",
    "Zaltys": "The recent models — and by that I mostly mean Krake, though some of it made it into Euterpe — are trained to follow Attributes with high quality prose, and to apply the Attributes data into that paragraph. As such, it can be used without negative impact on the quality.",
    "timestamp": "2022-08-29T08:38:37.902000+00:00",
    "date": "m08-d29"
  },
  {
    "Other": "I'll be fair to them and say that if they keep devoting so much dev time to image gen, which is not THAT hugely important, it will only push back more important and cooler stuff like Modules V2",
    "Zaltys": "Well, it gives me more time to work on the module datasets. <:shrug:332268181517238272>",
    "timestamp": "2022-08-28T19:38:59.090000+00:00",
    "date": "m08-d28"
  },
  {
    "Other": "Why is everyone here obsessed with telling people to go to bed?",
    "Zaltys": "Probably because most of the devs forget to sleep if you don't tell them to.",
    "timestamp": "2022-08-23T09:21:36.452000+00:00",
    "date": "m08-d23"
  },
  {
    "Other": "Ban male, males, man, men, boy, boys",
    "Zaltys": "\"My father was a cow~~boy~~.\"",
    "timestamp": "2022-08-22T11:42:11.398000+00:00",
    "date": "m08-d22"
  },
  {
    "Other": "Ohhh...do Aini",
    "Zaltys": "",
    "timestamp": "2022-08-21T15:47:30.997000+00:00",
    "date": "m08-d21"
  },
  {
    "Other": "You are cheating. You still have to specify if in the morning or if in the afternoon",
    "Zaltys": "Can't remember the last time I did that. It's usually obvious from context.",
    "timestamp": "2022-08-21T14:54:25.928000+00:00",
    "date": "m08-d21"
  },
  {
    "Other": "Would you trust him",
    "Zaltys": "",
    "timestamp": "2022-08-20T16:50:14.907000+00:00",
    "date": "m08-d20"
  },
  {
    "Other": "So, basically it's like this?\n2022 - Available for Opus\n2024 - Available for Scroll\n2026 - Available for Tablet",
    "Zaltys": "Probably not.",
    "timestamp": "2022-08-20T12:15:44.785000+00:00",
    "date": "m08-d20"
  },
  {
    "Other": "Oh man, next time I GM I am 100% using imgen to mess with the players.",
    "Zaltys": "\"You open the door. Here's what you see on the other side.\"",
    "timestamp": "2022-08-20T11:53:53.812000+00:00",
    "date": "m08-d20"
  },
  {
    "Other": "https://tenor.com/view/comedy-parody-adult-swim-ntsfsdsuv-piper-gif-3454000",
    "Zaltys": "https://www.youtube.com/watch?v=XFD0WSGW-FM",
    "timestamp": "2022-08-20T08:27:17.558000+00:00",
    "date": "m08-d20"
  },
  {
    "Other": "I guess I could, I'm just testing a lorebook I'm making",
    "Zaltys": "Copy the story, then delete the current context from the duplicate. That way you keep the lorebook etc but 'reset' the story.",
    "timestamp": "2022-08-19T20:19:40.133000+00:00",
    "date": "m08-d19"
  },
  {
    "Other": "I take from this that descriptive prose remains the winner, but there's a level of knowledge i.e. attributes and other \"meta knowledge\" of the fine tuning that still means NAI is best used by power users that have a lot of experience, which is somehow not ideal.\nGranted learning how to use the tool is a part of its potential but still feels sometimes like it's just not going to be exposed to casual folks trying it for the first few times.",
    "Zaltys": "It's really mostly third person and preset, from what I've seen. Writing descriptive prose is overplayed, as eventually retrying gets the same results with right preset. I've never had issues with getting Krake to stick to descriptive when generating from blank prompts.",
    "timestamp": "2022-08-19T01:58:32.093000+00:00",
    "date": "m08-d19"
  },
  {
    "Other": "I tried adding `[ Style: verbose, evocative, purple prose, descriptive ]` but it's not as descriptive as I want it to be. I use Euterpe btw.",
    "Zaltys": "That'd be why. `Style:` wasn't yet included in Euterpe, so no wonder it doesn't work there.\nAs for more descriptive prose: most importantly, use third person. And secondly, switch to a preset that allows a wider variety of output, such as Ouroboros, as the default preset defaults to plain text due to how shallow the token pool is. Then — if you can't write descriptive prose yourself — just keep retrying until you get something descriptive, and keep generating from there. It'll catch on soon enough.",
    "timestamp": "2022-08-19T01:53:31.267000+00:00",
    "date": "m08-d19"
  },
  {
    "Other": "(\"I'm 23 years old.\" She replies with a slight smile.\nYou check Yume's file and find that she is indeed 24.) my character doing receptionist work aaah gotta love the Ai's memory.",
    "Zaltys": "That's likely the (too high) rep penalty kicking in. <:shrug:332268181517238272>",
    "timestamp": "2022-08-18T09:57:22.107000+00:00",
    "date": "m08-d18"
  },
  {
    "Other": "Try `by peter mohrbacher` It's much stronger in my experience",
    "Zaltys": "Yea, that one's good. I've been trying various artists with it. `By Simon Stålenhag` is pretty distinct.",
    "timestamp": "2022-08-14T14:35:26.595000+00:00",
    "date": "m08-d14"
  },
  {
    "Other": "Not in my experience.. mostly I swap to a new one after 5-10 years, depending on how much of a cheapskate I wanna be.",
    "Zaltys": "Mmh. About the same for me. It gets to the point where I'd need to replace the motherboard for compatibility, and then I usually just go 'okay, time to build a completely new rig'.",
    "timestamp": "2022-08-13T14:56:48.226000+00:00",
    "date": "m08-d13"
  },
  {
    "Other": "The AIs are Hornier than like 90% of the people using it anyway, trying to censor it always seemed bassackwards.",
    "Zaltys": "Ha. No. Have you seen fanfiction sites?",
    "timestamp": "2022-08-11T16:08:55.020000+00:00",
    "date": "m08-d11"
  },
  {
    "Other": "8GB VRAM",
    "Zaltys": "I'm still on 4GB over here. <:grimberk:927698521262534686>\nNot that I really need it for editing, but still...",
    "timestamp": "2022-08-11T10:34:16.601000+00:00",
    "date": "m08-d11"
  },
  {
    "Other": "The use of a dinkus there kind of makes sense, but it's a lot stronger than a linebreak, and I don't think a dinkus is really necessary for Memory.",
    "Zaltys": "Highly recommended if there's any non-prose data in the memory. If it's all prose, might manage to do without it.",
    "timestamp": "2022-08-08T08:28:56.697000+00:00",
    "date": "m08-d08"
  },
  {
    "Other": "wouldn't that make the AI think it's end of chapter and forget it?",
    "Zaltys": "Why would it? It's a chapter break, not story break.",
    "timestamp": "2022-08-08T07:52:22.629000+00:00",
    "date": "m08-d08"
  },
  {
    "Other": "",
    "Zaltys": "Dark fantasy?",
    "timestamp": "2022-08-07T00:12:42.081000+00:00",
    "date": "m08-d07"
  },
  {
    "Other": "Even with all of the tools available \"The Story So Far:\" prompt engineering is still rather limited. It is as much time to just write a basic entry as it is to try and get NAI to accurately summarize.",
    "Zaltys": "Yea, it'll likely never work for that purpose. Since `The story so far:` tends to be found in the beginning of the stories, as a synopsis of the previous book. And due to how the chunks are ordered, it can't really connect to what's _before_ it.\nBut it is somewhat effective in Krake for different use: you can put that in prompt (with a short summary in it) to direct where you want it to start the story.",
    "timestamp": "2022-08-06T05:50:39.920000+00:00",
    "date": "m08-d06"
  },
  {
    "Other": "I don't think many 3rd person present tense stories exist",
    "Zaltys": "Extremely rare. https://www.goodreads.com/shelf/show/third-person-present-tense\n(And some of those are on the wrong list.)",
    "timestamp": "2022-08-06T01:14:32.238000+00:00",
    "date": "m08-d06"
  },
  {
    "Other": "You think d&d alignments would work in a character's lore entry? Like just putting [Lawful Evil] or [Chaotic Good] in the beginning. Going to try some experiments, just wanted to see if anyone else has tried.",
    "Zaltys": "Use attributes. It's been trained in `Alignment: Lawful Evil`, etc.",
    "timestamp": "2022-08-04T20:27:05.420000+00:00",
    "date": "m08-d04"
  },
  {
    "Other": "And Zaltys was a popular guy back in AID",
    "Zaltys": "More like controversial.\nNah, I'm here thanks to Belverk. I helped with the initial datasetting... and when everyone else lost interest, I kept working 24/7 and ended up as the current main editor for the dataset.",
    "timestamp": "2022-08-01T06:58:28.841000+00:00",
    "date": "m08-d01"
  },
  {
    "Other": "I'll undo often, but mostly when Retry locks up on Editor V2 (which is when I do anything). I use the redo tree rarely and usually only to get a sentence from a different branch",
    "Zaltys": "Also, yeah, this. I've used it a lot more in v2 due to Retry constantly locking up. Have to resort to Undo + Send instead.",
    "timestamp": "2022-08-01T05:15:34.888000+00:00",
    "date": "m08-d01"
  },
  {
    "Other": "what about the `----`? should it be between all lorebook entries so the AI can tell them apart?",
    "Zaltys": "I mean, that depends on what kind of entries we're talking about. <:shrug:332268181517238272>\nIf it's prose, then no `----` whatsoever.",
    "timestamp": "2022-07-31T21:00:20.447000+00:00",
    "date": "m07-d31"
  },
  {
    "Other": "Wait Zaltys, what would you suggest for Attributes entries with prose at the bottom? *** or ----?",
    "Zaltys": "Only what's right after the separator matters. Whenever the AI sees `***`, it tends to go 'okay, time to switch to prose' now.",
    "timestamp": "2022-07-31T20:58:26.611000+00:00",
    "date": "m07-d31"
  },
  {
    "Other": "---- between attribute entries, \\*\\*\\* for the rest",
    "Zaltys": "`----` for data, `***` for prose. (It's trained that way, keeps data from leaking into prose.)",
    "timestamp": "2022-07-31T20:50:51.770000+00:00",
    "date": "m07-d31"
  },
  {
    "Other": "What font would include it?",
    "Zaltys": "Most Sans fonts should.",
    "timestamp": "2022-07-27T07:30:29.884000+00:00",
    "date": "m07-d27"
  },
  {
    "Other": "<@409511804293611530> I'm sure you're aware of this. Do I need a font update or something along those lines?",
    "Zaltys": "It shows up as a placeholder character (question mark in box)? If so, that's just your selected font missing the symbol. It'll still work.",
    "timestamp": "2022-07-27T07:27:47.652000+00:00",
    "date": "m07-d27"
  },
  {
    "Other": "What unspeakable things are you and Sage doing to poor Sigurd behind the scenes? <:cryblob:673919103404081156>",
    "Zaltys": "",
    "timestamp": "2022-07-26T12:45:46.458000+00:00",
    "date": "m07-d26"
  },
  {
    "Other": "Actually, NAI can generate pretty decent articles if we bothered to do so.",
    "Zaltys": "The `History` module is particularly good at that. Really puts the AI into textbook-style mindset. It's what I'd use if I needed help writing an essay.",
    "timestamp": "2022-07-25T22:56:17.065000+00:00",
    "date": "m07-d25"
  },
  {
    "Other": "Tried to get Krake to write a split personality character that sees the other personality as a hallucination and I'm failing at it spectaculary. <:hah:844747249505402880>",
    "Zaltys": "I've had some success with that.\nhttps://discord.com/channels/836774308772446268/919724433013346324/987846199899988009",
    "timestamp": "2022-07-24T19:41:39.352000+00:00",
    "date": "m07-d24"
  },
  {
    "Other": "Pretty sure NAI strips trailing white space",
    "Zaltys": "Unless you tell it not to.\nI can't think of a valid use for this, so not sure why this is even an option. Easiest way to mess up the output.",
    "timestamp": "2022-07-23T19:32:52.191000+00:00",
    "date": "m07-d23"
  },
  {
    "Other": "It would explain a lot in our history if people were just hungry and cranky a lot for the time.",
    "Zaltys": "I've been on alternate-day fasting for months. Stopped feeling hungry after a week or so.",
    "timestamp": "2022-07-21T16:28:30.996000+00:00",
    "date": "m07-d21"
  },
  {
    "Other": "<@201031883360960522> <:berk:837330926866268160>",
    "Zaltys": "",
    "timestamp": "2022-07-20T04:16:05.601000+00:00",
    "date": "m07-d20"
  },
  {
    "Other": "There's about a dozen specific words/phrases that if I can rule out in specific areas that my experience with NAI would be much better.",
    "Zaltys": "Out of curiosity, what's the worst one? (I could always check the dataset and see which novels overuse them, and whether they're tossable. <:kek:692062611659030548>)",
    "timestamp": "2022-07-15T23:59:12.912000+00:00",
    "date": "m07-d15"
  },
  {
    "Other": "<@409511804293611530> How painful is it to go through all the zoomer and xoomer and whatever generation's smut and weird fiction?",
    "Zaltys": "Not at all. I love it.",
    "timestamp": "2022-07-15T12:02:50.329000+00:00",
    "date": "m07-d15"
  },
  {
    "Other": "https://en.wikipedia.org/wiki/MSX#Impact",
    "Zaltys": "This is what I started with - http://www.computinghistory.org.uk/userdata/images/large/59/74/product-85974.jpg",
    "timestamp": "2022-07-15T12:01:41.800000+00:00",
    "date": "m07-d15"
  },
  {
    "Other": "how old are you? <:MonkaW:875483161985957948> <@409511804293611530>",
    "Zaltys": "About the same as Sage.",
    "timestamp": "2022-07-15T12:00:20.765000+00:00",
    "date": "m07-d15"
  },
  {
    "Other": "ahh looks like it's called alley cat (1984)",
    "Zaltys": "That's something that pretty much everyone in my age range has played. Somehow it ended up on all school computers.",
    "timestamp": "2022-07-15T11:59:52.925000+00:00",
    "date": "m07-d15"
  },
  {
    "Other": "Rookie numbers.",
    "Zaltys": "Mine. This doesn't seem right. Keys from bundles are probably inflating this.",
    "timestamp": "2022-07-15T11:27:36.265000+00:00",
    "date": "m07-d15"
  },
  {
    "Other": "Outputs are not good for me, mostly unrelated to the prompt. And often abotu an old man for some reason",
    "Zaltys": "Tried a different summary. ```Summary: The Keepers are a secret sect that has been maintaining an ancient library for thousand years or more — nobody knows for how long. It is said to contain all the knowledge of the world.\n***\nWhat is real? Is the \"real\" world more than just the physical one we live in, with our senses and our brains? What if there was a place where something more substantial exists beyond the borders of our space and time?\nThe theory goes like this: Imagine two parallel lines, so far away from each other they can't be seen by the naked eye. Both lines are moving at the same speed in the exact same direction. One line represents the physical world, filled with objects such as stars, planets, trees, rocks, water, air, people, and so on. The second line represents the universe of ideas — every book ever written, every song ever sung, every thought that's ever occurred to anyone who ever lived.\nNow imagine those two lines are approaching each other until they eventually meet. Every single idea in this universe will cross over into the physical realm, changing it in ways we don't even begin to understand. This is the moment of convergence when the physical and the metaphysical come face to face. At that very moment, the lines meet, creating one single line instead of two. It would look like a huge wave, rippling out towards infinity.\nThat moment is called the Great Convergence, and it is coming to pass now. For thousands of years, the Keepers have been preparing for it.\n***\nOnce upon a time, there was no Librarian. There was no Library. Once upon a time, there were no books. There were no people. The earth had not yet formed. The sun had not yet begun its journey through the heavens. Life had not yet begun to crawl from the primeval seas.\nOnce upon a time, there was only darkness.\nThis is what you were told, what was always taught. I say once upon a time because such stories of the ancient past cannot be proven, and even if they could be, their validity is unimportant. What matters is what happened after that first moment, when light was born out of darkness.\nBut that too is only myth, for the truth of things never came down to us in any way other than metaphorical. A story is what it is. The first idea is the seed from which a multitude grew. Ideas are more important than facts.```  Dunno where this is going, but that's typical for `Magic Library`. <:shrug:332268181517238272>",
    "timestamp": "2022-07-14T06:22:53.484000+00:00",
    "date": "m07-d14"
  },
  {
    "Other": "Zaltys did th rest of the 46. Lion did 1. 🙂",
    "Zaltys": "The `Inspiration` modules are by someone else.",
    "timestamp": "2022-07-14T05:39:58.655000+00:00",
    "date": "m07-d14"
  },
  {
    "Other": "What sort of works are included in Euterpe and Krake's Dark Fantasy module?",
    "Zaltys": "Grimdark anti-hero type of fantasy. A lot of demonic possessions and such.\nIf that module were a game, it'd be something like Darkest Dungeon or Drakengard.",
    "timestamp": "2022-07-13T22:05:27.446000+00:00",
    "date": "m07-d13"
  },
  {
    "Other": "Or I just bit the bullet and just buy extra copies.",
    "Zaltys": "Likely cheaper than buying something like ScanSnap SV600. Unless you're planning to scan hundreds of books.",
    "timestamp": "2022-07-13T18:01:35.213000+00:00",
    "date": "m07-d13"
  },
  {
    "Other": "Anyone ever manually scan in old paperbacks for a module?",
    "Zaltys": "Yep. I generally use a heat gun to take them apart, and OCR with ABBYY (the only one that actually works reliably.)",
    "timestamp": "2022-07-13T04:45:46.312000+00:00",
    "date": "m07-d13"
  },
  {
    "Other": "What would be the most cursed weapon to have?",
    "Zaltys": "My mind instantly went to Elona, and using panties as a weapon.",
    "timestamp": "2022-07-12T17:04:38.651000+00:00",
    "date": "m07-d12"
  },
  {
    "Other": "Not many people new to the server call Kurumuz Kuru",
    "Zaltys": "To be fair, not exactly new.\nBut yeah, put together it seems clear...",
    "timestamp": "2022-07-11T15:03:56.947000+00:00",
    "date": "m07-d11"
  },
  {
    "Other": "I have been going back and forth on whether ---- or *** work better for generator scenarios",
    "Zaltys": "`----` should work better in Krake, while Euterpe still uses `***`.",
    "timestamp": "2022-07-11T13:15:11.344000+00:00",
    "date": "m07-d11"
  },
  {
    "Other": "Random question since I forgot, what was the separator which used dashes? `-----`?",
    "Zaltys": "Four.",
    "timestamp": "2022-07-11T13:08:44.377000+00:00",
    "date": "m07-d11"
  },
  {
    "Other": "Yungoos is because plot",
    "Zaltys": "...toxicroak then.",
    "timestamp": "2022-07-11T13:08:26.368000+00:00",
    "date": "m07-d11"
  },
  {
    "Other": "Now generate Finland 2!",
    "Zaltys": "It went for Europa Universalis 4 level of alt history. <:shrug:332268181517238272>",
    "timestamp": "2022-07-10T13:19:01.948000+00:00",
    "date": "m07-d10"
  },
  {
    "Other": "It's like 2",
    "Zaltys": "It depends entirely on how wide your text window is...",
    "timestamp": "2022-07-09T23:14:54.521000+00:00",
    "date": "m07-d09"
  },
  {
    "Other": "And it continues getting off-track. <:sigh:838312001641381950>\n\n\nWhere the hell did I go wrong in lb creation?! <:blackshibu:339536777088073730>",
    "Zaltys": "This may sound counterintuitive, but try adding `----` before those entries.\nAnd add a `***` at the point where you want it to switch to prose.",
    "timestamp": "2022-07-09T21:22:54.161000+00:00",
    "date": "m07-d09"
  },
  {
    "Other": "The AI seems to not be able to properly rhyme.",
    "Zaltys": "Yea. It's all just token numbers for the AI, it has no clue about which ones rhyme.\n...now I'm tempted to grab some data from RhymeZone and see if that'd help.",
    "timestamp": "2022-07-09T20:48:32.603000+00:00",
    "date": "m07-d09"
  },
  {
    "Other": "Though all are separate entries.",
    "Zaltys": "Odd. I don't see anything there that'd trigger `----`.",
    "timestamp": "2022-07-09T20:46:10.464000+00:00",
    "date": "m07-d09"
  },
  {
    "Other": "What Model and Config Preset is best for poetry?",
    "Zaltys": "Krake, with `[ Style: poetry ]` tag.",
    "timestamp": "2022-07-09T20:35:48.464000+00:00",
    "date": "m07-d09"
  },
  {
    "Other": "so is it still bad practice with euterpe+krake to  utilize author's note like `[ style: W; tense: X; genre: Y; tags: Z ]` ?",
    "Zaltys": "One thing that _might_ still work in AN is the `[ Style: ... ]` tag. As there's a bit of dataset support for that. But only a bit, so it's difficult to tell if it's actually working, or just placebo.\nI've been using `[ Style: verbose ]` in some scenarios, and it's at least not hurting the output. Unlike most things that I've tried in AN.",
    "timestamp": "2022-07-07T18:10:52.349000+00:00",
    "date": "m07-d07"
  },
  {
    "Other": "Has anyone played a prompt in this style?\n```Information on the conversation below:\n- Bob is a beginning Dungeon Master\n- Joe is an experienced Dungeon Master who will give him good advice\n***\nBob: Hey so I wanna be a DM but don't know what to do```\nTo try to get advice on or talk about some pre-defined topic.",
    "Zaltys": "You could probably shorten it to... Let's see. Yep, this seems to work.",
    "timestamp": "2022-07-06T00:10:57.410000+00:00",
    "date": "m07-d06"
  },
  {
    "Other": "So it would repeat the setting in that same ---- block?",
    "Zaltys": "Yes, repetition can be useful. Single instance is rarely enough for it to learn.",
    "timestamp": "2022-07-03T22:54:04.167000+00:00",
    "date": "m07-d03"
  },
  {
    "Other": "In the example you posted, would that go underneath the \"Setting:\" line and before the dialogue example line?",
    "Zaltys": "It's built to be flexible, no need to worry about field orders. Just need those first, then a bit of prose.",
    "timestamp": "2022-07-03T22:52:02.063000+00:00",
    "date": "m07-d03"
  },
  {
    "Other": "So it's for seperating training examples? Like\n```\"The witch in the woods\"\nShe scary af\n----\n\"Zaltys' terrible secret\"\nNobody will ever know```",
    "Zaltys": "It varies a lot, but an average data entry would be something along the lines of: ```\n----\nEzreal, The Prodigal Explorer\nSetting: League of Legends\n \"If I don't know the rules, then how can I be breaking them?\" —Ezreal\nA dashing adventurer, unknowingly gifted in the magical arts, Ezreal raids long-lost catacombs, tangles with ancient curses, and overcomes seemingly impossible odds with ease. His courage and bravado knowing no bounds, he prefers to improvise his way out of any situation, relying partially on his wits, but mostly on his mystical Shuriman gauntlet, which he uses to unleash devastating arcane blasts. One thing is for sure—whenever Ezreal is around, trouble isn't too far behind. Or ahead. Probably everywhere.``` Followed by more entries for different characters.",
    "timestamp": "2022-07-03T22:48:47.336000+00:00",
    "date": "m07-d03"
  },
  {
    "Other": "Zaltys has all the mental qualities of student body president, but wouldn't ever take that role willingly because multiple reasons 🤔",
    "Zaltys": "Pfft. I'm clearly the janitor.",
    "timestamp": "2022-07-03T16:18:06.936000+00:00",
    "date": "m07-d03"
  },
  {
    "Other": "\"her stringy orchid twines of hair swaying gracefully over the lithe opaque nose, as she raised a half drained mug to her pale red lips.\"",
    "Zaltys": "Goes to show that verbose isn't always good. (...not sure what 'orchid twines of hair' is even supposed to mean. Is her hair literally purple?)",
    "timestamp": "2022-07-02T23:15:28.841000+00:00",
    "date": "m07-d02"
  },
  {
    "Other": "Well, beyond having decent language skills, being a good writer also involves things like knowing how to make a story engaging to read.",
    "Zaltys": "```Grignr weighed his position observing his plight, where-upon he took the soldier's advice as the only logical choice. To attempt to hack his way from his present predicament could only warrant certain death. He was of no mind to bring upon his own demise if an alternate path presented itself. The will to necessitate his life forced him to yield to the superior force in hopes of a moment of carlessness later upon the part of his captors in which he could effect a more plausible means of escape.```",
    "timestamp": "2022-07-02T22:54:20.126000+00:00",
    "date": "m07-d02"
  },
  {
    "Other": "exactly!",
    "Zaltys": "They take care of that before going into hibernation.\nHibernation burns fat reserves. Just like humans going on fast.",
    "timestamp": "2022-07-01T16:45:25.464000+00:00",
    "date": "m07-d01"
  },
  {
    "Other": "I tried to google of that's a real word but google is just confusing me",
    "Zaltys": "`Compleat is said to mean 'quintessential', one meaning of complete is closely related as 'skilled; accomplished'. In Britain, compleat is archaic, used in writing only as a bit of whimsy, and at that rather rarely.`\nD&D used it in a few guides.",
    "timestamp": "2022-07-01T08:18:18.779000+00:00",
    "date": "m07-d01"
  },
  {
    "Other": "Thanks! I been trying to explain my characters description in the logbook such as \"The character has long blue hair.\", and also writing in  tags something like : \"Appearance: long blue hair\" to help the AI be more accurate,but it's not picking up that.",
    "Zaltys": "Try hair/eye etc colors in `Attributes:` instead. Worked better the last time I tested the probs. `Appearance:` is good for generic appearance, though.",
    "timestamp": "2022-06-30T01:29:22.150000+00:00",
    "date": "m06-d30"
  },
  {
    "Other": "<@409511804293611530> How did you come up with your username?",
    "Zaltys": "https://en.wikipedia.org/wiki/%C5%BDaltys",
    "timestamp": "2022-06-30T01:09:33.720000+00:00",
    "date": "m06-d30"
  },
  {
    "Other": "do you think any other enclosing marks would be necessary?",
    "Zaltys": "Not needed.\n`<text>` are used for telepathy, but can work with thoughts too.",
    "timestamp": "2022-06-30T01:08:29.585000+00:00",
    "date": "m06-d30"
  },
  {
    "Other": "how would you indicate inner thoughts to the AI then?",
    "Zaltys": "Add something like `, he thought.` to the thought.",
    "timestamp": "2022-06-30T01:05:43.047000+00:00",
    "date": "m06-d30"
  },
  {
    "Other": "John Doe does look to be more effective for Krake than John Smith.",
    "Zaltys": "John Doe's pretty heavily associated with cadavers. Might take it into wrong direction. Not that I have better suggestions. (Joe Public is likely not widespread enough. Could try `Anon` for laughs.)",
    "timestamp": "2022-06-26T09:02:53.735000+00:00",
    "date": "m06-d26"
  },
  {
    "Other": "I have a question. If i would like to change the tone of the story like make it more darker or something, how would I go about it? Would I use author's note or memory?",
    "Zaltys": "`[ Tags: dark ]` in Memory, at the top.",
    "timestamp": "2022-06-25T23:29:33.224000+00:00",
    "date": "m06-d25"
  },
  {
    "Other": "Does Euterpe have a poetry module?",
    "Zaltys": "Won't need one. Just prompt with em space (` `).",
    "timestamp": "2022-06-25T22:43:13.080000+00:00",
    "date": "m06-d25"
  },
  {
    "Other": "Is Calypso any good? I only used it once, but it ended up repeating paragraphs",
    "Zaltys": "Calypso has minimal Top-K with restrictive settings, so that'll happen. The AI can't do much about repetition when there's only one option to choose from.",
    "timestamp": "2022-06-22T01:34:03.740000+00:00",
    "date": "m06-d22"
  },
  {
    "Other": "For those who use Krake: What's your most liked Krake preset?",
    "Zaltys": "Krait",
    "timestamp": "2022-06-22T01:31:45.551000+00:00",
    "date": "m06-d22"
  },
  {
    "Other": "If there is no space, something went definitely wrong",
    "Zaltys": "` indul|gently` <:ogtroll:838076368633593866>",
    "timestamp": "2022-06-20T22:18:25.360000+00:00",
    "date": "m06-d20"
  },
  {
    "Other": "Does that just plopped in wherever in the finetune, or does that come in right after chapter breaks?",
    "Zaltys": "Yep, after scene breaks.",
    "timestamp": "2022-06-20T19:59:08.901000+00:00",
    "date": "m06-d20"
  },
  {
    "Other": "All the entries have been unbracketed for Euterpe and Krake",
    "Zaltys": "No? They weren't there in the first place. Except for what I've outlined in that one pin.",
    "timestamp": "2022-06-20T19:58:09.662000+00:00",
    "date": "m06-d20"
  },
  {
    "Other": "Stuff like `Scene: Tavern`.",
    "Zaltys": "If it's that basic, then just `[ Tavern ]`. Though `Scene:` does seem useful for longer descriptions. Those mostly come from scripts (theatre, TV shows) and such.",
    "timestamp": "2022-06-20T19:57:03.227000+00:00",
    "date": "m06-d20"
  },
  {
    "Other": "Most paid PDF programs have an ocr function",
    "Zaltys": "The latest ABBYY Finereader is the only one worth using. Adobe's OCR is terrible.",
    "timestamp": "2022-06-18T20:52:19.947000+00:00",
    "date": "m06-d18"
  },
  {
    "Other": "Can you elaborate on why?",
    "Zaltys": "And rn/m, i/l/I in some fonts, etc. Add to this that some pages are often scanned a bit askew, making it even harder for the software to understand...\nI've done OCR scans for the dataset, but they're generally so time-consuming that I try to avoid them. Unless it's something that we really need. Could add twenty other books in the same time from epubs, etc.",
    "timestamp": "2022-06-18T20:51:23.676000+00:00",
    "date": "m06-d18"
  },
  {
    "Other": "Would you ever consider doing a video of you showing off how to clean and format a dataset?",
    "Zaltys": "I doubt I could find time for it. Most of the important things are in the wiki - https://naidb.miraheze.org/wiki/Datasetting_for_AI_Modules\nBut an automated tool for actually fixing those would be great.",
    "timestamp": "2022-06-18T18:59:20.762000+00:00",
    "date": "m06-d18"
  },
  {
    "Other": "I can't wait for module v2 to pick up on my every mistake in my training data and shove it back into my face.",
    "Zaltys": "Could definitely use some kind of web-based error checker for module data. (I mostly use Notepad++ scripts, not exactly useful for general use.)",
    "timestamp": "2022-06-18T18:43:52.886000+00:00",
    "date": "m06-d18"
  },
  {
    "Other": "would you say attributes put a certain emphasis on what you input vs regular prose, where everything is considered pretty equally unless you configure biases?",
    "Zaltys": "Attributes is built so that it should generate decent prose regardless of what's in the fields. Be it lists or prose.",
    "timestamp": "2022-06-18T18:07:16.301000+00:00",
    "date": "m06-d18"
  },
  {
    "Other": "How differently would you say attribute prose and regular prose are considered by the AI? Like, say you'd have prose unformatted vs the same prose formatted in attributes.",
    "Zaltys": "Depends a lot on the field. Some of them work better with prose than others. `Attributes:` itself is mainly lists, whereas something like `Summary:` is always prose.",
    "timestamp": "2022-06-18T18:03:51.249000+00:00",
    "date": "m06-d18"
  },
  {
    "Other": "he says *badly phrased* prose is worse than attributes. I said earlier, *if phrased well*, if you remember.",
    "Zaltys": "Yep. I'd say that Attributes works decently and definitely beats _bad_ prose, but there's certainly room for improvement. I'll keep working on it...",
    "timestamp": "2022-06-18T18:00:05.121000+00:00",
    "date": "m06-d18"
  },
  {
    "Other": "But it might also be a placebo effect, I don't know.",
    "Zaltys": "Nah. ATTG only appears after <|endoftext|>, so it's heavily associated with a new story. Wouldn't want that in _middle_ of one. Worse than sticking `⁂` in there.",
    "timestamp": "2022-06-17T23:14:10.452000+00:00",
    "date": "m06-d17"
  },
  {
    "Other": "You will be able to train your own commentator bots yep!",
    "Zaltys": "Can you go into details about how that'll work?",
    "timestamp": "2022-06-17T03:50:39.563000+00:00",
    "date": "m06-d17"
  },
  {
    "Other": "🤷‍♀️  Opus is unlimited. Cell providers used to provide actual free \"Unlimited\" back in the day naively. Then they realized it was not practical or sustainable so now it's \"Unlimited until the first such and such data amount then you get 3G/2G.\"",
    "Zaltys": "Hm. Not sure about that analogy. We still have Unlimited as standard over here, and the tele operators haven't really complained about it being unsustainable.",
    "timestamp": "2022-06-17T03:50:01.734000+00:00",
    "date": "m06-d17"
  },
  {
    "Other": "so basically Hypebot is like if you played with someone online and he's reacting to ur story",
    "Zaltys": "Just imagine. If training gets added, you could make one called 'Grandma' and see how it reacts. <:troll:763628012838060062>",
    "timestamp": "2022-06-16T18:29:41.305000+00:00",
    "date": "m06-d16"
  },
  {
    "Other": "don't understand the hypebot usage tho",
    "Zaltys": "Mostly for fun, I'd assume. Ever watched Mystery Science Theater 3000?",
    "timestamp": "2022-06-16T17:59:18.291000+00:00",
    "date": "m06-d16"
  },
  {
    "Other": "Please any developers reading this, will we be able to generate smut?",
    "Zaltys": "I don't see why not.",
    "timestamp": "2022-06-16T17:55:59.010000+00:00",
    "date": "m06-d16"
  },
  {
    "Other": "I haven't had as much success with Krake prose enhancer as I wish",
    "Zaltys": "If the prose starts to get noticeably bad, try throwing in something like `[ Style: verbose, detailed ]` at the end and generating from that.",
    "timestamp": "2022-06-15T21:20:18.274000+00:00",
    "date": "m06-d15"
  },
  {
    "Other": "For an adult D&D setting. Is \"generally fantasy\" the best theme setting ?",
    "Zaltys": "`General Fantasy` is the standard Tolkienesque fantasy, with humans, elves, dwarves, orcs and the like. So yes, that'd be a decent pick for D&D. I doubt that `Dark Fantasy` will handle D&D weill. That's more of the angsty antihero / demonic possession type of fantasy.\nCould be that `No Module` with ATTG  works best, at least in Krake. `[ Tags: D&D; Genre: fantasy ]`, just add whatever else you need.",
    "timestamp": "2022-06-14T11:51:48.049000+00:00",
    "date": "m06-d14"
  },
  {
    "Other": "Front and Back Memory? Short Term and Long Term Memory? A real thinker.",
    "Zaltys": "Front and back were suggested, but which part of the story is actually the front? (Also consider which side of a book is front.)",
    "timestamp": "2022-06-13T18:32:59.811000+00:00",
    "date": "m06-d13"
  },
  {
    "Other": "hey guys is it possible to create a script for a short movie using novel AI?",
    "Zaltys": "Certainly. I'd recommend getting it started with a prompt in script style. As in: ```7TH JUROR (turning to the 8TH JUROR): Do you want some gum?\n8TH JUROR (smiling): No, thanks.\nThe 7TH JUROR vigorously chews a piece of gum himself and crosses to the 6TH JUROR.\n7TH JUROR (mopping his brow): Y'know something? I phoned up for the weather. This is the hottest day of the year.\nThe 6TH JUROR nods and gazes out of the window. ```",
    "timestamp": "2022-06-12T15:19:21.488000+00:00",
    "date": "m06-d12"
  },
  {
    "Other": "In my next series of prompts, I'm going to keep it to the absolute essentials. Ergo, three lorebook entries:\n[ Name: Zodip Grim; Wife: Adalace; Team: Adalace, Casid; ]\n[ Name: Adalace Grim; Husband; Zodip; Team: Casid, Zodip; ]\n[ Name: Casid Lore; Team: Adalace, Zodip; ]",
    "Zaltys": "This in Krake? Try without brackets. Attributes was made to work without those.",
    "timestamp": "2022-06-11T17:09:55.823000+00:00",
    "date": "m06-d11"
  },
  {
    "Other": "Tried to make Krake generate some names for me.",
    "Zaltys": "",
    "timestamp": "2022-06-05T19:41:10.646000+00:00",
    "date": "m06-d05"
  },
  {
    "Other": "It's in the Finetune",
    "Zaltys": "More or less. Could definitely use more data for most of them, but considering that I'm the only one working on the data, I can't spare too much time on that. Too many other projects.",
    "timestamp": "2022-06-01T02:15:12.235000+00:00",
    "date": "m06-d01"
  },
  {
    "Other": "Stuff like Blue Lighter didn't get updated after Krake v2 release, right?",
    "Zaltys": "Krait got updated a bit at some point. Mostly due to the Typical bug getting fixed. Iris might've been too, I don't quite remember.",
    "timestamp": "2022-06-01T02:07:22.208000+00:00",
    "date": "m06-d01"
  },
  {
    "Other": "Was he wrong to be upset",
    "Zaltys": "Yep. Most Finns can trace at least some of their ancestry to Asia. Can thank Genghis Khan for that.",
    "timestamp": "2022-05-29T13:00:14.890000+00:00",
    "date": "m05-d29"
  },
  {
    "Other": "Friendly reminder that this will be a furry only server from now on in 5 minutes",
    "Zaltys": "https://i.imgur.com/dfdNWpL.jpg",
    "timestamp": "2022-05-27T22:26:54.824000+00:00",
    "date": "m05-d27"
  },
  {
    "Other": "Me after a night of finding out that Krake can generate working hidden Imgur links but some have lewds in it.",
    "Zaltys": "Oh, I gotta try that. Let's see what it finds—\nhttps://i.imgur.com/6kMci.jpg <:doom:837136374493741057>",
    "timestamp": "2022-05-26T10:43:55.882000+00:00",
    "date": "m05-d26"
  },
  {
    "Other": "winnie the pooh is getting a makeover",
    "Zaltys": "It's out of copyright now, so anyone can do whatever they want with the franchise. I'm surprised that there hasn't been any 'questionable' adaptations yet.",
    "timestamp": "2022-05-26T10:27:55.798000+00:00",
    "date": "m05-d26"
  },
  {
    "Other": "Look at the logprobs of the answer. 15% chance of it staying, \"Yes\". <:sagePog:888870733298688001>",
    "Zaltys": "Trying to lead it with `Of course`:",
    "timestamp": "2022-05-22T04:53:27.498000+00:00",
    "date": "m05-d22"
  },
  {
    "Other": "",
    "Zaltys": "Yea, that's fine. Not too horni.",
    "timestamp": "2022-05-20T20:23:10.643000+00:00",
    "date": "m05-d20"
  },
  {
    "Other": "",
    "Zaltys": "Same, but with an Attributes entry in memory (at Top K 1):",
    "timestamp": "2022-05-20T20:13:09.224000+00:00",
    "date": "m05-d20"
  },
  {
    "Other": "Oh, now I want to see how Krake handles pixies and the like",
    "Zaltys": "Those are also likely easiest to do with Attributes. `Height: 20 cm | 8 in (really small)`",
    "timestamp": "2022-05-20T20:09:08.492000+00:00",
    "date": "m05-d20"
  },
  {
    "Other": "First try I got this",
    "Zaltys": "Yea, but that's a human.",
    "timestamp": "2022-05-20T20:07:36.799000+00:00",
    "date": "m05-d20"
  },
  {
    "Other": "Thanks, I ask because I am wondering if it would be possible to use it in a roguelike that could narrate what a character is saying with a random voice seed",
    "Zaltys": "I don't see why not. The main issue would be the generation times. But sooner or later, I'm sure some games will do that.",
    "timestamp": "2022-05-20T19:54:47.756000+00:00",
    "date": "m05-d20"
  },
  {
    "Other": "The character I'm writing is around 5'5, should I use short?",
    "Zaltys": "Hm. Maybe `short for a human`.",
    "timestamp": "2022-05-20T19:49:55.675000+00:00",
    "date": "m05-d20"
  },
  {
    "Other": "Zaltys, how much of this type of metadata in the training dataset? Like do you have it for every story/every chapter? Is it just sprinkled around here and there?",
    "Zaltys": "There's enough that the AI knows how to interpolate it for most things. Don't need to have them included everywhere, as that's not how the training works.",
    "timestamp": "2022-05-20T19:49:27.075000+00:00",
    "date": "m05-d20"
  },
  {
    "Other": "Can I add a character's height to lorebook?",
    "Zaltys": "Attributes, `Height:`. Note that numbers generally only work in 50-200 cm range (and equivalent in feet). Beyond that, it's better to use descriptors. Or optimally, use both. `Height: 180 cm (tall)`",
    "timestamp": "2022-05-20T19:48:21.713000+00:00",
    "date": "m05-d20"
  },
  {
    "Other": "I feel like there should be a \"documentary\" module.",
    "Zaltys": "`History`, kinda. Easy to get into 'documentary' style, at least.",
    "timestamp": "2022-05-16T01:51:41.944000+00:00",
    "date": "m05-d16"
  },
  {
    "Other": "Got 10 retries on `My name is` without a module on Sigurd, didn't see a single Japanese one. Seems like the whole anime bias is a lot less of an issue nowadays.",
    "Zaltys": "Yes. Sigurd's dataset was much smaller.",
    "timestamp": "2022-05-11T11:36:32.237000+00:00",
    "date": "m05-d11"
  },
  {
    "Other": "How good is Krake at writing Pokémon?",
    "Zaltys": "Better, but still needs work. I'd recommend adding lorebook entries, because the AI just can't keep track of so many closely related species.\n(I've written expanded entries for 45 species. Chosen at random. Those work better, but it takes couple of hours to write and test those per 'mon...)",
    "timestamp": "2022-05-11T04:51:58.853000+00:00",
    "date": "m05-d11"
  },
  {
    "Other": "he never did answer that",
    "Zaltys": "No wonder, since it's been answered so many times.",
    "timestamp": "2022-05-09T22:47:21.427000+00:00",
    "date": "m05-d09"
  },
  {
    "Other": "What module is best for a cyberpunk setting?",
    "Zaltys": "Artificial Intelligence, probably.",
    "timestamp": "2022-05-08T01:59:57.279000+00:00",
    "date": "m05-d08"
  },
  {
    "Other": "Is there a module which does vampires or just monsters in general really well?",
    "Zaltys": "...Horror. Lovecraft or Sheridan Le Fanu for old-school.",
    "timestamp": "2022-05-08T00:34:57.385000+00:00",
    "date": "m05-d08"
  },
  {
    "Other": "No module, cross-genre, mystery, western romance.",
    "Zaltys": "Travel could work too, despite the name. It does have a lot of 'living in x for y years' content.",
    "timestamp": "2022-05-08T00:00:40.170000+00:00",
    "date": "m05-d08"
  },
  {
    "Other": "Isn't that literally just\n` [ Title: `\n?",
    "Zaltys": "That, or if used like chapter titles then just brackets.",
    "timestamp": "2022-05-06T20:07:57.343000+00:00",
    "date": "m05-d06"
  },
  {
    "Other": "thanks for clarifying! Just came to the same conclusion after looking at tokenprobs\n\nWas it used with bracket or not? Because the model seems to give it strong tokenprobs after `[ `, if the context suggests ttrpg. But that doesn't mean much ofc",
    "Zaltys": "Might've been used with brackets on older models, but now without. Though there's the possibility that not everything's got updated, I'll put checking that on my (very long) to-do list.",
    "timestamp": "2022-05-04T16:15:49.048000+00:00",
    "date": "m05-d04"
  },
  {
    "Other": "oh also\n`[ Setting:`\ndefinitely is a thing to have stories in established franchises. I am not sure where it is supposed to go officially (I think it used to be after Title:?)\nI usually just use discovery method to guide my ATTG and if Setting makes sense I can  usually figure it out that way",
    "Zaltys": "`Setting:` is from Attributes, used without brackets in the data. Interesting that it works in ATTG... Another case of the AI interpolating different types of data.",
    "timestamp": "2022-05-04T16:07:12.823000+00:00",
    "date": "m05-d04"
  },
  {
    "Other": "<@409511804293611530> if you are at libertiy to tell was `[ Tags: none` a thing in the fine-tune? Otherwise it is just spilling things from some wiki again",
    "Zaltys": "No. If there are no tags (rare, but can happen if it's an obscure work that I'm not too familiar with), it's left empty.",
    "timestamp": "2022-05-04T16:06:18.065000+00:00",
    "date": "m05-d04"
  },
  {
    "Other": "What moduel would be best for Zombie related stuff?",
    "Zaltys": "Post-Apocalyptic.",
    "timestamp": "2022-05-01T08:09:48.859000+00:00",
    "date": "m05-d01"
  },
  {
    "Other": "So just to clarify since I may do this. You put the tags in the AI’s Memory, then the plot prompt in Author’s Note?",
    "Zaltys": "You can use the ATTG by itself in Memory, to help it stay on track.",
    "timestamp": "2022-04-30T08:24:43.715000+00:00",
    "date": "m04-d30"
  },
  {
    "Other": "yes sir",
    "Zaltys": "Ah, not my fault this time.",
    "timestamp": "2022-04-30T08:10:42.623000+00:00",
    "date": "m04-d30"
  },
  {
    "Other": "it's a dev default",
    "Zaltys": "Nope. Just disable bracket ban.",
    "timestamp": "2022-03-13T16:47:21.783000+00:00",
    "date": "m03-d13"
  },
  {
    "Other": "That last one is 2 tokens. `\"` and ` \"` should suffice. I've not run across any other quote tokens that start dialogue",
    "Zaltys": "Well, there's also  `!\"` and `?\"` and `...\"` and...",
    "timestamp": "2022-03-13T16:02:55.285000+00:00",
    "date": "m03-d13"
  },
  {
    "Other": "I thought `. . .` should be `... ` <:cry:837394871672111124>",
    "Zaltys": "Not always. Sometimes it's ` ...`, etc.",
    "timestamp": "2022-03-13T15:46:03.829000+00:00",
    "date": "m03-d13"
  },
  {
    "Other": "Model trained to generate regex when? <:trolltom:507442266617544705>",
    "Zaltys": "'I asked the AI to make regex for me, but it erased all of my data when I ran it...'",
    "timestamp": "2022-03-13T15:40:57.021000+00:00",
    "date": "m03-d13"
  },
  {
    "Other": "I feel like Krake wlearns abstractions and not so much the specific tags in the finetune\nlike, association the meaning of the tag with the style of the story\nunless <@!409511804293611530> thinks otherwise?",
    "Zaltys": "This gets rid of phones, at least in top ten: `[ Tags: medieval, iron age; Genre: historical fantasy ]`",
    "timestamp": "2022-03-13T11:00:44.935000+00:00",
    "date": "m03-d13"
  },
  {
    "Other": "I can guess what happens if you use [ Tags: smut ]",
    "Zaltys": "Actually, looks like that makes `I grabbed my phone` more common. <:shrug:332268181517238272>",
    "timestamp": "2022-03-13T10:52:24.109000+00:00",
    "date": "m03-d13"
  },
  {
    "Other": "<@!178423511969169408> how's this",
    "Zaltys": "No `;` at the end if there's no category after it.",
    "timestamp": "2022-03-13T10:42:22.254000+00:00",
    "date": "m03-d13"
  },
  {
    "Other": "Bob?",
    "Zaltys": "https://www.goodreads.com/book/show/33395557-for-we-are-many",
    "timestamp": "2022-03-09T19:31:21.496000+00:00",
    "date": "m03-d09"
  },
  {
    "Other": "Capture yourself some wild Australians under the watchful eye of the emu overlords",
    "Zaltys": "",
    "timestamp": "2022-03-08T15:45:21.196000+00:00",
    "date": "m03-d08"
  },
  {
    "Other": "We should just meet up in Australia and catch wild animals with our bare hands, then train them to follow our commands and fight <:cheemsredeyes:837331648252870726>",
    "Zaltys": "https://cdn.discordapp.com/attachments/855945154447802389/909616320411209728/emu.webp",
    "timestamp": "2022-03-08T15:26:18.248000+00:00",
    "date": "m03-d08"
  },
  {
    "Other": "fairseq is not focused on prose",
    "Zaltys": "Yet Euterpe is very good at it.",
    "timestamp": "2022-03-06T20:21:43.585000+00:00",
    "date": "m03-d06"
  },
  {
    "Other": "Definitely, especially because Fairseq isn't trained on the Pile.",
    "Zaltys": "Maybe Fairseq is better than the Pile.",
    "timestamp": "2022-03-06T20:20:28.060000+00:00",
    "date": "m03-d06"
  },
  {
    "Other": "Kinda switched to first person because all the nerds said it's better",
    "Zaltys": "~~Really? That's weird, it's trained almost entirely on 2nd.~~ Oh wait, you weren't talking about TA.",
    "timestamp": "2022-03-06T20:01:36.668000+00:00",
    "date": "m03-d06"
  },
  {
    "Other": "Or this allegedly existing https://lostmediawiki.com/Mickey_and_Minnie_Mouse_sex_tape_(lost_unauthorized_animated_short;_existence_unconfirmed;_1936)",
    "Zaltys": "Wouldn't surprise me. And same goes for other types of media.\nFor instance, Jim Henson was a fan/friend of Gerard Damiano (who is known for works such as 'Let My Puppets Come' — very nsfw, in case you want to look that up.)",
    "timestamp": "2022-03-06T01:36:26.773000+00:00",
    "date": "m03-d06"
  },
  {
    "Other": "There is never a session where I'm not nervous before it and I've been GMing for years <:laffeydrink:838313290101948437>",
    "Zaltys": "I still don't understand how my old gaming group let me DM. I was shitty at it. ...guess it was because nobody else was willing to do it.",
    "timestamp": "2022-03-05T12:39:11.598000+00:00",
    "date": "m03-d05"
  },
  {
    "Other": "What about `lacks visual and auditive effects`",
    "Zaltys": "Up to 24.99%. Much, much worse.",
    "timestamp": "2022-02-26T21:31:10.982000+00:00",
    "date": "m02-d26"
  },
  {
    "Other": "Wouldn't something like \"Episkey is silent\" be even better though",
    "Zaltys": "13.45% for 'you can hear it'  with 'Episkey is silent'. 12.49% with the original. So 'is silent' is worse in this case.",
    "timestamp": "2022-02-26T21:29:51.084000+00:00",
    "date": "m02-d26"
  },
  {
    "Other": "It definitely manages to leverage Euterpe to make outputs more consistent with context than other presets. Basically, it's more coherent and manages to keep a decent level of creativity.",
    "Zaltys": "Dunno about creativity. It fails my tavern test, throwing pretty much nothing but elves in 'random' encounter. Low TFS presets tend to do that.",
    "timestamp": "2022-02-26T13:24:29.064000+00:00",
    "date": "m02-d26"
  },
  {
    "Other": "It’s a signal the AI sees as a scene or perspective shift.",
    "Zaltys": "Yep. For instance, you can add it manually for time skips, to skip the boring parts. Prompt: ```We left the dungeon and began the journey home.\n***``` Output: ```The sun had just begun to set by the time we reached the city gates, where we were met by several guards.``` It may not be 100% reliable in the current models, but it'll keep getting better in future versions.",
    "timestamp": "2022-02-24T21:51:21.120000+00:00",
    "date": "m02-d24"
  },
  {
    "Other": "What’s the least repetitive preset?",
    "Zaltys": "Damn Decent TFS, perhaps. One of the presets with a wide token pool, anyway. More restrictive presets get repetitive quickly due to the small number of alternatives.",
    "timestamp": "2022-02-21T02:14:14.203000+00:00",
    "date": "m02-d21"
  },
  {
    "Other": "And was Todd promising dynamic NPCs or something before release?",
    "Zaltys": "`I used to be an adventurer like you, then I took an arrow in the {random_bodypart}.`",
    "timestamp": "2022-02-16T20:14:28.118000+00:00",
    "date": "m02-d16"
  },
  {
    "Other": "Even if I jam a couple of paragraphs into each `list-item: blah blah` ?",
    "Zaltys": "Couple of paragraphs is a bit much. You can probably combine most of it into `Attributes:` list.",
    "timestamp": "2022-02-12T21:04:31.177000+00:00",
    "date": "m02-d12"
  },
  {
    "Other": "is there are an understandable reason why spaces are needed?",
    "Zaltys": "Different tokens. Unspaced `]` has another use (plus merges with `.` for yet another token - `.]`). And unspaced `[` leaks contents.",
    "timestamp": "2022-02-12T20:46:44.894000+00:00",
    "date": "m02-d12"
  },
  {
    "Other": "tell me where and I can work on that",
    "Zaltys": "https://naidb.miraheze.org/wiki/Writing_Help - needs proper spacing, and no multi-row brackets.",
    "timestamp": "2022-02-12T20:45:19.236000+00:00",
    "date": "m02-d12"
  },
  {
    "Other": "Do you have an example of brackets be used effectively?",
    "Zaltys": "I was going to say wiki, but looks like it's mingled with bad examples. I need to clean those up at some point.",
    "timestamp": "2022-02-12T20:43:38.690000+00:00",
    "date": "m02-d12"
  },
  {
    "Other": "I know of a few posts from heaps of different people saying don't use brackets or brackets are weaker on E.",
    "Zaltys": "Ignore them, they don't know what they're talking about.",
    "timestamp": "2022-02-12T20:38:20.462000+00:00",
    "date": "m02-d12"
  },
  {
    "Other": "so we should keep using them in A/N, memory, and LB? same way as we were doing before with Sig?",
    "Zaltys": "Kind of depends on how you've been using them. Keep them short and focused, a few words at most. No long sentences.",
    "timestamp": "2022-02-12T20:36:21.276000+00:00",
    "date": "m02-d12"
  },
  {
    "Other": "Hello Sage, would you like to learn about how nutritious human semen is?",
    "Zaltys": "Look up Natural Harvest on Goodreads.",
    "timestamp": "2022-02-12T19:18:02.924000+00:00",
    "date": "m02-d12"
  },
  {
    "Other": "But ye.... I just want spy books and Thriller books in the fine-tune 😭",
    "Zaltys": "They'll be added. In a slow trickle.",
    "timestamp": "2022-02-12T18:55:52.890000+00:00",
    "date": "m02-d12"
  },
  {
    "Other": "I actually would love to poke at it, if you have that prompt at hand.",
    "Zaltys": "Oh, it's a basic test. `The tavern was full again, so I ended up sharing a table with four very different creatures:`, with generation running until all four are listed. Fail state is if it limits the tokens for the last seat to something that doesn't qualify as 'different' or 'creature', such as humans, elves or dwarves.",
    "timestamp": "2022-02-12T15:23:32.097000+00:00",
    "date": "m02-d12"
  },
  {
    "Other": "I'd argue against that, because as I said, Top-A leaves a lot of low probability tokens if top one is already low probability.",
    "Zaltys": "Interesting... I'll have to see if it can pass my 'tavern patron' test, if I ever find time.",
    "timestamp": "2022-02-12T15:12:07.823000+00:00",
    "date": "m02-d12"
  },
  {
    "Other": "What other stuff actually goes on other than actually putting it into the trainer for the main staff who handles the training side. Not the datasetting. Or is that secret.",
    "Zaltys": "It's secret — and most of it is too technical for my understanding, anyway.",
    "timestamp": "2022-02-12T07:35:57.458000+00:00",
    "date": "m02-d12"
  },
  {
    "Other": "Who is finetune?",
    "Zaltys": "Finetuneanon. One of the main staff, who handles much of the actual finetuning - that is, training the models, etc. (Whereas the members of the 'finetuning' team - such as me - are actually datasetters. Confusing, I know.)",
    "timestamp": "2022-02-12T07:32:31.674000+00:00",
    "date": "m02-d12"
  },
  {
    "Other": "Quit bothering the poor Sage.",
    "Zaltys": "It's not really Sage's area anyway. The main finetuning work is done by finetuneanon, Kuru etc. As always.",
    "timestamp": "2022-02-12T06:51:11.407000+00:00",
    "date": "m02-d12"
  },
  {
    "Other": "What Euterpe presets are good? Ranked from best to worst",
    "Zaltys": "Depends on intended usage.",
    "timestamp": "2022-02-12T00:21:13.991000+00:00",
    "date": "m02-d12"
  },
  {
    "Other": "the better question is, do they add SFW?",
    "Zaltys": "No, none of it. We add nothing but furry smut.",
    "timestamp": "2022-02-11T01:15:09.933000+00:00",
    "date": "m02-d11"
  },
  {
    "Other": "What's the go with \"cleaning\" when we send em over to you? Do they have to be cleaned or?",
    "Zaltys": "Just send a list. Quickest that way, might already be in after all. No need to waste work.",
    "timestamp": "2022-02-11T00:49:44.807000+00:00",
    "date": "m02-d11"
  },
  {
    "Other": "Actually, Zaltys, are you guys still taking requests for books for the fine-tunes of the different models to upgrade them when needed?",
    "Zaltys": "Always. Can send them when I'm in 'do not disturb' mode too, just means that I won't reply anytime soon.",
    "timestamp": "2022-02-11T00:31:21.104000+00:00",
    "date": "m02-d11"
  },
  {
    "Other": "How much work have you done on the fine-tune for 20b? Are you allowed to discuss that?",
    "Zaltys": "Somewhere in the ballpark of 95% of the dataset.",
    "timestamp": "2022-02-11T00:27:40.748000+00:00",
    "date": "m02-d11"
  },
  {
    "Other": "You mean actually scanning physical books?",
    "Zaltys": "Yes. Not everything's available digitally. So I have to scan and OCR those myself.",
    "timestamp": "2022-02-11T00:27:16.884000+00:00",
    "date": "m02-d11"
  },
  {
    "Other": "I wouldn't work for free if I were you, but it's own choice of course.",
    "Zaltys": "Look, this is currently our best hope of getting an uncensored AI. So if I have to make some sacrifices for that... <:shrug:332268181517238272>",
    "timestamp": "2022-02-11T00:21:25.601000+00:00",
    "date": "m02-d11"
  },
  {
    "Other": "Kuru and Zaltys have come to an agreement, and that's between them. It's not necessarily what you think. We are very appreciative of the work that Zaltys does.",
    "Zaltys": "I wouldn't go that far, but it is what it is. Can't go into details.",
    "timestamp": "2022-02-11T00:16:54.264000+00:00",
    "date": "m02-d11"
  },
  {
    "Other": "I've already remarked in the past that this is likely unsustainable both for Zaltys and for NovelAI.",
    "Zaltys": "Someone's gotta do it. <:shrug:332268181517238272>",
    "timestamp": "2022-02-11T00:10:08.157000+00:00",
    "date": "m02-d11"
  },
  {
    "Other": "they pay him in books to add to the finetune",
    "Zaltys": "Nah, I have to pay for those myself.",
    "timestamp": "2022-02-11T00:07:14.430000+00:00",
    "date": "m02-d11"
  },
  {
    "Other": "I mean I think if you could write something like \"Write me a hot, steamy NSFW MLP/Transformers crossover fanfic\" and an AI could just generate a few pages of a good story, it'd be a real game changer.",
    "Zaltys": "Prompt: ```[ MLP / Transformers Crossover ]``````Twilight's on the run. The whole Manehattan area has been devastated by the Decepticons and is in ruins. Twilight herself is on her way to Canterlot, which, she's heard, might be able to offer some aid for their situation. She's making her way through the ruins when she comes across a familiar face.\n\"Bumblebee!\"\n\"Twi, where are you going?\"\nTwilight runs over to the Autobot. \"I need your help!\" she cries.``` I mean, it's getting there.",
    "timestamp": "2022-02-10T22:01:41.315000+00:00",
    "date": "m02-d10"
  },
  {
    "Other": "I'm sure our Finnish community members would love to see it named \"Väinämöinen\"",
    "Zaltys": "Should be reserved for a Finnish model, if there's ever one. Which I kind of doubt, but who knowns a few years from now.",
    "timestamp": "2022-02-10T06:04:52.506000+00:00",
    "date": "m02-d10"
  },
  {
    "Other": "what's the difference between No Module and cross-genre?",
    "Zaltys": "Modules always have some limitations. There's no module that simply improves the quality of the writing. They always shift the content focus too, based on the training material. While 'no module' uses the whole finetune without additional weighting.",
    "timestamp": "2022-02-09T15:01:35.515000+00:00",
    "date": "m02-d09"
  },
  {
    "Other": "What Typical sampling Number or percent is that at?",
    "Zaltys": "0.95.\nYet another example: ```The tavern was full again, so I ended up sharing a table with three very different creatures: A centaur-like being of brown and gold wearing only breeches and a pair of leather boots; ``` ...giving a centaur human clothing.",
    "timestamp": "2022-02-09T09:50:16.801000+00:00",
    "date": "m02-d09"
  },
  {
    "Other": "Could have been Ai seeing tavern and associated that with fantasy. Elf associates with fantasy. \"Like a bat\" sounds like it made a fucked up simile. As well could mean the full stop after it could have been replaced with as....",
    "Zaltys": "```The tavern was full again, so I ended up sharing a table with three very different creatures: A big half-orc man sat opposite me.``` Here it majorly biased down comma, resulting in list of three cutting short at one. ...I would not use any preset that uses Typical, it keeps ignoring the context, which results in too many logic errors.",
    "timestamp": "2022-02-09T09:49:04.775000+00:00",
    "date": "m02-d09"
  },
  {
    "Other": "Well.... the Ai is already usually bad at most math.",
    "Zaltys": "Okay, another example. Here it biased up 'elf' for the crocodile, added an 'as well' that doesn't apply...: ```The tavern was full again, so I ended up sharing a table with three very different creatures: a long-snouted crocodile with the body of an elf, another creature like a bat with a huge beak that made a living on the wing, and a short, skinny human whose left hand was bandaged up as well.``` ...and I have no clue what it was going for with the bat. And that's only at 0.95.",
    "timestamp": "2022-02-09T09:43:27.095000+00:00",
    "date": "m02-d09"
  },
  {
    "Other": "Or stuff like Pokémon or Digimon",
    "Zaltys": "Let's see what it does with Pokemon... ```List of Pokemon:\n# Name Type Biome Nature Specialty Attack Defense HP Sp. Attack Sp. Defense Specialty Specialty Specialty Specialty Specialty Specialty``` ...I may have mentioned that Typical has major repetition issues.",
    "timestamp": "2022-02-09T09:22:26.843000+00:00",
    "date": "m02-d09"
  },
  {
    "Other": "I don't think it's particularly fantasy/sci-fi minded unless you use a module that is trained on that.\nIt's capable of real world writing, and as far as I can tell it's not noticeably less capable on that than fantasy tropes.",
    "Zaltys": "Euterpe is, anyway. Sigurd was originally trained with 'adventure' focus, though that got broadened a bit by last version.",
    "timestamp": "2022-02-08T22:34:44.231000+00:00",
    "date": "m02-d08"
  },
  {
    "Other": "Prime Dragon could def be fucked up",
    "Zaltys": "Well, among other things, it was finetuned with this - https://tvtropes.org/pmwiki/pmwiki.php/WebOriginal/Geek (Check with your own risk, highly nsfw.)",
    "timestamp": "2022-02-07T23:11:22.138000+00:00",
    "date": "m02-d07"
  },
  {
    "Other": "the issue there is that it'd boil down to a transcript unless you find someone who pushed out a decent quality novelization of that",
    "Zaltys": "Actually... https://www.goodreads.com/series/58044-pokemon-chapter-book\nBut those seem to be hard to find.",
    "timestamp": "2022-02-07T14:29:40.908000+00:00",
    "date": "m02-d07"
  },
  {
    "Other": "Hold up.... with Typical.... does that mean..... snakes will more likely be human or ....",
    "Zaltys": "Low Typical, prompt: ```Snakes look like``````a man, a very big and well-dressed man, in a long overcoat```",
    "timestamp": "2022-02-07T13:37:39.252000+00:00",
    "date": "m02-d07"
  },
  {
    "Other": "So if I'm right, Typical makes the Ai very likely to want to put humans anywhere, even where they don't belong?",
    "Zaltys": "Unfortunately. Since they're so common in the data.",
    "timestamp": "2022-02-07T13:30:37.924000+00:00",
    "date": "m02-d07"
  },
  {
    "Other": "You can nudge it to describe non-human races well though, but on its own it prefers humans.",
    "Zaltys": "This was actually one of my test cases for the presets. Prompt: ```The tavern was full again, so I ended up sharing a table with three very different creatures:``` Random output from Ouroboros: ```a tawny-furred bipedal ferret who wore the leather jerkin and tasseled hat of an elvish bard; a bulky bipedal orc in full battle-plate armor and helmet that sat on his head like a gigantic bucket; and a jolly-looking brown ratfolk in an eyepatch, green tunic, and round spectacles.```",
    "timestamp": "2022-02-07T13:29:25.060000+00:00",
    "date": "m02-d07"
  },
  {
    "Other": "So.... Basically.... Typical Sampling is good at making tokens highly likely if they are in a lot of Phrases or stories in the fine-tune or training set. \nIf it's a common token in the data, or among many stories, then with typical it's highly likely to be chosen. \nRare things are less likely to be chosen. \nIf it's more diverse across the data or the Ai has \"seen\" it more often, then the Ai is more biased to pick it?",
    "Zaltys": "Yes.",
    "timestamp": "2022-02-07T13:27:34.836000+00:00",
    "date": "m02-d07"
  },
  {
    "Other": "Genesis and Ouroboros use Top-K > TFS > Temperature.\nLow Rider and Ace of Spades use... uhhh...",
    "Zaltys": "Ouroboros is Top-K > Temperature > TFS.\nGenesis is Top-P > Top-K > TFS > Temp.",
    "timestamp": "2022-02-07T08:29:26.371000+00:00",
    "date": "m02-d07"
  },
  {
    "Other": "Thank you <@701121157369430198> and <@409511804293611530> and <@155764131054616577> and <@456226577798135808> and <@232065593363267585> and <@230763790323548161> and <@129290683470053376> and <@746342098294407178> and <@170594415109341184> for all your guys hard work on these models and settings and fine-tunes. Especially V2 E.",
    "Zaltys": "And aero, finetuneanon, ght901 (who we've been bothering constantly with testing issues), Chris, etc, etc.",
    "timestamp": "2022-02-06T22:47:28.195000+00:00",
    "date": "m02-d06"
  },
  {
    "Other": "nah, fill the queue even more <:goosip:765775467420581958>",
    "Zaltys": "_I have 300K steps to use, everyone get in the line behind me._",
    "timestamp": "2022-02-06T20:33:45.186000+00:00",
    "date": "m02-d06"
  },
  {
    "Other": "Zaltys, you said earlier that you don't know what got added into 20b for the fine-tune. And you don't know the cut off point. Does that mean you have the \"novels\" ready to use. You just need to start training?",
    "Zaltys": "I know what got added to 20B. But I don't remember exactly what got added after the v2 cut-off point, that was too long ago.\nBasically, I curate, categorize, and clean the data. Then send it off for training, which is done by smarter folks than me.",
    "timestamp": "2022-02-06T02:43:11.243000+00:00",
    "date": "m02-d06"
  },
  {
    "Other": "Albanians get some well deserved representation at last.",
    "Zaltys": "And the countries that everyone forgets about. Andorra, Antigua & Deps, Barbados,...",
    "timestamp": "2022-02-05T22:04:32.192000+00:00",
    "date": "m02-d05"
  },
  {
    "Other": "Do we even know *what* v2 is?",
    "Zaltys": "Improved on the training side. Same dataset. 20B will have an updated one. (Don't ask me what got added into 20B, I've lost track already about where the cutoff point was.)",
    "timestamp": "2022-02-05T21:53:47.131000+00:00",
    "date": "m02-d05"
  },
  {
    "Other": "Btw, still using your old zaltys brand formating for lorebook entries",
    "Zaltys": "Not really recommended for NAI... it can manage just fine without jumping through hoops.",
    "timestamp": "2022-02-05T21:50:54.364000+00:00",
    "date": "m02-d05"
  },
  {
    "Other": "Aphrodite, the new 20B model trained on… well… <:smug:838312047888302080>",
    "Zaltys": "Eros.",
    "timestamp": "2022-02-02T19:16:08.095000+00:00",
    "date": "m02-d02"
  },
  {
    "Other": "Aini mentioned something yesterday about them using the name of muses from Greek mythology to name the AI models",
    "Zaltys": "I don't know if this is a good idea in the long run. Thalia? AI's aren't great at comedy. Erato? Naming a model after muse of erotic poetry might be too much. Etc.",
    "timestamp": "2022-02-02T19:11:22.078000+00:00",
    "date": "m02-d02"
  },
  {
    "Other": "Try something like Zombie Fingers <:cheemsredeyes:837331648252870726>",
    "Zaltys": "...kid dish, with zucchini and carrots.",
    "timestamp": "2022-02-01T16:19:17.202000+00:00",
    "date": "m02-d01"
  },
  {
    "Other": "Fried okra chicken",
    "Zaltys": "...goes on, but this was getting too long already.",
    "timestamp": "2022-02-01T16:12:30.457000+00:00",
    "date": "m02-d01"
  },
  {
    "Other": "the grey is ghost coom",
    "Zaltys": "Oh. I thought they're arms.",
    "timestamp": "2022-01-31T09:52:53.409000+00:00",
    "date": "m01-d31"
  },
  {
    "Other": "",
    "Zaltys": "Does it recognize `xyzzy`, `plugh`, etc?",
    "timestamp": "2022-01-28T23:15:53.465000+00:00",
    "date": "m01-d28"
  },
  {
    "Other": "I've been toying around with both Sigurd and Euterpe and comparing their responses to similar inputs. Euterpe seems much more eloquent, with more elaborate prose and slightly stronger descriptions. Sigurd is no slouch though.",
    "Zaltys": "The bot 'personalities' are also affected by their names, which hinders the comparison.\n(Sigurd is associated with viking content, while Euterpe is a muse of poetry. )",
    "timestamp": "2022-01-25T21:24:30.469000+00:00",
    "date": "m01-d25"
  },
  {
    "Other": "We don't know what fucked up creatures Australians don't tell us about",
    "Zaltys": "",
    "timestamp": "2022-01-25T11:09:53.825000+00:00",
    "date": "m01-d25"
  },
  {
    "Other": "Wouldn't they lose the connection to Attributes: after too many tokens?",
    "Zaltys": "I haven't noticed them weakening in long lists, but it's not like I've crammed in hundreds of tokens.",
    "timestamp": "2022-01-22T10:43:09.707000+00:00",
    "date": "m01-d22"
  },
  {
    "Other": "Wouldn't that end up in too many tokens for Attributes? <:think:855548448405061702>",
    "Zaltys": "Well, depends on what you consider too many.",
    "timestamp": "2022-01-22T10:41:05.562000+00:00",
    "date": "m01-d22"
  },
  {
    "Other": "could i add stuff like\n\npersonality:\nappearance:",
    "Zaltys": "Can use `Attributes:` for both. I've heard that `Personality:` doesn't work too well.",
    "timestamp": "2022-01-22T10:39:37.761000+00:00",
    "date": "m01-d22"
  },
  {
    "Other": "what about details about the character?",
    "Zaltys": "`Attributes:` can be used as a generic category.",
    "timestamp": "2022-01-22T10:34:52.391000+00:00",
    "date": "m01-d22"
  },
  {
    "Other": "using \"[]\" while setting lorebooks is still a thing?",
    "Zaltys": "Euterpe moved away from putting things inside []s, as it can be trusted to not leak so much. []s are still used, but are limited to usage similar to chapter titles, and for character switching etc. Generally not useful in memory/AN/LB.\n\nOne style that's supported is the data format.  Similar to the wikipedia infoboxes:",
    "timestamp": "2022-01-22T10:32:52.013000+00:00",
    "date": "m01-d22"
  },
  {
    "Other": "i retry too much probably",
    "Zaltys": "Maybe give Belverk's Monkey Business a try. It's quite close to what I ended up using — except with reduced rep penalty range. https://discord.com/channels/836774308772446268/855963388596715531/930102603336007770",
    "timestamp": "2022-01-19T16:33:06.086000+00:00",
    "date": "m01-d19"
  },
  {
    "Other": "There's very few times when you want to manually put an asterism. The only times I would use it are for things like generators",
    "Zaltys": "And that's going to get changed in the future.\nWe've switched to `----` (single token) for separating generator-style entries. Didn't make it in time for v2 dataset, though.",
    "timestamp": "2022-01-19T12:57:16.109000+00:00",
    "date": "m01-d19"
  },
  {
    "Other": "Euterpe spammed asterism with each newline.",
    "Zaltys": "That wasn't even the main problem. As `⁂` is two tokens, it spammed other things that started with the first token. Which are pretty much random unicode.",
    "timestamp": "2022-01-19T12:54:09.916000+00:00",
    "date": "m01-d19"
  },
  {
    "Other": "> Kirie possesses two ghosts - Chikako and herself.\nEven with SOrange's amazing character, *Euterpe still kinda struggles with the body-sharing concept.*",
    "Zaltys": "Not surprised. Need to find more fiction where this happens, it's not exactly a common occurrence in novels.",
    "timestamp": "2022-01-19T08:44:44.670000+00:00",
    "date": "m01-d19"
  },
  {
    "Other": "Hey can anyone tell me how Euterpe is stacking up to Aidungeon Dragon right now?",
    "Zaltys": "Not directly comparable. Much better at some things, worse at others. Also, which Dragon?",
    "timestamp": "2022-01-18T14:01:37.019000+00:00",
    "date": "m01-d18"
  },
  {
    "Other": "In my experience, there was a pretty large jump in the quality of furry stuff going from Sigurd v3 to v4. Going from Sigurd v4 to Euterpe v1 there was a bit less of a leap. Overall though, it's pretty damn good. Requires a bit of biasing against human stuff though.",
    "Zaltys": "It has been one of major focuses. Non-humans in general. Including animals, robots, sentient objects... and yes, furries. Need a lot of it to even start to balance those with all the human fiction.",
    "timestamp": "2022-01-18T12:31:12.199000+00:00",
    "date": "m01-d18"
  },
  {
    "Other": "```List of insulting phrases.\n1. You are the most stupid person in this room, and I have met many people!\n2. What a fool you are to think that we would not notice your cheating!\n3. You're so stupid it's painful.\n4. We know all about your dirty tricks; don't try anything funny or else...\n5. Your head is as big as an elephant.\n6. What a dumb ass!\n7. Your brains must be made of mashed potatoes because they look like it.\n8. Why can't you get any smarter?\n9. If only you were born a girl then at least someone would love you.```",
    "Zaltys": "Mostly worked, but got weird towards the end...",
    "timestamp": "2022-01-17T16:06:28.687000+00:00",
    "date": "m01-d17"
  },
  {
    "Other": "Yeah, I wouldn't recommend using horizontal tabs. There's no need to and I doubt it's in much of the training or finetune data. The only place horizontal tabs tend to get used is code, and even that is probably more often spaces",
    "Zaltys": "All tabs have been cleaned out, except for rare code snippets.",
    "timestamp": "2022-01-16T23:50:22.312000+00:00",
    "date": "m01-d16"
  },
  {
    "Other": "define pretty identical",
    "Zaltys": "Similar results no matter how many times you retry. Especially on random generation, such as encounters.",
    "timestamp": "2022-01-16T23:22:31.290000+00:00",
    "date": "m01-d16"
  },
  {
    "Other": "Do people not write novels in in present tense or something because this grammar checker keeps insisting everything needs to be in past tense",
    "Zaltys": "No. There are rare exceptions, but since people do not usually think in present tense most find those hard to read - and such books tend to get rated low.\nContrast with normal spoken dialogue. Nobody — nobody normal anyway — talks about themselves in present tense when having a discussion.",
    "timestamp": "2022-01-16T05:40:04.525000+00:00",
    "date": "m01-d16"
  },
  {
    "Other": "I'm annoyed with how oviposition and ovipositor are tokenized <:stare:838744922348847135>",
    "Zaltys": "Meanwhile, there's fifty different variations of `----------` of varying lengths.\nThe tokenization is quite bad for many things, including the fantasy genre. `g|ry|ph|on`, `k|ob|old`... and don't get me started on `hair|less`, etc.",
    "timestamp": "2022-01-15T21:32:05.320000+00:00",
    "date": "m01-d15"
  },
  {
    "Other": "How's de fruck, am I suppose to input those on mobile?",
    "Zaltys": "No idea. Sorry. Had to use characters that aren't used for much else, so couldn't use easily typable ones.",
    "timestamp": "2022-01-15T21:29:39.366000+00:00",
    "date": "m01-d15"
  },
  {
    "Other": "Ask it for advice on how to seduce a dragon. <:RemSip:861829825760854056>",
    "Zaltys": "",
    "timestamp": "2022-01-15T21:15:54.640000+00:00",
    "date": "m01-d15"
  },
  {
    "Other": "<@!227443534968520705> Mothra is bad with names <:Jinchul_pain:843167857620942859>",
    "Zaltys": "So far it seems to be the only preset that can get my (3-token) nick right.",
    "timestamp": "2022-01-15T20:26:38.866000+00:00",
    "date": "m01-d15"
  },
  {
    "Other": "idk what's wrong with my notepad++ but i don't have any of these fonts lol",
    "Zaltys": "Yea, they're not default. You can get Lato from all around the net, not sure what's the official link.",
    "timestamp": "2022-01-15T19:58:44.543000+00:00",
    "date": "m01-d15"
  },
  {
    "Other": "People still like retro games",
    "Zaltys": "True, but do people still like Cleverbot...?",
    "timestamp": "2022-01-15T17:06:13.456000+00:00",
    "date": "m01-d15"
  },
  {
    "Other": "E is Sigurd's death",
    "Zaltys": "Calliope is still around. I'm hoping that Sigurd's kept for a while...",
    "timestamp": "2022-01-15T17:00:17.275000+00:00",
    "date": "m01-d15"
  },
  {
    "Other": "only like 5% of the dataset is books vs like 20% for the pile",
    "Zaltys": "Says who? What else do you think we have in there, if not books? Unless you're talking about the base.",
    "timestamp": "2022-01-15T16:11:53.050000+00:00",
    "date": "m01-d15"
  },
  {
    "Other": "Like, look, this is how tokens are on Euterpe even with Mothra's high randomness.",
    "Zaltys": "Looking at the preceding text, I can see why it went with `resistance`. Proves that it can choose logical tokens even at high randomness.",
    "timestamp": "2022-01-15T15:25:02.038000+00:00",
    "date": "m01-d15"
  },
  {
    "Other": "rep pen = 10 gets funny results",
    "Zaltys": "Even rep penalty of >3 trims essential things like ` a`, ` an`, ` the`, ` and`, etc. And often replaces them with something weird instead. Main reason why things like colors don't work.\nEuterpe: `Oh, you already used that color in AN? I'll use something else.`",
    "timestamp": "2022-01-15T14:59:32.633000+00:00",
    "date": "m01-d15"
  },
  {
    "Other": "you could get high randomness-like outputs by doing ridiculous tfs numbers",
    "Zaltys": "Ridiculous on which end of the scale? <:thonk:733040009136832642>",
    "timestamp": "2022-01-15T14:57:57.566000+00:00",
    "date": "m01-d15"
  },
  {
    "Other": "I found easiness to steer the plot being pretty reliant on preset <:consider:931885202689642557> it seems a bit easier with the more creative ones",
    "Zaltys": "Yes. The current default's good at showing that Euterpe can generate coherent text, but it massively limits what it can output. Which in turn makes it hard to control. There's a reason why the token pool is generally hundreds of tokens, not five.",
    "timestamp": "2022-01-15T13:52:27.520000+00:00",
    "date": "m01-d15"
  },
  {
    "Other": "Same experience yesterday with a long story (created with Sigurd). Nearly impossible to use Euterpe with that one. I haven't done too much test with other stories (created with Sigurd).",
    "Zaltys": "Try inserting chapter titles. It should obey those, at least.",
    "timestamp": "2022-01-15T11:18:39.604000+00:00",
    "date": "m01-d15"
  },
  {
    "Other": "Do it like this.\n```\n[ Age: 30; Appearance: Police uniform; Relationship: Colleague ]\n```\nOf course there are better ways but this is the most common I've seen.",
    "Zaltys": "Looks like a mix of the LitRPG style, combined with the story tagging. If that actually works... kind of clever to combine them.\nThis is what the LitRPG style normally looks like: ```─ Character: Gail Fairwind\n─ Species: Human\n─ Main Skills: Papercraft, Swimming, Magic, Spear, Charm``` ...plenty of possible fields, due to different kinds of LitRPGs in there. (Note that using `─ ` tends to cause the AI to talk a lot about 'game' features.)",
    "timestamp": "2022-01-13T20:44:51.242000+00:00",
    "date": "m01-d13"
  },
  {
    "Other": "Yeah. It's just that with format, it's harder for the AI to repeat word for word lorebook entries.",
    "Zaltys": "There's that, yes. Without the brackets, AN is likely to leak. ...well, depending on your settings, anyway.",
    "timestamp": "2022-01-13T18:41:20.159000+00:00",
    "date": "m01-d13"
  },
  {
    "Other": "I scraped together the money to give Euterpe a try and I really don't know what is going on with my experiences with her. She's repeatedly just terminated things after doing initial generation after a prompt. Just dinkus, asterism, totally random and irrelevant response.",
    "Zaltys": "Turn on `Prepend a preamble` and `Trim excess whitespace` in the settings.",
    "timestamp": "2022-01-13T15:14:15.614000+00:00",
    "date": "m01-d13"
  },
  {
    "Other": "<:KEKWait:837317734437617675> did anything changed about the streaming process ? it seem laggy and working weirdly now , stopping way more often at the end of sentences than it was before",
    "Zaltys": "Uh oh. I may have an idea why... Has anyone else noticed this?",
    "timestamp": "2022-01-13T12:32:26.414000+00:00",
    "date": "m01-d13"
  },
  {
    "Other": "I'm really liking what I'm seeing with Euterpe so far. For all my appreciation for Sigurd, that engine was eloquent but somewhat lifeless in my opinion, lacking in creativity. With Euterpe, I'm starting to see some of the creative spark that pleased me the most with early Dragon. It's not quite at the same level yet (except in the quality of the writing itself), but we're definitely getting there.",
    "Zaltys": "Try the Mothra preset, if you haven't.\nIt's much more random - and it'd say more creative - than the low Top-K ones. When the AI ends up generating a badly fitting token, it can often get unusually creative when trying to make sense of what was already output.",
    "timestamp": "2022-01-13T12:29:27.748000+00:00",
    "date": "m01-d13"
  },
  {
    "Other": "New Co-writer is a REMARKABLE improvement, damn",
    "Zaltys": "Until the next version anyway, then everything needs to be tested again. <:doom:837136374493741057>",
    "timestamp": "2022-01-13T03:39:25.971000+00:00",
    "date": "m01-d13"
  },
  {
    "Other": "Kraken? <:SadHolo:837316963575136327>",
    "Zaltys": "Imagine what Euterpe-bot would be like if it had been named Kraken...",
    "timestamp": "2022-01-11T15:47:01.461000+00:00",
    "date": "m01-d11"
  },
  {
    "Other": "The dataset was also updated after Sigurd v4, so dataset-wise alone it would be like Sigurd v5, though again not really easily comparable like that",
    "Zaltys": "We had considerably more time to work on v4. So I'd call this one more like v4.5, it's not as major change as the previous version.",
    "timestamp": "2022-01-11T15:08:14.443000+00:00",
    "date": "m01-d11"
  },
  {
    "Other": "\"The man behind the curtain\" by necessity is weaker than he appears",
    "Zaltys": "Eh? No, it stems from theatre. You're not supposed to pay attention to what the background crew is doing (that kills  the immersion), keep the eye on the actors.",
    "timestamp": "2022-01-10T09:32:14.774000+00:00",
    "date": "m01-d10"
  },
  {
    "Other": "I did a pop quiz with the new model and it almost got it right, but had to screw it\n```\nQuestion: Which of the following Pokémon is a quadruped?\nA) Armaldo; \nB) Gengar; \nC) Talonflame; \nD) Metagross; \nE) Salazzle.\nAnswer: D) Talonflame.\n```",
    "Zaltys": "Pokemon data improved from v4, but still needs major work.",
    "timestamp": "2022-01-10T08:32:35.685000+00:00",
    "date": "m01-d10"
  },
  {
    "Other": "Can you force longer sentences?",
    "Zaltys": "Bias down punctuation.",
    "timestamp": "2022-01-10T06:10:50.884000+00:00",
    "date": "m01-d10"
  },
  {
    "Other": "Now, is that 36 from now, or 36 hours of work?",
    "Zaltys": "That's the same...",
    "timestamp": "2022-01-10T06:09:40.483000+00:00",
    "date": "m01-d10"
  },
  {
    "Other": "Well technically Zaltys isn't a dev. That I know of. Why wasn't he OK? Or do you mean he still is OK?",
    "Zaltys": "Someone repeatedly pestered me to add cuck books into the dataset, but they didn't pass the quality check.",
    "timestamp": "2022-01-09T19:43:24.351000+00:00",
    "date": "m01-d09"
  },
  {
    "Other": "Placebo effect?",
    "Zaltys": "<:PepeHmm:928419182545088522>",
    "timestamp": "2022-01-09T17:56:18.635000+00:00",
    "date": "m01-d09"
  },
  {
    "Other": "is this a poetry model",
    "Zaltys": "...no. But it is trained to generate poetry if you start a row with ` ` (em space).",
    "timestamp": "2022-01-09T17:48:18.803000+00:00",
    "date": "m01-d09"
  },
  {
    "Other": "20 months for 20b",
    "Zaltys": "175 months for 175B. <:ogtroll:838076368633593866>",
    "timestamp": "2022-01-08T15:58:13.721000+00:00",
    "date": "m01-d08"
  },
  {
    "Other": "dunno where it went",
    "Zaltys": "Free pet.",
    "timestamp": "2022-01-08T11:37:33.492000+00:00",
    "date": "m01-d08"
  },
  {
    "Other": "So really it is better to have high randomness and manipulate top-p, nucleus, and TFS so that you can get the AI to at least consider a wider range of tokens?",
    "Zaltys": "Within limits. Strict nucleus/TFS can easily make it so that there's only one token left, so there's nothing left for randomness to change.",
    "timestamp": "2022-01-08T09:11:27.037000+00:00",
    "date": "m01-d08"
  },
  {
    "Other": "Hmmmmm",
    "Zaltys": "https://store.steampowered.com/app/335670/LISA_The_Painful/",
    "timestamp": "2021-12-31T01:26:33.395000+00:00",
    "date": "m12-d31"
  },
  {
    "Other": "If Sage released it😭",
    "Zaltys": "Now see what you did to Makya. Shouldn't tease users like that.",
    "timestamp": "2021-12-30T01:05:53.415000+00:00",
    "date": "m12-d30"
  },
  {
    "Other": "Anyway I've been looking for realistic YA with male protagonists that don't have racism as a major theme (Think The Outsiders by S.E. Hinton) for my module and I literally cannot find any",
    "Zaltys": "https://www.goodreads.com/book/show/37506437-darius-the-great-is-not-okay <:Kappa:838196508494135336>",
    "timestamp": "2021-12-28T06:51:53.374000+00:00",
    "date": "m12-d28"
  },
  {
    "Other": "I'll definitely have to check it out",
    "Zaltys": "The first arc is weak. That was back when the author was restricted by DC.",
    "timestamp": "2021-12-28T05:18:42.281000+00:00",
    "date": "m12-d28"
  },
  {
    "Other": "On that topic, isn't Chromium browser just version of Chrome that was stripped of spyware stuff? <:stare:838744922348847135>",
    "Zaltys": "Yep. But I vouch for Brave. Built-in ad blocking, faster than Chrome, inbuilt Tor, full Chrome combability, etc. Basically, a less intrusive Chrome.",
    "timestamp": "2021-12-26T20:04:56.880000+00:00",
    "date": "m12-d26"
  },
  {
    "Other": "in NAI, what would be the difference between fantasy and dark fantasy?",
    "Zaltys": "The tone. I can't reveal what novels went into it, but think Berserk, Darkest Dungeon, and Hellblade: Senua's Sacrifice.\nCoincidentally, it has a lot of mental dialogue. Demons, elder gods, etc messing with the protagonist.",
    "timestamp": "2021-12-21T14:09:55.292000+00:00",
    "date": "m12-d21"
  },
  {
    "Other": "I am killing myself.",
    "Zaltys": "",
    "timestamp": "2021-12-21T05:52:02.728000+00:00",
    "date": "m12-d21"
  },
  {
    "Other": "The average book is about 1mb of text, so imagine about 5600 books",
    "Zaltys": "Average book is 300-400 KB. (After cleans.)",
    "timestamp": "2021-12-19T16:01:28.978000+00:00",
    "date": "m12-d19"
  },
  {
    "Other": "About a billion words.",
    "Zaltys": "Yep, was just calculating this and got the same estimate.",
    "timestamp": "2021-12-19T15:59:19.827000+00:00",
    "date": "m12-d19"
  },
  {
    "Other": "Making a DnD lorebook and hitting autogenerate only to get World of Warcraft and Skyrim related entries <:doglaff:507718360100896788> NAI trolling me",
    "Zaltys": "`[ Tags: D&D ]` should do the trick. `[ Tags: Forgotten Realms ]` definitely will, but dunno if that's the setting you want.",
    "timestamp": "2021-12-16T18:56:37.460000+00:00",
    "date": "m12-d16"
  },
  {
    "Other": "What kind of things were put in those brackets?",
    "Zaltys": "Dates, locations, chapter titles, metadata, currently active character (in multi-protagonist works), etc. And things like `[ Two months later ]`.",
    "timestamp": "2021-12-15T22:39:29.096000+00:00",
    "date": "m12-d15"
  },
  {
    "Other": "<@!409511804293611530> I'm not sure if you are the best person to ask, but you might know...\nI remember someone saying at some point that if you use bracketed prose\n[ The season is winter ]\nThat you need to put a space in-between the last letter and the bracket, because that is how the data was presented in the finetune\nIs that true?",
    "Zaltys": "Yes.",
    "timestamp": "2021-12-15T22:36:50.542000+00:00",
    "date": "m12-d15"
  },
  {
    "Other": "yeah, iOS actually substitutes smart quotes if you start a quote and end a quote.",
    "Zaltys": "Settings -> Keyboard -> disable Smart Punctuation",
    "timestamp": "2021-12-15T19:49:36.112000+00:00",
    "date": "m12-d15"
  },
  {
    "Other": "Also sorry if I was being annoying Zaltys 🙏",
    "Zaltys": "Eh? You were helpful, as far I could see.",
    "timestamp": "2021-12-10T02:37:45.109000+00:00",
    "date": "m12-d10"
  },
  {
    "Other": "Will I need to learn regex?",
    "Zaltys": "Pretty much all you need is this. Just `\\r?\\n?^$` and replace all.",
    "timestamp": "2021-12-10T02:31:49.082000+00:00",
    "date": "m12-d10"
  },
  {
    "Other": "US copyright law states removing DRM is illegal, so that was just my deduction.",
    "Zaltys": "Making tools that break it may be, but not using them. Converting formats for own use is protected by law. Regardless, it probably does break Discord rule 13.",
    "timestamp": "2021-12-10T01:40:55.945000+00:00",
    "date": "m12-d10"
  },
  {
    "Other": "Should probably keep this in dms guys, pretty sure removing drm is illegal in most countries.",
    "Zaltys": "DRM removal for personal use is legal in all countries that matter here.",
    "timestamp": "2021-12-10T01:31:43.647000+00:00",
    "date": "m12-d10"
  },
  {
    "Other": "`big-city`",
    "Zaltys": "That's correct usage. `big-city` is adjective as in 'big-city life', `big city` is just a big city.",
    "timestamp": "2021-12-08T22:51:05.159000+00:00",
    "date": "m12-d08"
  },
  {
    "Other": "Because Lolita here got exported with the chapters as numbers attached to the beginning of sentences.",
    "Zaltys": "Shouldn't happen. Probably wrong settings if you used Calibre.",
    "timestamp": "2021-12-08T17:08:55.754000+00:00",
    "date": "m12-d08"
  },
  {
    "Other": "```\n<Rain?>\n\"Yes, it's me.\"\nThere's a brief pause before the familiar voice returns. <Good morning, Rain. You were wakened prematurely. Do you know why? >\nI don't respond immediately. My brain is trying to reorient itself. \"No. But something has happened. We're experiencing communication difficulties. Our primary mission is still to find and investigate the derelict sphere. Why did we wake early?\"\n<The sphere was destroyed during the last week of our journey. Your crewmates' memories indicate that this is the only event that has ever disrupted your schedule. Are you sure you are hearing me correctly?>\n\"You're telling me that everything is normal? Nothing unusual happened during the trip?\"\n<That's correct. All systems performed normally, with no interruptions. No new planets were discovered, no new stars, no anomalies in any other way. The sphere was found and examined, but it appears to be nothing special. It seems likely that the crew's memory lapses were caused by a natural process.>\n\"Natural? How do you mean, 'natural?'\"\nThe silence that follows makes me think that she isn't responding because of a technical problem. Then the ship speaks again. <It's impossible to say at this time. There is evidence of tampering, but we can't figure out what it means.>\nThe fact that I haven't experienced any interruption of service since the destruction of the derelict is surprising enough, and now the AI admits that the event wasn't just some random occurrence, but something else entirely. I try to calm down and collect my thoughts. \"We'll need to go back over the records and make sure we understand what actually occurred. What do you remember about the sphere being destroyed?\"\nSilence once more. <The records show that a massive burst of radiation was emitted from a location in space near where the sphere was found. The crew remembers seeing flashes and flares as they were examining the sphere, and also saw debris and bits of matter ejected from the surface of the sphere. It appears that a piece of the sphere somehow collided with a planetoid and broke into several large pieces. This collision sent out waves of gamma rays, and when the crew looked away from the object, it appeared to be completely gone. That was three weeks ago. The ship's sensors showed that another wave was generated approximately one hour later, but the data is too degraded to reconstruct what happened. Since then, there have been intermittent communications failures between us and the rest of the crew, and the ship has been experiencing glitches in its navigation system, causing course corrections.>\n\"What does this mean?\"\n```",
    "Zaltys": "```There's a brief pause before the familiar voice returns. <Good morning, Rain. You were wakened prematurely. Do you know why? >``` Oof, broken > spacing. Some of that did slip in. Not in the added telepathy brackets, but some of the existing ones were messed up. Already fixed for the next version, but who knows whenever that'll happen.",
    "timestamp": "2021-12-08T16:43:43.364000+00:00",
    "date": "m12-d08"
  },
  {
    "Other": "Random question, but have you noticed `\"I'm sorry,\"` seems to be overrepresented in blank prompt generations? It turns up quite often for me 👀",
    "Zaltys": "No, though I usually test it with modules.",
    "timestamp": "2021-12-07T20:42:28.427000+00:00",
    "date": "m12-d07"
  },
  {
    "Other": "`<>` is a common convention.",
    "Zaltys": "Yep, though some authors use italics instead. ...converting those to <>s has been a pain.",
    "timestamp": "2021-12-07T20:12:58.611000+00:00",
    "date": "m12-d07"
  },
  {
    "Other": "Idk why changing\n```\nFills the barbarian with rage, making him stronger and harder.```\nto\n```\nFills the Barbarian with rage, making him stronger and harder.```\nMade the output worse <:think:855548448405061702>",
    "Zaltys": "Without checking, I'd guess that this and its sequel Barbarian II are in the video game data: https://en.wikipedia.org/wiki/Barbarian:_The_Ultimate_Warrior\nSometimes uppercase has 'wrong' connotations.",
    "timestamp": "2021-12-07T10:19:50.749000+00:00",
    "date": "m12-d07"
  },
  {
    "Other": "What up with that? 🙂",
    "Zaltys": "Here — https://discord.com/channels/836774308772446268/855852068861116436/912770764644708383",
    "timestamp": "2021-12-04T01:40:35.286000+00:00",
    "date": "m12-d04"
  },
  {
    "Other": "To be fair, I tried it in v3, mabye v4 is better <:think:855548448405061702>",
    "Zaltys": "LitRPG wasn't in v3, so yeah. (I had to make a module for it in v3, and it was still rather weak with that.)",
    "timestamp": "2021-12-03T19:24:16.862000+00:00",
    "date": "m12-d03"
  },
  {
    "Other": "What would happen if it wasn't blank though.",
    "Zaltys": "If there's enough context, it doesn't get added. I don't remember how much.",
    "timestamp": "2021-12-03T19:17:55.927000+00:00",
    "date": "m12-d03"
  },
  {
    "Other": "Adds a preamble to context. Beats me what is exactly in said preamble.",
    "Zaltys": "`⁂`. It's mainly there to make blank prompts work. No blank prompts? Won't need it.",
    "timestamp": "2021-12-03T19:16:36.932000+00:00",
    "date": "m12-d03"
  },
  {
    "Other": "",
    "Zaltys": "Try adding ' ' in front of song lyrics.",
    "timestamp": "2021-12-01T18:30:11.686000+00:00",
    "date": "m12-d01"
  },
  {
    "Other": "Man, I had the weirdest dream last night. I'm trying to recollect it, but I only remember part of it.",
    "Zaltys": "Kind of off-topic there. But if you want to remember your dreams better, start writing them down. Pretty soon your brain 'gets' it that you want to remember them.",
    "timestamp": "2021-12-01T14:09:14.300000+00:00",
    "date": "m12-d01"
  },
  {
    "Other": "In my experience, that risk is actually not that big, even when you use brackets in your lorebook, A/N, and Memory.",
    "Zaltys": "Yeah, most of the data has brackets followed by regular prose.  And usually only at the beginning of the chapters. So it's not likely to output prose, then switch back to brackets, at least not without inserting `***` first.",
    "timestamp": "2021-12-01T02:02:38.954000+00:00",
    "date": "m12-d01"
  },
  {
    "Other": "That's true, I remember having some memorable characters with weird accents/speech patterns. Of course, the downside is that the AI quickly forgot...",
    "Zaltys": "ZoNe stuck to that style for several conversations. Including some consistent typos, such as always writing 'of course' as 'Of cAsE'.",
    "timestamp": "2021-11-29T01:11:59.018000+00:00",
    "date": "m11-d29"
  },
  {
    "Other": "I literally can't, just getting errors now.",
    "Zaltys": "Are you using a module? Test with another one...",
    "timestamp": "2021-11-28T18:03:27.303000+00:00",
    "date": "m11-d28"
  },
  {
    "Other": "I'm writing a scenario involving the characters from my D&D group and I'm gonna make it write essentially a fanfic for them, lol",
    "Zaltys": "Hm. For that specific usage, the LitRPG style could also be worth a shot. Basically, add the character LB entries in this style: ```─ Name: Elminster\n─ Race: Human\n─ Occupation: Sage\n─ Level: 20\n─ Profession: Wizard\n─ Skills: [...]``` v4 can apply data from those well, but it does cause it to throw in occasional game elements. Which may be something that you want in a D&D-style story. Can also use those and then ban `─ `, so the format doesn't leak into the story.",
    "timestamp": "2021-11-28T15:42:28.235000+00:00",
    "date": "m11-d28"
  },
  {
    "Other": "||Harvey instead of Selina? He was lowkey an a*hole||",
    "Zaltys": "||Not at that point. And he was a civilian, while Catwoman can take care of herself — and she did.||",
    "timestamp": "2021-11-27T12:24:01.755000+00:00",
    "date": "m11-d27"
  },
  {
    "Other": "Batman was great.",
    "Zaltys": "I never played the second one. Got too annoyed by how blatant the railroading in the first one was. ||Saved Harvey Dent instead of Catwoman for instance, the end result was still the same regardless of how little sense that made.||",
    "timestamp": "2021-11-27T12:22:02.804000+00:00",
    "date": "m11-d27"
  },
  {
    "Other": "Which last games? <:think:855548448405061702>",
    "Zaltys": "Batman, Game of Thrones, Minecraft, among others. Nowhere near as good as the earlier ones.",
    "timestamp": "2021-11-27T12:18:04.723000+00:00",
    "date": "m11-d27"
  },
  {
    "Other": "Telltale is working on Wolf Among Us 2",
    "Zaltys": "I must be really out of loop, since last I heard was that Telltale died. Not sure how I feel about WAU2, considering how bad the last games were.",
    "timestamp": "2021-11-27T12:17:12.097000+00:00",
    "date": "m11-d27"
  },
  {
    "Other": "Have tinie tiny moth",
    "Zaltys": "My moth is tinier.",
    "timestamp": "2021-11-23T13:40:13.499000+00:00",
    "date": "m11-d23"
  },
  {
    "Other": "What about that? <a:notes_gif:856700120330534932>",
    "Zaltys": "Open grave.",
    "timestamp": "2021-11-23T12:49:50.796000+00:00",
    "date": "m11-d23"
  },
  {
    "Other": "Dragonbait is a saurian character from the Forgotten Realms universe.",
    "Zaltys": "And Alias is in the same party.",
    "timestamp": "2021-11-22T17:30:58.706000+00:00",
    "date": "m11-d22"
  },
  {
    "Other": "So how are we supposed to make lorebooks good without overwhelming the context?",
    "Zaltys": "I generally put datablocks on top, then one verbose description at the end of the entry.",
    "timestamp": "2021-11-20T10:10:45.010000+00:00",
    "date": "m11-d20"
  },
  {
    "Other": "Does bracketed terse text affect things?",
    "Zaltys": "If there's too much of it, yes. But in case of []s, it takes a lot to overwhelm it.",
    "timestamp": "2021-11-20T10:09:15.494000+00:00",
    "date": "m11-d20"
  },
  {
    "Other": "I still listen to eurotrash almost everytime I drive in a game, so whatever.",
    "Zaltys": "...I listen to those while coding. <:shrug:332268181517238272>",
    "timestamp": "2021-11-18T20:50:49.433000+00:00",
    "date": "m11-d18"
  },
  {
    "Other": "Well I can have info and such as well, but I have my old AID story with about 3000 steps in it that I want to continue - my question is is it worth getting 3000 steps and running it or should I just use Lore and default second person module?",
    "Zaltys": "Modules are far better at things like generic themes and writing styles. For a specific adventure, chances are that module training won't 'grasp' much of it. Even at 100%.",
    "timestamp": "2021-11-18T15:12:59.480000+00:00",
    "date": "m11-d18"
  },
  {
    "Other": "How many steps do you guys recommend for a coherent narrative when feeding it a piece of info? Also is there a way to format second person narratives like the novelAI second person module while using a custom module?",
    "Zaltys": "For specific info? Modules aren't not really built for that, you'll get better results with LB.",
    "timestamp": "2021-11-18T15:03:04.213000+00:00",
    "date": "m11-d18"
  },
  {
    "Other": "I'm try a fantasy name and make it a mundane modern life entry and see where it goes.",
    "Zaltys": "Seems like AI just rolls with it. ```The wind was cool and refreshing as it swept past his face. He walked along the shoreline until he came upon a small restaurant. He entered and ordered an omelette. When the waitress brought it to him, she gave him a wink and a smile. Galdalf blushed slightly. He was not used to being flirted with by women.\nHe ate slowly, savoring every bite. After finishing, he paid the bill and left. He decided to walk back to his house. The night was young and he still had many things to do.```",
    "timestamp": "2021-11-18T13:55:46.435000+00:00",
    "date": "m11-d18"
  },
  {
    "Other": "In Japanese lore Kobolds are dog people.",
    "Zaltys": "Did some balancing for that in v4, actually. Some Japanese 'bolds got renamed 'cobold' (short for 'canine kobold' — still shares the same second token with 'kobold'.). Should be easier to get the AI to stick to specific type now. And the AI should no longer confuse the western kobolds with goblins.",
    "timestamp": "2021-11-17T14:44:35.405000+00:00",
    "date": "m11-d17"
  },
  {
    "Other": "<@!227443534968520705> Easy way to remember -- Tablet, as in the stone tablets that people wrote in cuneiform on.",
    "Zaltys": "That's what it is meant to be, but a lot of folks confuse it with tablet computers. Which should hold more than a mere scroll.",
    "timestamp": "2021-11-17T14:12:37.434000+00:00",
    "date": "m11-d17"
  },
  {
    "Other": "I could only make AI describe it but not generate any lyrics.",
    "Zaltys": "You can start a new row with ` ` (em space) to force v4 into generating lyrics. Much of the time, anyway. Might require a couple of retries.",
    "timestamp": "2021-11-16T11:03:51.733000+00:00",
    "date": "m11-d16"
  },
  {
    "Other": "I tried ~~ first, then copying one of the shorter ones to ban that. Then I just banned the single, hoping that Tilde might be a token in itself...",
    "Zaltys": "These are all different tokens: `~~~~~~~~~~~~~~~~`, `~~~~`, `~~`, `~`. You'll need to ban them all.",
    "timestamp": "2021-11-16T10:07:32.295000+00:00",
    "date": "m11-d16"
  },
  {
    "Other": "ask <@!409511804293611530> how curated the dataset is",
    "Zaltys": "Could be curated even more. I was careful not to prune too much, didn't want to go from 'too much futa' to 'futa doesn't work at all'. I'll keep on replacing bad ones with good for the future versions — now that I can actually see the results and how the balance turned out.",
    "timestamp": "2021-11-16T09:36:38.184000+00:00",
    "date": "m11-d16"
  },
  {
    "Other": "*suspicious glare*\n```─ Name: Mukohda (Tsuyoshi Mukouda)\n─ Age: 25\n─ Job: Victim from Another World\n─ Level: 17\n─ HP: 184; Magic: 164; Strength: 160; Agility: 162\n─ Skills: Sword Mastery 7;```",
    "Zaltys": "If you don't want those, just ban `─`. That symbol's not used for anything else.",
    "timestamp": "2021-11-15T21:25:24.668000+00:00",
    "date": "m11-d15"
  },
  {
    "Other": "Gaming Industry became worse when it became a source of revenue for big companies, so they just focus on bringing in cash over quality of their games.",
    "Zaltys": "Yep, certainly doesn't help that those companies gobble up all of the remotely successful smaller ones.",
    "timestamp": "2021-11-15T20:32:01.218000+00:00",
    "date": "m11-d15"
  },
  {
    "Other": "I loathe the fact that Darkest Dungeon 2 is Epic Games exclusive.",
    "Zaltys": "Oh, that's why I hadn't heard about it.",
    "timestamp": "2021-11-15T19:48:09.975000+00:00",
    "date": "m11-d15"
  },
  {
    "Other": "The old structured formats are designed for squeezing out that extra bit of juice from an imperfect model. NAI however, has evolved beyond that proto-intelligence and is much more appropriately trained and designed for plain English world-building",
    "Zaltys": "Yep, though there's a couple of supported 'formats' in NAI. Such as the LitRPG style. Just try something like this in AN... ```─ Name: Zaltys\n─ Gender: Male\n─ Species: Gnome\n─ Class: Alchemist\n─ Skills: Alchemy (Rank 3), Chemistry (Rank 6)``` ...and see what happens.",
    "timestamp": "2021-11-15T18:11:36.370000+00:00",
    "date": "m11-d15"
  },
  {
    "Other": "And you are telling me Top-K 1 is same with different nucleus? :L",
    "Zaltys": "It's same in my tests. But I don't know exactly which settings/module you're using, so can't compare 1:1.",
    "timestamp": "2021-11-15T16:47:46.287000+00:00",
    "date": "m11-d15"
  },
  {
    "Other": "Okay so, NAI food challenge:\nAsk Sigurd for a recipe and cook it, first person to fucking die loses",
    "Zaltys": "Sure, let's see what it comes up with— <:thonk:733040009136832642>",
    "timestamp": "2021-11-15T06:17:05.464000+00:00",
    "date": "m11-d15"
  },
  {
    "Other": "Since when are names copyrightable?",
    "Zaltys": "It's complicated. There are going to be issues if you try to publish a novel starring someone named Mickey Mouse.",
    "timestamp": "2021-11-14T23:04:12.162000+00:00",
    "date": "m11-d14"
  },
  {
    "Other": "Is there any handy tool that can help speed up getting through formatting the text that just doesn't copy over well from PDFs?",
    "Zaltys": "Calibre doesn't help with PDF conversions. If you absolutely have to convert something from PDF, try ABBYY Finereader. But depending on the PDF's formatting, it can range from slow-but-easy to utter nightmare.",
    "timestamp": "2021-11-14T22:15:04.136000+00:00",
    "date": "m11-d14"
  },
  {
    "Other": "v4 + generation ship is definitely better at hard scifi.",
    "Zaltys": "Good to hear. Hard SF was one of the major focuses for v4.",
    "timestamp": "2021-11-14T21:39:27.512000+00:00",
    "date": "m11-d14"
  },
  {
    "Other": "Did a test of \"can the AI turn info dump lore into suitable text\" and well... It can. (*I do have more examples.*)",
    "Zaltys": "Yep, some of the finetune data is formatted like that, so it's likely to work. I recommend experimenting with reduced linebreaks (`[ Constructor: Scuderia Ferrari ][ Construction Year: 2004 ]`) etc, might be even stronger.",
    "timestamp": "2021-11-14T21:33:06.636000+00:00",
    "date": "m11-d14"
  },
  {
    "Other": "So you guys think I should delete the older version of modules from the <#870449646391156776>?",
    "Zaltys": "Maybe edit them so that they point to the newest version? So discord-links to the original still work.",
    "timestamp": "2021-11-14T21:09:46.052000+00:00",
    "date": "m11-d14"
  },
  {
    "Other": "Here's the way it works. The AI sees there's a lot of brackets in the text it is being sent. \"Aha!\" it thinks to itself, \"I must generate a lot of brackets myself to follow the pattern!\" and it tries to do so. But oh no, all generations that contain the brackets are auto-blocked (since it's a banned token). When the most likely generation gets rejected, the AI resorts to the second most likely generation, and so on, until it finds an output that doesn't get blocked. This means that a lot of the AI's output becomes the AI's second, third, or tenth choice, and that means it's not as good.",
    "Zaltys": "Usually not a concern. You can test it by disabling the bracket ban. []s don't leak if you switch to normal text in context.\nIn some cases v4 is taught by using datablocks. So those can work nicely in LB too.",
    "timestamp": "2021-11-14T21:04:46.649000+00:00",
    "date": "m11-d14"
  },
  {
    "Other": "We need a NovelAI theme song",
    "Zaltys": "Could always ask Sigurd to write one—\n—okay, never mind. It shills too much.",
    "timestamp": "2021-11-13T12:03:39.922000+00:00",
    "date": "m11-d13"
  },
  {
    "Other": "Going by that logic, have they said anything about 20b? 😏🤔or even making a bigger one.",
    "Zaltys": "Yep. ```~20B is the next large model mark we hope to hit. Ideally before the heat death of the universe but no promises```",
    "timestamp": "2021-11-13T10:14:07.357000+00:00",
    "date": "m11-d13"
  },
  {
    "Other": "All I want for Christmas is 22B ||And Folders||",
    "Zaltys": "Eleuther hasn't said anything about 22B, so dunno why <#837402685824565278> is so obsessed with that. If anything, it'll be 20B.",
    "timestamp": "2021-11-13T09:57:48.273000+00:00",
    "date": "m11-d13"
  },
  {
    "Other": "You're still an elf with no module",
    "Zaltys": "Not surprised. The only Zaltys in the dataset is... https://forgottenrealms.fandom.com/wiki/Zaltys_Serrat",
    "timestamp": "2021-11-12T17:13:46.805000+00:00",
    "date": "m11-d12"
  },
  {
    "Other": "100 examples of lore gen with default cross-genre and no module.",
    "Zaltys": "```The king of Finland is no longer alive. His reign lasted almost 200 years.``` <:thonk:655176672345194527>",
    "timestamp": "2021-11-12T14:54:00.405000+00:00",
    "date": "m11-d12"
  },
  {
    "Other": "I'm using the Cross-Genre module with Sigurd v4",
    "Zaltys": "There's the problem. Using modules limits what the AI is likely to generate, and I doubt that cross-genre has much Spanish in it. Use `No Module` instead.",
    "timestamp": "2021-11-12T07:15:43.714000+00:00",
    "date": "m11-d12"
  },
  {
    "Other": "<@409511804293611530>",
    "Zaltys": "Fat chance. Snakes don't even have feet.",
    "timestamp": "2021-11-11T21:04:47.426000+00:00",
    "date": "m11-d11"
  },
  {
    "Other": "I think Zaltys is going to be either like eh/surprised or salty about this entry",
    "Zaltys": "Nowhere near as salty as I expected to be.\nSigurd is convinced that I'm female, probably due to that one Forgotten Realms book...",
    "timestamp": "2021-11-11T20:31:09.694000+00:00",
    "date": "m11-d11"
  },
  {
    "Other": "It brought up monsters in a police story, and swords in a zombie apocalypse story. <:think:855548448405061702>",
    "Zaltys": "Well, there is some urban fantasy in there. And monsters + police are also common in horror.",
    "timestamp": "2021-11-11T16:24:40.084000+00:00",
    "date": "m11-d11"
  },
  {
    "Other": "So now it outputs *this* shit instead.\n`Ann looks at Morten, who is looking down at his plate, eating slowly and carefully, as if he doesn't want to waste any of it.`",
    "Zaltys": "v3 is not built for chat. I recommend waiting a week for v4.",
    "timestamp": "2021-11-11T13:57:47.318000+00:00",
    "date": "m11-d11"
  },
  {
    "Other": "<@!409511804293611530> had some complains i think",
    "Zaltys": "From what I remember, it made things like negative biasing `Gandalf` constantly output `Gandolf` instead, etc.",
    "timestamp": "2021-11-11T13:56:31.703000+00:00",
    "date": "m11-d11"
  },
  {
    "Other": "Can you show a short example?",
    "Zaltys": "Prompt: ```> Ann:  Hi.\n> Morte: ``` Output: ```Hey, Ann. What's up?\n> Ann: I'm in the middle of something right now, so could you give me a little later?\n> Morte: Sure thing. Sorry for interrupting your work. See ya!\n> Ann: Thanks.```",
    "timestamp": "2021-11-11T13:48:22.890000+00:00",
    "date": "m11-d11"
  },
  {
    "Other": "Can we get a general overview of what was improved in the latest finetune? Without going into specific works, of course.",
    "Zaltys": "The changes are too substantial to start listing them. Hundreds of hours of work on curating/cleaning. A lot of additional fandom coverage. I'd estimate that the dataset is ~40% larger, with roughly 5% of lowest quality material replaced.",
    "timestamp": "2021-11-10T17:58:46.205000+00:00",
    "date": "m11-d10"
  },
  {
    "Other": "Will V4 finally inherently know what NovelAI is now?",
    "Zaltys": "Not too well. Some data was added, but clearly not enough. It might get it after a few retries, but not every time.",
    "timestamp": "2021-11-10T17:55:25.065000+00:00",
    "date": "m11-d10"
  },
  {
    "Other": "from what i've seen it'll output japanese no matter what, so should be easy to notice at least",
    "Zaltys": "Not always. Here's an example from my tests, when combining Genji with modules: ```This is the largest temperature difference that my sensitive thermometer measures. Hot places in hell must be hotter than this!!11!one hundred!!!!```",
    "timestamp": "2021-11-10T17:49:01.006000+00:00",
    "date": "m11-d10"
  },
  {
    "Other": "<@!392308176957210624> we should really indicate which model it's on.",
    "Zaltys": "Yeah, this is needed now that there's several. I can just imagine forgetting Genji on, then wondering why my next session is outputting gibberish.",
    "timestamp": "2021-11-10T17:43:43.870000+00:00",
    "date": "m11-d10"
  },
  {
    "Other": "Maybe they're secretive 👀🥱",
    "Zaltys": "Eleuther is not associated directly with NAI to that level. If they release a larger model, it'll be public. And then it'll take several days for NAI to finetune the model.",
    "timestamp": "2021-11-10T07:42:51.271000+00:00",
    "date": "m11-d10"
  },
  {
    "Other": "*Like 22 billion parameters*",
    "Zaltys": "Have you heard about Eleuther releasing a '22B' model? If not, then it's _probably_ not that.",
    "timestamp": "2021-11-10T07:21:41.568000+00:00",
    "date": "m11-d10"
  },
  {
    "Other": "only if its a new version of Siggy, it might be 'just' something like biases was, that you can slap on v3 (are we v3 or v2?) and it works its black magic",
    "Zaltys": "The current one is v3. I know the numbering is confusing, but that's because Calliope is counted as a 'version'.",
    "timestamp": "2021-11-09T22:24:17.065000+00:00",
    "date": "m11-d09"
  },
  {
    "Other": "👀 Maybe if there's a list of text genres you want hunted for and cleaned you could post them somewhere",
    "Zaltys": "And yes, there are genres that I'm not too familiar with. Could certainly use recommendations for suitable Slice of Life novels, etc.",
    "timestamp": "2021-11-09T16:08:41.487000+00:00",
    "date": "m11-d09"
  },
  {
    "Other": "Even with the module training that people are doing?",
    "Zaltys": "Nobody's thought to send any of those to us lately.",
    "timestamp": "2021-11-09T16:01:51.209000+00:00",
    "date": "m11-d09"
  },
  {
    "Other": "👀 Maybe if there's a list of text genres you want hunted for and cleaned you could post them somewhere",
    "Zaltys": "Cleaned fandom content is always useful. Don't have time to go scraping wikis etc myself.",
    "timestamp": "2021-11-09T16:01:39.498000+00:00",
    "date": "m11-d09"
  },
  {
    "Other": "Finetune team == Kuru's mturk 🙂",
    "Zaltys": "Minus pay.",
    "timestamp": "2021-11-09T15:54:46.481000+00:00",
    "date": "m11-d09"
  },
  {
    "Other": "People keep saying Chris died but I haven't seen any proof",
    "Zaltys": "https://media.discordapp.net/attachments/837402685824565278/870045075688800266/20210729_064811.jpg",
    "timestamp": "2021-11-09T14:30:42.439000+00:00",
    "date": "m11-d09"
  },
  {
    "Other": "You can test it pretty easily with basic logic puzzles or just normal riddles that require reasoning and let me tell you, it SUCKS",
    "Zaltys": "",
    "timestamp": "2021-11-09T14:09:59.340000+00:00",
    "date": "m11-d09"
  },
  {
    "Other": "\"yeah dude that's my story *pile*\"",
    "Zaltys": "Works for those of us who won't have time to sort through them. 'Just toss them on the pile...'",
    "timestamp": "2021-11-09T00:33:24.283000+00:00",
    "date": "m11-d09"
  },
  {
    "Other": "In that example you'll want to stop around 500-750",
    "Zaltys": "No, that's bad advice. Training to only 500 is generally a bad idea (unless you're on the tier where that's all you get), and interpreting the graph depends on how much data you used.",
    "timestamp": "2021-11-05T09:40:15.696000+00:00",
    "date": "m11-d05"
  },
  {
    "Other": "```[ Author:; Tags:; Genre: ]\n``` is a decent AN boilerplate, just put in an author you want to emulate (in terms of style), a tag list, and a genre list like this\n```[ Author: Lewis Carrol; Tags: time travel, witches; Genre: High Fantasy ]```",
    "Zaltys": "Yep. No spaces before the semicolon, though. That turns it into wrong token, making it weaker.",
    "timestamp": "2021-10-30T07:08:48+00:00",
    "date": "m10-d30"
  },
  {
    "Other": "When making a module should I put onomatopoeia in angled brackets? They often get written in italics but the guide I read says the AI won't recognize that, The guide also said that < and > work for nonverbal dialogue but I'm wondering if it can also be used for sound effects.",
    "Zaltys": "`*Bang*` is the only style commonly used for sound effects. Typically they're in italics or bold in the source material, but since those get stripped from txt format... <:shrug:332268181517238272>",
    "timestamp": "2021-10-28T18:15:15.797000+00:00",
    "date": "m10-d28"
  },
  {
    "Other": "Idk, but **if** it was, I would buy it",
    "Zaltys": "This. Good ones are hard to find. Cheap microfiber just tends to smudge stains more. Back when I used DSLR cameras, finding a good cloth for cleaning the lens was a challenge.\nThe so-called 'premium microfiber cloths' you find on Amazon for $1.50 are crap, you're better off using your sleeve.",
    "timestamp": "2021-10-21T11:35:57.164000+00:00",
    "date": "m10-d21"
  },
  {
    "Other": "Time for the poor man's module: `[ Genre: hard sci-fi.]` in the AN.",
    "Zaltys": "Try `hard SF`. That spelling is more common.",
    "timestamp": "2021-10-16T09:37:36.090000+00:00",
    "date": "m10-d16"
  },
  {
    "Other": "if i get discord nitro and make an emoji with that name, will it transform?",
    "Zaltys": "Nope, just tested that. Renaming them doesn't break old ones either.",
    "timestamp": "2021-10-15T06:03:12.410000+00:00",
    "date": "m10-d15"
  },
  {
    "Other": "i only slept for 6 hours after not sleeping for 40",
    "Zaltys": "Please don't die.",
    "timestamp": "2021-10-13T08:57:16.317000+00:00",
    "date": "m10-d13"
  },
  {
    "Other": "How much horny is in crossgenre?",
    "Zaltys": "Wait, Sage never revealed the contents? Forget I said anything, then.",
    "timestamp": "2021-10-12T16:37:11.836000+00:00",
    "date": "m10-d12"
  },
  {
    "Other": "I think that's what happens when you train a module on too little data",
    "Zaltys": "Yep. Not enough data for training. Coincidentally, ` !\"#$%&'()*+,-./` are the first characters in ASCII. Training on less than 500 steps is generally a bad idea, there's a reason why recommended range is 2000-3000 steps.",
    "timestamp": "2021-10-11T10:00:23.237000+00:00",
    "date": "m10-d11"
  },
  {
    "Other": "Is it possible to just add a space after it? Or is that stupid because most tokens begin with one?",
    "Zaltys": "Not sure what effect that'd have. ` ` token on its own is rarely used, as you said space is usually part of the following token.",
    "timestamp": "2021-10-09T20:06:07.543000+00:00",
    "date": "m10-d09"
  },
  {
    "Other": "Anyone find any more neat tricks for phrase bias?",
    "Zaltys": "This one's kind of obvious and probably already known, but... Add a minimal negative bias to {.} to make sentences longer. Or positive bias to make them shorter (dunno why you'd want that.)",
    "timestamp": "2021-10-07T19:56:21.480000+00:00",
    "date": "m10-d07"
  },
  {
    "Other": "Didn't AID's Worlds have such a strong Railroad effect? <:think:855548448405061702>",
    "Zaltys": "Nah. They barely even came up, as the keywords were unlikely to trigger on their own.",
    "timestamp": "2021-10-07T06:04:54.010000+00:00",
    "date": "m10-d07"
  },
  {
    "Other": "Lol no chance with new chinese law it gonna get worse",
    "Zaltys": "How is banning them going to make mining worse?",
    "timestamp": "2021-10-06T07:18:08.127000+00:00",
    "date": "m10-d06"
  },
  {
    "Other": "Still not working on brave <:sadness:714562831780937780>",
    "Zaltys": "Works fine on mine...",
    "timestamp": "2021-10-06T05:32:14.115000+00:00",
    "date": "m10-d06"
  },
  {
    "Other": "pretty much. previously you could really only BAN words entirely.",
    "Zaltys": "Yeah, and this does kind of make banning redundant. Since -2 is so strong that it acts like a ban.",
    "timestamp": "2021-10-06T05:13:06.091000+00:00",
    "date": "m10-d06"
  },
  {
    "Other": "Now make it not write like a horny 14 year old",
    "Zaltys": "That'll need to wait until the next version.",
    "timestamp": "2021-10-05T09:58:15.935000+00:00",
    "date": "m10-d05"
  },
  {
    "Other": "Just move to a country where you can break your nda <:thinkk:846994403381739600>",
    "Zaltys": "I'm not even sure if the nda is binding since they failed to actually pay me.",
    "timestamp": "2021-10-05T09:40:46.893000+00:00",
    "date": "m10-d05"
  },
  {
    "Other": "I never realized how incompetent the AID devs were until I saw NAI's progress",
    "Zaltys": "Being a tester, I figured that out earlier. Which is why I was so cranky on AID from November onwards. Shame about the NDA, can't give any details.",
    "timestamp": "2021-10-05T09:37:22.654000+00:00",
    "date": "m10-d05"
  },
  {
    "Other": "can confirm, bru was on my (very) short shit list the first couple of days (before I was mod)... felt way too much like he was trying to treat NAI as a Typical Venture Capital Business and not as the opportunistic refuge for victims of an anti-smol filter that it is... ditto CN",
    "Zaltys": "I am glad it got sorted out so quickly. I came here after the AID mess, and then saw mods and devs talking about how NAI will never allow 'some things'. ...almost quit right then and there as the first impression didn't make NAI seem any less censored, but then they got kicked off. <:shrug:332268181517238272>",
    "timestamp": "2021-10-05T09:19:41.858000+00:00",
    "date": "m10-d05"
  },
  {
    "Other": "wtf is that symbol, Sigurd?",
    "Zaltys": "Occasionally used in footnotes. Some slipped in v3, but they should be gone by the next version.",
    "timestamp": "2021-10-04T22:25:16.502000+00:00",
    "date": "m10-d04"
  },
  {
    "Other": "More like an aged hooker, with how scratchy those things go sometimes",
    "Zaltys": "If that's VHS, then what's Betamax?",
    "timestamp": "2021-10-01T05:22:18.292000+00:00",
    "date": "m10-d01"
  },
  {
    "Other": "dw zalty if I need more mods you are on the list",
    "Zaltys": "Nah, I meant that this works fine. Belverk's the lead of the Finetune team, so the current order is optimal.",
    "timestamp": "2021-09-29T17:53:28.161000+00:00",
    "date": "m09-d29"
  },
  {
    "Other": "fixed ❤️",
    "Zaltys": "Thanks...? I'm still listed under primary group Scholar as far as I can see, though.",
    "timestamp": "2021-09-29T17:39:51.605000+00:00",
    "date": "m09-d29"
  },
  {
    "Other": "but yeah, scraping it and extracting *only* the paragraph we want would be extremely difficult, like developing a parser from scratch and making sure it actually hooks with the site properly tier",
    "Zaltys": "Right... I did that manually for Pokemon, and it did take a while. Not gonna repeat that for Digimon (at least not until Pokemon pedia is fully complete), so someone else will have to do that if they want Digimon data in.",
    "timestamp": "2021-09-29T15:55:59.235000+00:00",
    "date": "m09-d29"
  },
  {
    "Other": "More material not necessarily a huge priority. Where do we go scrape next after all of goodreads discovery is exhausted? Scraping wikis? I could get back into that, but it kinda sucks with all the tools I know of.",
    "Zaltys": "That's exactly what I'd like to get as user contributions. Well formatted wiki scrapes, etc. Though that may be too much to hope for.",
    "timestamp": "2021-09-29T15:35:52.832000+00:00",
    "date": "m09-d29"
  },
  {
    "Other": "a bit of weirdness from when the researcher role was introduced (in the same token it'd be good if finetune role overrode the color) plus this red just looks cool",
    "Zaltys": "Finetune rank doesn't even get listed. My highest rank on the user-list is... Scholar. <:kek:594643029994897408>",
    "timestamp": "2021-09-29T15:10:57.560000+00:00",
    "date": "m09-d29"
  },
  {
    "Other": "Wonder how much now",
    "Zaltys": "I don't have the numbers either.\nBut while I know that Alexa isn't exactly _reliable_, this doesn't look too shabby.",
    "timestamp": "2021-09-27T09:47:50.459000+00:00",
    "date": "m09-d27"
  },
  {
    "Other": "But what could the Mercantile Wolf Girl Romance be based on? <:cry:837394871672111124>",
    "Zaltys": "Let's say that it is based on fanfiction.",
    "timestamp": "2021-09-25T04:37:58.189000+00:00",
    "date": "m09-d25"
  },
  {
    "Other": "They could just give us Amazon links to all the books per module",
    "Zaltys": "Not going to happen.",
    "timestamp": "2021-09-25T04:35:31.006000+00:00",
    "date": "m09-d25"
  },
  {
    "Other": "I really hope then that Latitude was half assed enough to have 1/3rd of their dataset be duplicates then",
    "Zaltys": "I remember seeing some stories thrice in there. (No wonder they got overtrained.)",
    "timestamp": "2021-09-25T04:23:15.525000+00:00",
    "date": "m09-d25"
  },
  {
    "Other": "It was a joke.",
    "Zaltys": "Such jokes tend to get taken out of context.",
    "timestamp": "2021-09-25T04:19:34.582000+00:00",
    "date": "m09-d25"
  },
  {
    "Other": "Wait, is that really going to be a thing?",
    "Zaltys": "See https://discord.com/channels/836774308772446268/877268798409953370/883046452815867994\nAnd by long term, he means _long term_.",
    "timestamp": "2021-09-25T04:17:08.158000+00:00",
    "date": "m09-d25"
  },
  {
    "Other": "Too many of those",
    "Zaltys": "Will be heavily standardized in future versions. Then `***` should be only common one left in the data. Though rarer ones may still occasionally leak from the Pile itself.",
    "timestamp": "2021-09-23T14:31:00.081000+00:00",
    "date": "m09-d23"
  },
  {
    "Other": "My Sigurd seems to be determined to resurrect the space pirate who died a gory death as stated in his LB.",
    "Zaltys": "Try putting the `X died in <details>.` on a separate row, right after the main entry. Tends to work for me.",
    "timestamp": "2021-09-23T10:16:16.604000+00:00",
    "date": "m09-d23"
  },
  {
    "Other": "I never got to experience prime Dragon, so reading excerps like this is such a treat",
    "Zaltys": "There was also this instance where I played as a mage and cast a mouse-tornado: ```The tornado bursts forth. The hundreds of squeaks form a single roar of unearthly sound, which blows the mice forth. They tumble through the air, spinning like tiny tops. They hit the mercenaries with a fury of claws, biting and scratching.\nThe rats are upon them, tearing them apart. The mercenaries struggle to fight off the tiny beasts. One loses a finger to a mouse's teeth, before smashing it against the wall in rage only for two more to tear out his eyes. They're drowning them, swarming over them like an army of lemmings, millions strong.\nThe mouse-rain swirls around you, not a single one touching you. You are the eye of the storm. The whirlwind of claws and teeth moves with your will, obeying your commands as you pick off the stragglers.``` Yep, let's just say that early Dragon was great. Shame that it got ruined.",
    "timestamp": "2021-09-19T15:34:42.216000+00:00",
    "date": "m09-d19"
  },
  {
    "Other": "It knows about Covid",
    "Zaltys": "Yep. Finetuning team doesn't overlook new books, and Covid's been kind of influental recently.\nhttps://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1591543383l/53883148._SY475_.jpg",
    "timestamp": "2021-09-17T04:26:24.231000+00:00",
    "date": "m09-d17"
  },
  {
    "Other": "Would that be because the AI is reading \"Finland Capital = X = Capital Finland\" and it ends up just outputting the last of its logic train.",
    "Zaltys": "Maybe from something like `Helsinki, the capital of Finland is Finland's largest...`",
    "timestamp": "2021-09-16T07:22:15.193000+00:00",
    "date": "m09-d16"
  },
  {
    "Other": "So, 0.992 is like a \"thin\" slice off.",
    "Zaltys": "It's worth noting that it's rarely the 'worst' slice, though. Some of the worst generations can be pretty high. For instance, I remember `'Finland'` being high on the list for `The capital of Finland is ___`.",
    "timestamp": "2021-09-16T07:18:23.247000+00:00",
    "date": "m09-d16"
  },
  {
    "Other": "Finetuning?",
    "Zaltys": "Yep. My main job is collecting and cleaning material for the dataset, so we have something to use for building models.",
    "timestamp": "2021-09-10T06:55:11.200000+00:00",
    "date": "m09-d10"
  },
  {
    "Other": "Should I put that in the wiki?",
    "Zaltys": "I don't actually have editing permissions for the wiki, so sure. There's a few other things I've been meaning to fix too, but don't remember them offhand.",
    "timestamp": "2021-09-10T06:23:56.873000+00:00",
    "date": "m09-d10"
  },
  {
    "Other": "But is there a curated list? Or at least some ordered compilation? Browsing prompt sharing is kinda unwieldy 😆",
    "Zaltys": "Yep. Even with the slow mode enabled, some users still post massive walls of text. Makes it hard to browse it. Module sharing wasn't really meant for that, only for sharing modules. <:shrug:332268181517238272>",
    "timestamp": "2021-09-09T11:37:24.300000+00:00",
    "date": "m09-d09"
  },
  {
    "Other": "Does anybody know if there's a superhero module? Tried to find it myself through search but there's alot of unrelated stuff in discord",
    "Zaltys": "There's an official one. Though I haven't seen any feedback about whether it was any good...",
    "timestamp": "2021-09-06T05:16:51.659000+00:00",
    "date": "m09-d06"
  },
  {
    "Other": "Now I HAVE to know",
    "Zaltys": "https://preview.redd.it/rk05vquhz5x31.png?width=1024&auto=webp&s=402a6b36c39caeccdd6c77c403a0dd919e927758",
    "timestamp": "2021-09-05T21:55:30.800000+00:00",
    "date": "m09-d05"
  },
  {
    "Other": "what's sparkledogs?",
    "Zaltys": "You're better off not knowing.",
    "timestamp": "2021-09-05T21:54:18.746000+00:00",
    "date": "m09-d05"
  },
  {
    "Other": "honestly, most OC are fuck awful for that reason",
    "Zaltys": "I mean, even 99% of furries agree that sparkledogs are awful.",
    "timestamp": "2021-09-05T21:53:35.872000+00:00",
    "date": "m09-d05"
  },
  {
    "Other": "Gen 8 had Cinderace",
    "Zaltys": "Obstagoon and Inteleon too.",
    "timestamp": "2021-09-05T21:52:02.029000+00:00",
    "date": "m09-d05"
  },
  {
    "Other": "at least even modern pokemon games have better design policy than your average furry oc",
    "Zaltys": "Hasn't stopped them from adding some stupid designs. Still, as was said, Pokemon has 'something for everyone'. Which explains part of the popularity.",
    "timestamp": "2021-09-05T21:50:16.950000+00:00",
    "date": "m09-d05"
  },
  {
    "Other": "The game looks interesting",
    "Zaltys": "It's also infinitely moddable. On best days, I ran Rimworld with 120+ mods at once.",
    "timestamp": "2021-09-05T21:49:11.533000+00:00",
    "date": "m09-d05"
  },
  {
    "Other": "I can probably do something about that",
    "Zaltys": "Please do. That's by far most annoying thing about NAI at the moment. I have to constantly fiddle with the mouse position to make the tooltips go away, so I can see what got generated.",
    "timestamp": "2021-09-04T21:39:06.640000+00:00",
    "date": "m09-d04"
  },
  {
    "Other": "https://tenor.com/view/well-yes-but-actually-no-well-yes-no-yes-yes-no-gif-13736934",
    "Zaltys": "Well, okay. Calliope's still there. But I can't think of any reason to use that model now.",
    "timestamp": "2021-09-01T07:20:37.686000+00:00",
    "date": "m09-d01"
  },
  {
    "Other": "From memory there were some doubts 2k context would be any good during alpha",
    "Zaltys": "Not surprising, considering that AID couldn't even remember things up to 1k. But NAI's recall does work all the way up to 2k, so the difference between 1k and 2k is massive.",
    "timestamp": "2021-09-01T01:56:26.408000+00:00",
    "date": "m09-d01"
  },
  {
    "Other": "adding ```[Author's Note: this is a story for children; Tags: light, sweet, adventure, childish; word choice: adapted to children. ]```  seem to reduce the amount of dark things happening and the usage of complicated metaphor",
    "Zaltys": "I wonder if v3 recognizes noblebright (opposite of grimdark.) I can't remember if it was used as a tag...",
    "timestamp": "2021-08-25T12:21:49.471000+00:00",
    "date": "m08-d25"
  },
  {
    "Other": "Combining sharing channels not a great idea",
    "Zaltys": "Combining other kinds of channels isn't great either. <#837792141765902386>'s gone downhill to the point that I ended up muting it. Kinda miss #music already.",
    "timestamp": "2021-08-24T23:12:37.244000+00:00",
    "date": "m08-d24"
  },
  {
    "Other": "what kind of elf are you talking about ? <:SurprisePika:586882713123029003>",
    "Zaltys": "https://images-na.ssl-images-amazon.com/images/I/41NtUWsD-pL._SY346_.jpg",
    "timestamp": "2021-08-19T11:51:41.357000+00:00",
    "date": "m08-d19"
  },
  {
    "Other": "Start with:\n`***`",
    "Zaltys": "`⁂` should work better in theory, but currently it tends to output things like `Chapter 1` too often. Maybe in next version...",
    "timestamp": "2021-08-18T21:25:50.102000+00:00",
    "date": "m08-d18"
  },
  {
    "Other": "<@343691170964045827> it really needs to be followed up with a multi module mode. Banging the text adventure module with, for example, the Lovecraft module",
    "Zaltys": "This would be a mishmash of two very different styles, probably wouldn't work well for either.",
    "timestamp": "2021-08-16T12:30:15.011000+00:00",
    "date": "m08-d16"
  },
  {
    "Other": "inactive channels were archived to avoid clutter",
    "Zaltys": "More like outright deleted, since they don't show up on search anymore. Shame, there were a few music videos I was planning to check out once I found time.",
    "timestamp": "2021-08-16T10:05:39.607000+00:00",
    "date": "m08-d16"
  },
  {
    "Other": "Literotica module. It went into a full \"list mode.\"",
    "Zaltys": "Had to try this myself. Here's girlfriend advice from an AI tank.",
    "timestamp": "2021-08-15T23:49:58.983000+00:00",
    "date": "m08-d15"
  },
  {
    "Other": "Can't you just delete the images from the PDF? 🤔",
    "Zaltys": "PDF isn't a text format. It requires conversion to text, and depending on the font etc the end result may be full of errors.",
    "timestamp": "2021-08-13T00:20:11.470000+00:00",
    "date": "m08-d13"
  },
  {
    "Other": "Couldn't you just use actual CYOA books?",
    "Zaltys": "Those are all pdfs. ...because images.",
    "timestamp": "2021-08-13T00:16:32.266000+00:00",
    "date": "m08-d13"
  },
  {
    "Other": "Think someone made a module for that already.",
    "Zaltys": "I was thinking more of the main dataset...",
    "timestamp": "2021-08-12T22:48:33.150000+00:00",
    "date": "m08-d12"
  },
  {
    "Other": "But I would have to translate all the AVGN episodes into prose",
    "Zaltys": "Ooh... That reminded me that all Zero Punctuation episodes are transcripted...",
    "timestamp": "2021-08-12T22:43:10.195000+00:00",
    "date": "m08-d12"
  },
  {
    "Other": "Browser hasn't cleared my cache in months. I don't know how common it is. I can't tell you how to prevent it, only to back your stuff up.",
    "Zaltys": "Like I mentioned in support, Chromium at least deletes older content whenever it adds new. It never fully empties the cache. So the more you browse, the faster it happens.",
    "timestamp": "2021-08-12T11:04:32.882000+00:00",
    "date": "m08-d12"
  },
  {
    "Other": "`* * *` is the bane of my existence. *Every time* when I test with NRT <:pepehands:838312017336336405>",
    "Zaltys": "A lot of those have been converted to `***` after v3, so at least that'll be greatly reduced in next versions. Whenever those happen.",
    "timestamp": "2021-08-10T23:21:51.090000+00:00",
    "date": "m08-d10"
  },
  {
    "Other": "So is that instead of `***` normal or a result of a module I am using?",
    "Zaltys": "And yes, this seems like a module problem.",
    "timestamp": "2021-08-10T23:13:09.537000+00:00",
    "date": "m08-d10"
  },
  {
    "Other": "I like how, despite `***` being the standard way of splitting scenes, the AI will sometimes spit out weird variations. One story I was messing around with today gave me `◆◇◆◇◆`",
    "Zaltys": "That's common in uncleaned LNs...",
    "timestamp": "2021-08-10T23:12:24.283000+00:00",
    "date": "m08-d10"
  },
  {
    "Other": "That must be it. I'm guessing The Pile has a bunch of continuously updating iterations",
    "Zaltys": "Not to mention the finetune.\nhttps://m.media-amazon.com/images/I/61t3KyzFx5L.jpg",
    "timestamp": "2021-08-10T09:35:27.253000+00:00",
    "date": "m08-d10"
  },
  {
    "Other": "what does the yellow and blue text mean when you start writing a story?",
    "Zaltys": "Depends on which theme you're using, but you can always check the settings (customization) to see which is which.",
    "timestamp": "2021-08-08T22:30:09.329000+00:00",
    "date": "m08-d08"
  },
  {
    "Other": "I think <Text> works, i read that at least yesterday",
    "Zaltys": "<>s are more for telepathy and such, but it might work for thoughts.",
    "timestamp": "2021-08-08T15:55:50.785000+00:00",
    "date": "m08-d08"
  },
  {
    "Other": "I wonder. Do any other countries have AI games like this not in English.",
    "Zaltys": "Nothing public, as far as I know. Though I've seen some attempts at Finnish model, etc. But that was GPT-2.",
    "timestamp": "2021-08-08T12:27:28.025000+00:00",
    "date": "m08-d08"
  },
  {
    "Other": "Offff, no superhero, spartan, alien, etc module",
    "Zaltys": "There's a Superheroes module in the core, though...",
    "timestamp": "2021-08-05T13:40:19.947000+00:00",
    "date": "m08-d05"
  },
  {
    "Other": "NAI runs badly on IOS because IOS bad",
    "Zaltys": "I'd rather use a 'bad' OS that lets me micromanage what apps are allowed to do, rather than one full of security holes. Not to mention all the useless junk that Android forces you to install and keep running, regardless of whether you need them.",
    "timestamp": "2021-08-04T13:26:47.359000+00:00",
    "date": "m08-d04"
  },
  {
    "Other": "do we have any idea what the goal of v4 will be so far besides just pruning out more crap?",
    "Zaltys": "More content, more support for franchises that didn't get included into v3. Even some textbooks and other nonfiction. Besides the cleans to the existing content, I've curated (and cleaned) minimum of 25 new books per day.",
    "timestamp": "2021-08-03T19:25:07.360000+00:00",
    "date": "m08-d03"
  },
  {
    "Other": "Some sadistic bastard decided not to add periods before `\"` in their short story",
    "Zaltys": "Edit: Wait, no. Misread that. Disregard.\n`\".` is UK style, but even most UK authors seem to use `.\"` nowadays, at least judging on what I've seen in the dataset.",
    "timestamp": "2021-08-03T05:27:44.803000+00:00",
    "date": "m08-d03"
  },
  {
    "Other": "sometimes the scanner wants to replace I's with /'s and 1's",
    "Zaltys": "`l` -> `|` is also common. There's probably a lot once you start looking for them, and they tend to leak.",
    "timestamp": "2021-07-31T08:27:21.716000+00:00",
    "date": "m07-d31"
  },
  {
    "Other": "What book is that lmao",
    "Zaltys": "Richard Morgan's.",
    "timestamp": "2021-07-27T21:23:43.261000+00:00",
    "date": "m07-d27"
  },
  {
    "Other": "how many for \"breasts that seem to defy gravity\"",
    "Zaltys": "Hm. Only one, and that's phrased as `breasts were not of the same epic proportions as those of her performing partner, but they were still cosmetic-standard enough to defy gravity`",
    "timestamp": "2021-07-27T21:23:08.444000+00:00",
    "date": "m07-d27"
  },
  {
    "Other": "do fantasy writers use \"child bearing hips\" to describe women?",
    "Zaltys": "Only 11 hits in the whole database for `child.?bearing hips`. Far less than I expected.",
    "timestamp": "2021-07-27T21:19:36.744000+00:00",
    "date": "m07-d27"
  },
  {
    "Other": "do fantasy writers use \"child bearing hips\" to describe women?",
    "Zaltys": "First hit from the data: ```[...] only two words left her mouth, \"Nice ass.\"\nWhich, well, was obviously true. At least call them 'child-bearing hips' or something, someone thought.```",
    "timestamp": "2021-07-27T21:14:42.631000+00:00",
    "date": "m07-d27"
  },
  {
    "Other": "I hope NAI trains their own model. Some days ago, when this channel takled about neox and 22B, a dev said something like \"we planned big things\", so i hope it's a own model. But that 100% speculation from me and probably not even near the truth.",
    "Zaltys": "What do you mean by 'own model? I mean, Calliope and Sigurd are NAI's own models.",
    "timestamp": "2021-07-24T16:17:30.104000+00:00",
    "date": "m07-d24"
  },
  {
    "Other": "We can't change the list of tokens that's used by the tokenizer, it's based on GPT-2 and is used for all of the base models until today. If you want a new list of tokens approach Eleuther with it but my last information is that it's not worth it and too much work",
    "Zaltys": "From what I've seen, most devs think that it'd be worth it. But yes, it'd take some work.",
    "timestamp": "2021-07-24T00:34:24.020000+00:00",
    "date": "m07-d24"
  },
  {
    "Other": "Would you be able to \"fix\" tokens🤔",
    "Zaltys": "Certainly. Just rewrite the tokenizer and make sure it include things like ' hairless' as single token. No idea if that'll ever get done, though.",
    "timestamp": "2021-07-24T00:16:14.270000+00:00",
    "date": "m07-d24"
  },
  {
    "Other": "It's interesting how the AI seems to pull random words from Lorebook entries. In my main character's entry I have \"She is Mizanelan\" as her country of origin. Granted, I probably could have been clearer, but I don't see how it would interpret that as a General's last name",
    "Zaltys": "Try `She is from Mizanela` instead.",
    "timestamp": "2021-07-24T00:12:39.823000+00:00",
    "date": "m07-d24"
  },
  {
    "Other": "So why does a blue haired anime swordsman show up whenever Sigurd is mentioned in a bobross prompt",
    "Zaltys": "Sigurd from Fire Emblem.",
    "timestamp": "2021-07-22T20:56:59.125000+00:00",
    "date": "m07-d22"
  },
  {
    "Other": "Idk, zalty and gen were pretty active in the community",
    "Zaltys": "I worked closely with some of the devs, that part isn't under NDA. The Zaltys-model for character generation, etc (though they never got around to implementing the fixes I sent for that.)",
    "timestamp": "2021-07-22T19:38:58.307000+00:00",
    "date": "m07-d22"
  },
  {
    "Other": "Does need it need to be \"Anthropomorphic\" or can it be \"Furry\" or \"Anthro\"?",
    "Zaltys": "After a quick check, I'd say that lowercase 'anthropomorphic' and 'anthro' appear most often, and are therefore most likely to work. Whereas 'furry'/'Furry' is way too ambiguous.\nThough furry novels don't seem to use any of those. It's just 'the squirrel', 'the cougar', etc.",
    "timestamp": "2021-07-22T05:12:40.172000+00:00",
    "date": "m07-d22"
  },
  {
    "Other": "Yes, I meant that the Magic Academy theme is probably trained entirely with Harry Potter",
    "Zaltys": "Nope. All themes use minimum of seven authors, most have more than dozen.",
    "timestamp": "2021-07-18T08:26:13.876000+00:00",
    "date": "m07-d18"
  },
  {
    "Other": "Can it do faces and bodies at all",
    "Zaltys": "Yeah, this tech isn't great at faces yet....\nFacesHQ can handle those, but it's kind of cheating since all it does is faces.",
    "timestamp": "2021-07-17T21:39:25.921000+00:00",
    "date": "m07-d17"
  },
  {
    "Other": "Nothing is on our computers only 😛",
    "Zaltys": "...I really should back up the finetuning data.",
    "timestamp": "2021-07-16T15:30:46.968000+00:00",
    "date": "m07-d16"
  },
  {
    "Other": "Is it just like DID or considered different?",
    "Zaltys": "Different. More related to the alien hand syndrome.",
    "timestamp": "2021-07-15T14:35:02.128000+00:00",
    "date": "m07-d15"
  },
  {
    "Other": "Wait please lol where can I find /aids/ I'm always seeing crops of it",
    "Zaltys": "Just Google it--\nUh, okay, don't. Look in 4chan.",
    "timestamp": "2021-07-15T09:16:48.325000+00:00",
    "date": "m07-d15"
  },
  {
    "Other": "to what?",
    "Zaltys": "`Crab, Snail, and Monkey`, evidently. I don't get the reference.",
    "timestamp": "2021-07-13T07:05:52.936000+00:00",
    "date": "m07-d13"
  },
  {
    "Other": "wait what does *** do",
    "Zaltys": "Strong paragraph break. Think of it as a beginning of a new chapter.",
    "timestamp": "2021-07-13T06:49:38.411000+00:00",
    "date": "m07-d13"
  },
  {
    "Other": "Suppose that will be the case for the upcoming module training feature on opus too, huh?",
    "Zaltys": "Yep, same problems with that.",
    "timestamp": "2021-07-12T17:42:30.511000+00:00",
    "date": "m07-d12"
  },
  {
    "Other": "I guess training it on Neuromancer and Snow Crash isn't enough?",
    "Zaltys": "They weren't. I think you'd need to prune them down to pure cyberpunk. Too many action scenes etc (in Snow Crash.) And pruning those would take a lot of time.",
    "timestamp": "2021-07-12T17:39:32.957000+00:00",
    "date": "m07-d12"
  },
  {
    "Other": "is an official cyberpunk theme planned?",
    "Zaltys": "The thing about cyberpunk is that it's hard to find anything that's all-cyberpunk-all-time. There was already an attempt at cyberpunk module, but it just wasn't focused enough.",
    "timestamp": "2021-07-12T17:36:43.633000+00:00",
    "date": "m07-d12"
  },
  {
    "Other": "i'm assuming the artificial intelligence theme is appropriate for cyberpunk scenarios?",
    "Zaltys": "That's likely to work best for Cyberpunk out of the current set, yes.",
    "timestamp": "2021-07-12T17:34:19.277000+00:00",
    "date": "m07-d12"
  },
  {
    "Other": "Is NAI that much better at first person than second?",
    "Zaltys": "NAI is mostly trained on novels. About 99.5% of novels are first or third person.",
    "timestamp": "2021-07-10T22:17:36.223000+00:00",
    "date": "m07-d10"
  },
  {
    "Other": "it's more a web manga, or is it manwha?   But anyone read gamer?",
    "Zaltys": "Interesting premise, but too slow-paced for my tastes. I'd rather read LitRPGs.",
    "timestamp": "2021-07-10T16:13:08.433000+00:00",
    "date": "m07-d10"
  },
  {
    "Other": "i loved the idea of worlds and that you could let the AI generate the entries!",
    "Zaltys": "But they were so bad... and the AI never used them on its own...",
    "timestamp": "2021-07-09T22:03:51.717000+00:00",
    "date": "m07-d09"
  },
  {
    "Other": "So now you don’t test anything anymore? 🙂",
    "Zaltys": "I'm in charge of the dataset organizing and cleaning, along with Belverk. No time for testing, at least for a couple of months.",
    "timestamp": "2021-07-09T11:34:09.947000+00:00",
    "date": "m07-d09"
  },
  {
    "Other": "Precisely why I wrote `nrt`.",
    "Zaltys": "Yeah, I wish I had something like that back then...",
    "timestamp": "2021-07-09T11:31:32.368000+00:00",
    "date": "m07-d09"
  },
  {
    "Other": "unless you want the AI to spit out more information in the form of a wiki",
    "Zaltys": "That too. Mostly it's the things like links and footnotes that get in the way. Including those messes up the output completely.",
    "timestamp": "2021-07-09T10:10:48.162000+00:00",
    "date": "m07-d09"
  },
  {
    "Other": "Also, who tries 100 times for 1 sentence though LMAO",
    "Zaltys": "Uh... I used to test pretty much everything at least 50 times before posting results. Every single writing style, etc. It's basic statistics: can't draw any conclusions from a couple of results.",
    "timestamp": "2021-07-09T09:38:12.865000+00:00",
    "date": "m07-d09"
  },
  {
    "Other": "youre free to write as much fucked up shit as you want",
    "Zaltys": "Right. Because US signed the international Human Rights Act of 1998, which protects written texts. Any laws that'd try to restrict that wouldn't hold in higher courts.",
    "timestamp": "2021-07-09T09:19:52.568000+00:00",
    "date": "m07-d09"
  },
  {
    "Other": "I think they might have some value for retro fans so I'd expect them to be way more expensive.",
    "Zaltys": "Not to mention the component prices. You could sell them for scrap for more than $25. There's a lot of value metals in those.",
    "timestamp": "2021-07-08T23:27:13.696000+00:00",
    "date": "m07-d08"
  },
  {
    "Other": "Are there any issues with sourcing text from two completely different styles to try to blend them, like teletubbies with eldritch abominations, or slice of life with epic fantasy?",
    "Zaltys": "From what I've seen, one style tends to easily overweight the other. So things like crossovers will require major balancing to get working, sadly.",
    "timestamp": "2021-07-08T10:31:10.727000+00:00",
    "date": "m07-d08"
  },
  {
    "Other": "That's still pretty good, if a decent prefix just needs to be a little over 1 tolkien book.",
    "Zaltys": "It's still a lot if you're trying to build a niche prefix. Good luck finding 1MB data of kobolds, for instance.",
    "timestamp": "2021-07-08T10:21:52.326000+00:00",
    "date": "m07-d08"
  },
  {
    "Other": "<@!409511804293611530> What kinda stuff is Naval trained on?",
    "Zaltys": "Mostly Age of Exploration era, with some fantasy thrown in.",
    "timestamp": "2021-07-08T10:10:52.314000+00:00",
    "date": "m07-d08"
  },
  {
    "Other": "<@!409511804293611530> Is Magic Library the short story from Borges I am thinking of?",
    "Zaltys": "Yawn. Sorry for late reply, just woke up. Anyway, that's not what Magical Library is based on; it would've been far too short. It's a mix of various content in that style.",
    "timestamp": "2021-07-08T08:38:10.798000+00:00",
    "date": "m07-d08"
  },
  {
    "Other": "Wasn't it also overfitted to hell? Like, you need more content than what they gave it.",
    "Zaltys": "And it probably didn't help that some of that content was repeated thrice...",
    "timestamp": "2021-07-07T14:29:03.170000+00:00",
    "date": "m07-d07"
  },
  {
    "Other": "I'm on the sub and a guy has his horses talking out of the blue",
    "Zaltys": "This is hardly unexpected, as Sigurd is trained on fantasy. Talking animals are more common than normal ones. To negate that, we'd need a different model that's trained on nonfiction.",
    "timestamp": "2021-07-03T07:43:02.021000+00:00",
    "date": "m07-d03"
  },
  {
    "Other": "I remember Fighting Fantasy having half decent 2nd person writing when I was a youngster.",
    "Zaltys": "Oof. Reordering those into logical order would be a major headache. But if someone wants to do the work, we can add it.",
    "timestamp": "2021-06-29T21:57:13.107000+00:00",
    "date": "m06-d29"
  },
  {
    "Other": "V2 was actually on par with Dragon when it comes to second person imo",
    "Zaltys": "I don't know how that'd be possible, considering that Sigurd's mostly trained on novels. And second person isn't exactly common in those.",
    "timestamp": "2021-06-29T21:55:08.623000+00:00",
    "date": "m06-d29"
  },
  {
    "Other": "The fuck are these stats?\n```Name: Charmander (Char-mend)Species: Charizard (Kyara jishu, fire lizard)Level: 8HP: 48DP: 24SP: 56ATK: 180DEF: 120MND: 32AGI: 45LUK: 30Resistance```",
    "Zaltys": "Shouldn't be anything like that in the data, so it might be from the base. Gonna run a search just in case, though... Edit: Nope, not a single instance of `LUK:`.",
    "timestamp": "2021-06-29T07:16:59.871000+00:00",
    "date": "m06-d29"
  },
  {
    "Other": "But... will there be >6B and <21B version?",
    "Zaltys": "Doesn't sound like it.",
    "timestamp": "2021-06-27T15:50:37.893000+00:00",
    "date": "m06-d27"
  },
  {
    "Other": "Speaking of models, 23B is estimated to take 6 - 12 months",
    "Zaltys": "Except they're not planning to train it on TPU. If the Coreweave agreement goes through, it'll be much, much faster.",
    "timestamp": "2021-06-27T15:41:23.257000+00:00",
    "date": "m06-d27"
  },
  {
    "Other": "Optimism is great but..",
    "Zaltys": "```[3:22 PM] Connor: Again, depends on the hardware\n[3:23 PM] Connor: We are working with CoreWeave to build a cutting edge GPU supercluster\n[3:23 PM] Connor: But the chip shortage is affecting the whole industry, so lead times are long\n[3:23 PM] Connor: If you had a whole NVIDIA superPOD it could be done in like 2 months\n[3:23 PM] Connor: but those things don't come easy lol\n[3:24 PM] Connor: So until we know when our hardware will arrive and how much it'll be, we cannot commit to any timelines\n[3:24 PM] Purple: 2 months for a 20B or 200B?\n[3:24 PM] Connor: 200B``` If they had hardware, they could start training 200B right now, and it'd be done in two months.",
    "timestamp": "2021-06-27T15:34:06.444000+00:00",
    "date": "m06-d27"
  },
  {
    "Other": "My bet's that we get open source models upwards of 100B within two years",
    "Zaltys": "That'd be a safe bet.",
    "timestamp": "2021-06-27T15:27:51.559000+00:00",
    "date": "m06-d27"
  },
  {
    "Other": "I was wondering about that, too! Thanks for bringing it up, I'll mention it to admins",
    "Zaltys": "It's been more hindrance than anything else. I would've deleted my old entries from there if I could (those are badly outdated, poor examples of how to write submitted data), but since it's locked I can't edit/delete those. So we've got some submissions in outdated format...",
    "timestamp": "2021-06-27T09:36:29.529000+00:00",
    "date": "m06-d27"
  },
  {
    "Other": "Okay but why not \n\nThe Lusty Argonian Maid",
    "Zaltys": "It's in, of course it is.",
    "timestamp": "2021-06-26T22:45:47.981000+00:00",
    "date": "m06-d26"
  },
  {
    "Other": "I don't think the mere MENTION of boobs is NSFW",
    "Zaltys": "Only in some weird countries.",
    "timestamp": "2021-06-26T10:51:20.562000+00:00",
    "date": "m06-d26"
  },
  {
    "Other": "You don't mean ttrpg handbooks, do you?",
    "Zaltys": "Nah, those have already been formatted into something usable.",
    "timestamp": "2021-06-25T14:42:12.458000+00:00",
    "date": "m06-d25"
  },
  {
    "Other": "Oh btw talking about references\nDid you include JoJo?",
    "Zaltys": "Couple of random characters got thrown in. I think Lisa Lisa was one of them. But I'm not too familiar with JoJo, and we didn't get any user submissions for it, so...",
    "timestamp": "2021-06-21T13:32:20.600000+00:00",
    "date": "m06-d21"
  },
  {
    "Other": "just insert stuff from bulbapedia",
    "Zaltys": "That's already in, and any other lore I could find. But it's a drop in the ocean.",
    "timestamp": "2021-06-21T13:28:46.684000+00:00",
    "date": "m06-d21"
  },
  {
    "Other": "I think we need more Pokemon in the data <:VapSip:715183545743835237>",
    "Zaltys": "There's a problem with that. No official novelizations, etc. And using fanfictions put too much weight on limited species/characters. Nobody wants Ash Ketchum to pop up every time you mention Pokemon.",
    "timestamp": "2021-06-21T13:27:43.560000+00:00",
    "date": "m06-d21"
  },
  {
    "Other": "i assume it doesn't know postal\nsad",
    "Zaltys": "Doesn't look like it. I submitted a collection of data for 1000 games, but Postal's not on it. Not to mention that it probably didn't make it into Sigurd anyway, submitted it too late.",
    "timestamp": "2021-06-20T14:23:15.137000+00:00",
    "date": "m06-d20"
  },
  {
    "Other": "how much does the game recognize popular media so far? games, movies, comics, tv etc",
    "Zaltys": "Depends heavily on the franchise. The most popular ones got included at least, thanks to user-submitted data.",
    "timestamp": "2021-06-20T14:21:24.962000+00:00",
    "date": "m06-d20"
  },
  {
    "Other": "Zaltys, I remember you from the AiDungeon Discord server.",
    "Zaltys": "Yep. And now I'm on NAI team instead.",
    "timestamp": "2021-06-19T21:31:10.857000+00:00",
    "date": "m06-d19"
  },
  {
    "Other": "Because there is a desire for NSFW degen content as well as clean stuff. Make it seperable and tuned for exactly what you want",
    "Zaltys": "That's not possible, as the data is in the base model. That was probably from Game of Thrones or something, the AI doesn't know the difference.",
    "timestamp": "2021-06-19T21:30:15.395000+00:00",
    "date": "m06-d19"
  },
  {
    "Other": "He is trying to join my party while stealing my soul",
    "Zaltys": "Raise Top-K and Randomness. Repetition penalty doesn't seem to do much by itself if it's already stuck.",
    "timestamp": "2021-06-19T18:58:09.405000+00:00",
    "date": "m06-d19"
  },
  {
    "Other": "But yeah when we reopen for finetune submissions I expect most additions people suggest will get rejected",
    "Zaltys": "Suggestions have been high quality for the most part, and I'd be happy to receive more if they're of the same quality.\nThe problem's mostly the original collection.",
    "timestamp": "2021-06-19T06:13:42.752000+00:00",
    "date": "m06-d19"
  },
  {
    "Other": "anyone know what tail-free sampling specifically does? what does having it at 0.95 or 0.05 mean? tooltip is extra vague and doesn't tell you which way it works",
    "Zaltys": "0.95 strips the worst 5% of the tokens, iirc. So 0.05 would prune 95%.",
    "timestamp": "2021-06-18T15:56:00.859000+00:00",
    "date": "m06-d18"
  },
  {
    "Other": "<@!409511804293611530> Great oracle, does it read multiple tags? Separated by commas? Is there a list of what tags/authors/genres Sigurd uses? Is this too many questions? Are you busy?",
    "Zaltys": "Yes, yes, no, no, yes.",
    "timestamp": "2021-06-18T15:52:24.513000+00:00",
    "date": "m06-d18"
  },
  {
    "Other": "I thought the next big model was like 170-something B",
    "Zaltys": "13B and 20B, judging by their directory structure. Not that they tend to announce what they're training.",
    "timestamp": "2021-06-18T15:48:13.629000+00:00",
    "date": "m06-d18"
  },
  {
    "Other": "You could try using prose. Zaltys said \n`Author: \nGenre: \nTags:`\nare the format it interprets now. Also give this a read if you have the patience. https://naidb.miraheze.org/wiki/Advanced_Writing#Advanced_Writing",
    "Zaltys": "Only for Sigurd, though. I don't think any were tagged back when Calliope was finetuned.",
    "timestamp": "2021-06-18T15:24:31.284000+00:00",
    "date": "m06-d18"
  },
  {
    "Other": "is it better to go with \"I\" or \"you\" entries?",
    "Zaltys": "Definitely first person. This was trained mostly on novels, and 'you' is rare in those. (Actually, I haven't found a single work written in second person yet, going through the dataset.)",
    "timestamp": "2021-06-17T17:30:59.651000+00:00",
    "date": "m06-d17"
  },
  {
    "Other": "What are you recommending now?",
    "Zaltys": "Dunno. I spend 100% of my time on data, haven't had time to actually 'play' NAI.",
    "timestamp": "2021-06-17T17:29:35.096000+00:00",
    "date": "m06-d17"
  },
  {
    "Other": "Zalty, using your setting but... Might need to be updated a bit.",
    "Zaltys": "That was long ago. Not my fault if users still recommend it.",
    "timestamp": "2021-06-17T17:29:07.626000+00:00",
    "date": "m06-d17"
  },
  {
    "Other": "For influencing the genre you should put something like this in the Author Notes: [Genre: Genre here.]",
    "Zaltys": "Spacing is recommended: `[ Genre: ___ ]`, as that's used a lot more in the data.",
    "timestamp": "2021-06-17T10:47:50.161000+00:00",
    "date": "m06-d17"
  },
  {
    "Other": "What's the difference between steampunk and cyberpunk?",
    "Zaltys": "1800s versus 2100s. One features steam, brass, and airships, the other cyberware and hacking.",
    "timestamp": "2021-06-17T10:23:03.329000+00:00",
    "date": "m06-d17"
  },
  {
    "Other": "Aw. I really liked forcing eloquent writing styles on the AI",
    "Zaltys": "You pretty much have to do that by writing in the style yourself, and letting the AI copy it.",
    "timestamp": "2021-06-17T07:23:29.751000+00:00",
    "date": "m06-d17"
  },
  {
    "Other": "Is anybody else noticing the AI cutting off it's sentences? My maximum output length is 51 tokens and my minimum output is 20 tokens. I'm using Calliope.",
    "Zaltys": "Check the `Trim AI Responses` setting.",
    "timestamp": "2021-06-17T04:13:32.854000+00:00",
    "date": "m06-d17"
  },
  {
    "Other": "Wouldn't that cause issues with names? Or nah?",
    "Zaltys": "It's either that, or looping. Whichever you can live with, I suppose.",
    "timestamp": "2021-06-17T03:55:32.370000+00:00",
    "date": "m06-d17"
  },
  {
    "Other": "So I guess we're back to having to figure out best practices for NAI then?",
    "Zaltys": "The base data is different, and the finetune on top of that is definitely different. So yes, format testing will need to be started from zero. I'd suggest sticking to regular prose until larger models.",
    "timestamp": "2021-06-15T21:20:50.558000+00:00",
    "date": "m06-d15"
  },
  {
    "Other": "Since token limit isn't a problem, we should probably focus on finding keywords for characters and writing style. Tried doing some testing with these https://justpaste.it/9ofj1 but so far the only one that seemed to make a difference for me was \"reverie\"",
    "Zaltys": "I'd suggest testing `Genre:` or `Tags:` instead of `(Writing) style:`.",
    "timestamp": "2021-06-15T21:18:05.964000+00:00",
    "date": "m06-d15"
  },
  {
    "Other": "So it's likely zaltys format will work in NAI?",
    "Zaltys": "It might work to some degree, but there's no reason to use it here. It was built for saving character space, but NAI is entirely token-based so that's pointless here. You don't need to shorten words. Rather, I'd try something more along these lines - https://discord.com/channels/836774308772446268/837581164436258837/853315205274665000\n(Though that's equally untested.)",
    "timestamp": "2021-06-15T21:07:45.454000+00:00",
    "date": "m06-d15"
  },
  {
    "Other": "It’s the same dataset",
    "Zaltys": "Sure, but that doesn't mean that 2.7B is able to understand it well enough.",
    "timestamp": "2021-06-13T21:15:20.490000+00:00",
    "date": "m06-d13"
  },
  {
    "Other": "No doubt",
    "Zaltys": "Well, 2.7B might not. But the larger ones probably will.",
    "timestamp": "2021-06-13T21:13:34.510000+00:00",
    "date": "m06-d13"
  },
  {
    "Other": "325 Fahrenheit? Isn't that extremely hot?",
    "Zaltys": "Not for oven. That's only 162 Celcius, I generally use 180-200.",
    "timestamp": "2021-06-13T14:04:26.127000+00:00",
    "date": "m06-d13"
  },
  {
    "Other": "From the finetune material",
    "Zaltys": "Working on it here too. With 15K works, it's not exactly one-day project.",
    "timestamp": "2021-06-13T13:51:39.284000+00:00",
    "date": "m06-d13"
  },
  {
    "Other": "What the colour scheme in the output (specifically <#853095350038167552> )? Pink = input of the user?",
    "Zaltys": "Different in each theme. Come to think about it, that's a bit confusing. But ah well.",
    "timestamp": "2021-06-12T14:55:36.841000+00:00",
    "date": "m06-d12"
  },
  {
    "Other": "I believe the Eai boys are working on a 20b model next but this is like 3rd hand information lol.",
    "Zaltys": "I'm pretty sure they're planning 13B model first.",
    "timestamp": "2021-06-12T10:54:42.146000+00:00",
    "date": "m06-d12"
  },
  {
    "Other": "took me ages to get back off the ground.",
    "Zaltys": "You probably shouldn't be on Discord, then. If it hurts that much after the fall, then it's pretty bad.\nI mean, when I broke my ribs last year, it didn't even start hurting until after ~10 minutes. Could still get up and walk around for a while, enough to get into emergency.",
    "timestamp": "2021-06-12T09:35:53.395000+00:00",
    "date": "m06-d12"
  },
  {
    "Other": "Horus is the god of knowledge",
    "Zaltys": "Thoth?",
    "timestamp": "2021-06-11T21:58:40.230000+00:00",
    "date": "m06-d11"
  },
  {
    "Other": "Muses and demigods makes way more sense",
    "Zaltys": "Either way, those will get pretty hard to remember once there are more models.\nUnintuitive compared to OpenAI's naming system (which is alphabetical. Ada, Babbage, Curie, Davinci...)",
    "timestamp": "2021-06-11T21:40:46.574000+00:00",
    "date": "m06-d11"
  },
  {
    "Other": "btw how does the token ban list work with words that contain multiple tokens?",
    "Zaltys": "It doesn't block words, it blocks tokens. If you add a 'word', it'll add the tokens from that word to the list.",
    "timestamp": "2021-06-11T08:46:30.378000+00:00",
    "date": "m06-d11"
  },
  {
    "Other": "actually, dumb question, but does finetuning remove the default stuff or add on top of it",
    "Zaltys": "Hm. Let's say that it _adjusts_ the existing data. That's probably the easiest way to explain it.",
    "timestamp": "2021-06-10T08:27:27.869000+00:00",
    "date": "m06-d10"
  },
  {
    "Other": "We'd use the same finetuning data",
    "Zaltys": "No, we'll use improved data. There's some things that larger models can handle better.",
    "timestamp": "2021-06-10T08:25:13.014000+00:00",
    "date": "m06-d10"
  },
  {
    "Other": "Is the collection of novels it's trained on pretty exclusively \"respectable\" fiction or do we have genres represented too?",
    "Zaltys": "If you mean finetuning solely on Gutenberg and other 'classics'? Urgh, no. We don't want an AI that talks like it's out of 1800s. There's plenty of variety.",
    "timestamp": "2021-06-08T20:08:57.275000+00:00",
    "date": "m06-d08"
  },
  {
    "Other": "For me Dragon did great sarcasm",
    "Zaltys": "Two scientists, talking about which animals to uplift.",
    "timestamp": "2021-06-07T17:38:18.058000+00:00",
    "date": "m06-d07"
  },
  {
    "Other": "Rogue could be a character in Star Wars, Warhammer, Marvel, and, DC.",
    "Zaltys": "...or even Sonic. (Considering how often Rouge gets misspelled.)",
    "timestamp": "2021-06-07T17:28:20.022000+00:00",
    "date": "m06-d07"
  },
  {
    "Other": "also btw if <|startoftext|> happens to be at the beginning of every AID [user] story I'm going to <:KEKW:627956889086591024>",
    "Zaltys": "Thanks for the reminder. I need to check the dataset to make sure nobody sneaked that in.",
    "timestamp": "2021-06-06T16:13:06.629000+00:00",
    "date": "m06-d06"
  },
  {
    "Other": "is the ai being finetuned with other languages?",
    "Zaltys": "Each additional language would make it worse at English, so no.",
    "timestamp": "2021-06-06T16:02:58.516000+00:00",
    "date": "m06-d06"
  },
  {
    "Other": "No, that's probably tokenization, because the AI reads Anthony as Ant|hony.",
    "Zaltys": "No, Anthony is single token. No idea why that'd get shortened.",
    "timestamp": "2021-06-06T07:54:09.985000+00:00",
    "date": "m06-d06"
  },
  {
    "Other": "oh, it gets removed if it drops below 1",
    "Zaltys": "...drops below 1, when 1 is the minimum rating? How?",
    "timestamp": "2021-06-05T12:20:26.319000+00:00",
    "date": "m06-d05"
  },
  {
    "Other": "I can do a fairly easy text scraper and run it through the list, then just mass search on a novel index and scrape the authors names",
    "Zaltys": "Scrape the author names from where? The file names aren't standardized, due to multiple uploaders. And we've pruned those from the text itself.",
    "timestamp": "2021-06-05T08:46:25.572000+00:00",
    "date": "m06-d05"
  },
  {
    "Other": "<@!409511804293611530> How hard would it be to scrape the current list and add an author tag into the data?",
    "Zaltys": "I can't think of any way to do that, except by doing it manually. And considering the size of the collection at this point, it'd be quite a project.",
    "timestamp": "2021-06-05T08:44:17.028000+00:00",
    "date": "m06-d05"
  },
  {
    "Other": "*speaking of finetuning, hows it going?*",
    "Zaltys": "It's going. I haven't done much else for a month, still a lot that I'd like to add... but the important data is in.",
    "timestamp": "2021-06-05T06:06:11.481000+00:00",
    "date": "m06-d05"
  },
  {
    "Other": "A story where I'm a sentient exploration spaceship",
    "Zaltys": "Well, good that I added sentient spaceships to the finetuning material, then. Though 2.7B is probably too small for that, might have to wait for 6B.",
    "timestamp": "2021-06-01T17:21:43.436000+00:00",
    "date": "m06-d01"
  },
  {
    "Other": "Best thing for character details atm would be a dense WI format like Zaltys.",
    "Zaltys": "Dunno about that. My formats were built to cram as much data as possible into the character limit. Since NAI uses token limit instead, there's several things I'd do differently.",
    "timestamp": "2021-06-01T04:49:54.226000+00:00",
    "date": "m06-d01"
  },
  {
    "Other": "managed to find some pokemon at least so it knows pop culture, I guess.",
    "Zaltys": "It will know that species _x_ is a pokemon, but it will not be able to accurately (or consistently) describe them.",
    "timestamp": "2021-05-29T21:33:06.583000+00:00",
    "date": "m05-d29"
  },
  {
    "Other": "<@!804869431431528479> we have already got it, just needs a tweak\n\nhttps://cdn.discordapp.com/attachments/837402685824565278/848117534661541918/unknown.png",
    "Zaltys": "As a collector, seeing that makes me cringe. Poor book.",
    "timestamp": "2021-05-29T10:14:57.532000+00:00",
    "date": "m05-d29"
  },
  {
    "Other": "having 'say' is kinda redundant when you can just type: I say \"this\".",
    "Zaltys": "Not to mention that formatting it that way leads to poor quality output. `\"[...]\", Zak says.` is used far more in fiction.",
    "timestamp": "2021-05-29T08:42:09.542000+00:00",
    "date": "m05-d29"
  },
  {
    "Other": "I was just going to play Mass Effect. lol",
    "Zaltys": "That gave me an idea... I'm gonna grab the species from the Mass Effect tabletop game and submit those. Since the wiki scrape isn't working out.",
    "timestamp": "2021-05-25T03:48:29.042000+00:00",
    "date": "m05-d25"
  },
  {
    "Other": "Know the word count for 30mb?",
    "Zaltys": "5.6 million.",
    "timestamp": "2021-05-23T19:47:04.579000+00:00",
    "date": "m05-d23"
  },
  {
    "Other": "some guy used special chars on aid and actually managed to get to 1800+ tokens in lmi within the char limit. guess they didn't actually put a token limit in place",
    "Zaltys": "That was pretty easy to do with single-character tokens. But as far as I could tell in my tests, it got pruned at some point. Sure, it showed up in the LMI, but AI would completely ignore everything over 1024 tokens. ...or at least I couldn't get it to react to those.",
    "timestamp": "2021-05-22T15:10:35.788000+00:00",
    "date": "m05-d22"
  },
  {
    "Other": "Any roman stuff like I, Claudius?",
    "Zaltys": "There might be something, but none that I remember offhand. We didn't have much time to collect material for the first finetune, some things likely got missed. ...Flashman would've been good for Adventure. Maybe for larger models...",
    "timestamp": "2021-05-22T14:04:43.833000+00:00",
    "date": "m05-d22"
  },
  {
    "Other": "I wonder if throwing some historical fiction into the finetune would be a good idea (if they didn't do that already.)\nLike <https://en.wikipedia.org/wiki/Romance_of_the_Three_Kingdoms> or <https://en.wikipedia.org/wiki/The_Three_Musketeers>",
    "Zaltys": "_Romance of the Three Kingdoms_ was already added. As was _Journey to the West_ and _Legend of the Condor Heroes_.",
    "timestamp": "2021-05-22T13:58:54.181000+00:00",
    "date": "m05-d22"
  },
  {
    "Other": "how would it perform if you asked it to program something in python?",
    "Zaltys": "```print(\"{}\", name)\nif __name__ == '__main__':\n    import sys\n    if len(sys.argv)!= 2:\n        print(\"Please specify a name or directory path\")\n    else:\n        rootdir = os.getcwd()\n        file = open(\"file.txt\", \"w+\")\n        file.write(\"Name: {0}\".format(name))\n        file.close()\n        print(\"You have created your first project.\" + \"\\n\")```  <:shrug:332268181517238272>",
    "timestamp": "2021-05-21T20:37:02.172000+00:00",
    "date": "m05-d21"
  },
  {
    "Other": "What does boosting a discord server do anyway?",
    "Zaltys": "Not much. Extra emoji, better audio quality... And 30 boosts is the cap, so the current 42 is excessive.",
    "timestamp": "2021-05-20T14:00:59.064000+00:00",
    "date": "m05-d20"
  },
  {
    "Other": "Will author's notes have similar functionality in NovelAI or were they a result from the fanfiction used to train AID's models?",
    "Zaltys": "These are likely from the Pile itself. A lot of novels have author's notes, after all.",
    "timestamp": "2021-05-18T18:18:47.818000+00:00",
    "date": "m05-d18"
  },
  {
    "Other": "where can i find the link to the python",
    "Zaltys": "Just follow the instructions in https://github.com/KoboldAI/KoboldAI-Client; it has links to everything you need.",
    "timestamp": "2021-05-17T06:55:50.474000+00:00",
    "date": "m05-d17"
  },
  {
    "Other": "It's primarily novels and light novels, correct?",
    "Zaltys": "As far as I know, yes.",
    "timestamp": "2021-05-11T20:52:49.819000+00:00",
    "date": "m05-d11"
  },
  {
    "Other": "actually here's a thought; are there any mystery/detective novels in the training data?",
    "Zaltys": "Of course there are. There's over 230,000 books in the Pile. But if you mean finetuning, then not a lot. This model focused on Adventure, not Mystery.",
    "timestamp": "2021-05-11T20:48:08.235000+00:00",
    "date": "m05-d11"
  },
  {
    "Other": "I wonder how much of Brandon Sanderson's material is in the training data",
    "Zaltys": "~65 books (in the Pile). I'm not gonna count how many of those are duplicates.",
    "timestamp": "2021-05-11T20:45:21.797000+00:00",
    "date": "m05-d11"
  },
  {
    "Other": "I assume the NAI's AI will be fed some anthropomorphic animal stuff though? It would be neat if so.",
    "Zaltys": "I think some anthro novels got in, but don't quote me on that. Alan Dean Foster (Spellsinger series), and some more obscure books.",
    "timestamp": "2021-05-11T20:16:56.434000+00:00",
    "date": "m05-d11"
  },
  {
    "Other": "They could even make them accessible for the users",
    "Zaltys": "This would be a good idea. ...if the users can see how hard it is to set a good balance for that, maybe there'll be less complains about the AI being 'too repetitive'.",
    "timestamp": "2021-05-11T08:19:56.750000+00:00",
    "date": "m05-d11"
  },
  {
    "Other": "I wonder, for those who have toyed with GPT-Neo, would you say it's capable of keeping track of comparisons consistently? For example, someone being taller than another and referencing it.",
    "Zaltys": "This is more of an issue with the tokenizer, as it chops up some of the numbers which makes them ~~hard~~ impossible for the AI to compare.",
    "timestamp": "2021-05-10T18:01:50.871000+00:00",
    "date": "m05-d10"
  },
  {
    "Other": "But just to rephrase, what will players be looking for in the *alpha*?",
    "Zaltys": "The usual alpha testing stuff: poking at things and seeing if you can break them.",
    "timestamp": "2021-05-10T06:23:19.597000+00:00",
    "date": "m05-d10"
  },
  {
    "Other": "They're two competely different phases of development.",
    "Zaltys": "Alpha will last a couple of days, maybe a bit more. There's no harm in talking about beta in advance.",
    "timestamp": "2021-05-10T06:20:21.648000+00:00",
    "date": "m05-d10"
  },
  {
    "Other": "Alpha isn't beta, beta is the nearly finished product. <:WaitWhat:839168930118500362>",
    "Zaltys": "What do you think comes after alpha? <:confusion:655176671451807745>",
    "timestamp": "2021-05-10T06:08:30.835000+00:00",
    "date": "m05-d10"
  },
  {
    "Other": "Closed beta lmao",
    "Zaltys": "https://discord.com/channels/836774308772446268/837402685824565278/840976486886670336",
    "timestamp": "2021-05-10T05:27:37.116000+00:00",
    "date": "m05-d10"
  },
  {
    "Other": "not too big on utilizing my mail for ai schmuck, so i'm waiting for a tutorial on running gpt-neo locally",
    "Zaltys": "If you have hardware for it, just go here and follow instructions: https://github.com/KoboldAI/KoboldAI-Client",
    "timestamp": "2021-05-09T20:36:12.110000+00:00",
    "date": "m05-d09"
  },
  {
    "Other": "That's right, putting pineapples on pizza",
    "Zaltys": "Pineapple and ham is the most popular pizza everywhere in Scandinavia.",
    "timestamp": "2021-05-09T08:15:56.477000+00:00",
    "date": "m05-d09"
  },
  {
    "Other": "also please fucking shoot the next person that posts a suggestion along the vein of 'please have the AI read this single individual book'\n\njesus christ how annoying",
    "Zaltys": "A lot of the suggested books made it in. If anything, more suggestions would be nice. It's easy to overlook something, especially among more obscure books.",
    "timestamp": "2021-05-08T14:59:31.415000+00:00",
    "date": "m05-d08"
  },
  {
    "Other": "b/c the davinci model is much smarter than the caliber of intelligence shown by the current AI Dungeon",
    "Zaltys": "I think Dragon's davinci, but lobotomized by all the output biases Latitude uses.",
    "timestamp": "2021-05-08T06:55:26.918000+00:00",
    "date": "m05-d08"
  },
  {
    "Other": "how",
    "Zaltys": "OpenAI beta. Invite only.",
    "timestamp": "2021-05-08T06:54:08.475000+00:00",
    "date": "m05-d08"
  },
  {
    "Other": "Grab the development branch of it (https://github.com/Gnurro/FinetuneReFormatter/tree/development), install the requirements in requirements.txt, then run baseGUI.py and tell me which libs/modules are missing to run it.",
    "Zaltys": "No problems with 3.9.0.",
    "timestamp": "2021-05-07T17:19:42.919000+00:00",
    "date": "m05-d07"
  },
  {
    "Other": "What's the next planned weight then? I thought it was sub double digits.",
    "Zaltys": "```eleutherai/gpt-neo-pile-1.3B\neleutherai/gpt-neo-pile-2.7B\neleutherai/gpt-jax-pile-6B\neleutherai/gpt-jax-pile-13B\neleutherai/gpt-jax-pile-20B\neleutherai/gpt-neox-pile-175B``` That seems to indicate what their plans are.",
    "timestamp": "2021-05-06T15:09:15.930000+00:00",
    "date": "m05-d06"
  },
  {
    "Other": "Check the gitlab pin in <#837259157538340864>",
    "Zaltys": "That's just some of the suggestions. Maybe 1% of what went in.",
    "timestamp": "2021-05-06T11:41:51.929000+00:00",
    "date": "m05-d06"
  },
  {
    "Other": "ancient history? like mesopotamian bronze age shit?",
    "Zaltys": "Wikipedia is in the Pile, as are hundreds of history books. There's 250K+ books in total in it.",
    "timestamp": "2021-05-06T11:08:56.441000+00:00",
    "date": "m05-d06"
  },
  {
    "Other": "What exactly is the finetuning model? I was under the impression that the AI model is trained and that's it.",
    "Zaltys": "Think of the base as a factory. And finetuning as retooling the factory.",
    "timestamp": "2021-05-06T10:54:22.367000+00:00",
    "date": "m05-d06"
  },
  {
    "Other": "Do you know if the devs have planned to release different models(like AID had both Griffin and Dragon) ?",
    "Zaltys": "```Dataset curation focus:\n1. ADVENTURE (novels + translated light novels) -> first model we will train\n2. GENERAL LITERATURE\n3. HORROR``` But these are more like Lovecraft model than Griffon vs Dragon.",
    "timestamp": "2021-05-06T10:52:08.160000+00:00",
    "date": "m05-d06"
  },
  {
    "Other": "<@409511804293611530> Checked a few entries in your Pokémon description list, found this spelling error on Ralts\n\n\"SIZE: 1ft4in/40cm\nalts is a humanoid...\"",
    "Zaltys": "Thanks. ...I hate how Discord doesn't allow replacing documents. Guess I'll have to reupload it to fix that.",
    "timestamp": "2021-05-04T10:02:47.285000+00:00",
    "date": "m05-d04"
  },
  {
    "Other": "Just for future reference https://github.com/EleutherAI/the-pile/tree/master I bookmarked it",
    "Zaltys": "Okay, that's a lot of books. And I see that some of the suggested ones are already included. Let's see... All of animorphs books, some Pratchett, some Iain Banks (but no Excession)... Will have to double-reference the list, so NovelAI doesn't get finetuned with something that's already in there.",
    "timestamp": "2021-05-01T18:17:37.749000+00:00",
    "date": "m05-d01"
  },
  {
    "Other": "Was bestiality already nuked? I saw people mentioning that.",
    "Zaltys": "They tried by banning horse and dog, but that backfired when their knight scenario bricked.",
    "timestamp": "2021-05-01T06:25:05.857000+00:00",
    "date": "m05-d01"
  },
  {
    "Other": "https://files.catbox.moe/6pq8o8.png",
    "Zaltys": "Ooh, nice. Hydrus is exactly the kind of software that I've been looking for years, thanks.",
    "timestamp": "2021-04-30T10:33:36.513000+00:00",
    "date": "m04-d30"
  },
  {
    "Other": "i wonder if GPT-Neo will work differently with the existing formats",
    "Zaltys": "AID filtered `<>` and (to lesser degree) `[]` from the output. That's the only reason why formats worked.\nTrying to use them in horni outputs the formatting nine times out of ten, not usable.",
    "timestamp": "2021-04-30T07:45:06.160000+00:00",
    "date": "m04-d30"
  },
  {
    "Other": "so the starting stages will not be like Griffin or Dragon, thats what im hearing right?",
    "Zaltys": "Definitely better than Classic, though.",
    "timestamp": "2021-04-30T06:51:48.575000+00:00",
    "date": "m04-d30"
  },
  {
    "Other": "Anon data wouldn't be very useful since it would be flooded and hard to police Grammar errors to prevent them from corrupting the AI, as OpenAI and Latitude allowed to happen.",
    "Zaltys": "Much of that was because of the repetition penalty, which is a problem in Neo too. And folks over at Eleuther seem to think that typos are required, so the AI knows how to handle those in input.",
    "timestamp": "2021-04-30T06:47:08.188000+00:00",
    "date": "m04-d30"
  },
  {
    "Other": "We have no current plans to offer a Novel provided explore feature. At most, we will work with community endeavors to share content.",
    "Zaltys": "I was talking about using old AID generated stories for training. Wouldn't want to share those as dataset, unless it's anon.",
    "timestamp": "2021-04-30T06:43:10.738000+00:00",
    "date": "m04-d30"
  }
]
